[
  {
    "title": "Iran's State TV Hijacked Mid-Broadcast Amid Geopolitical Tensions; $90M Stolen in Crypto Heist",
    "link": "https://thehackernews.com/2025/06/irans-state-tv-hijacked-mid-broadcast.html",
    "summary": "Iran's state-owned TV broadcaster was hacked Wednesday night to interrupt regular programming and air videos calling for street protests against the Iranian government, according to multiple reports.\nIt's currently not known who is behind the attack, although Iran pointed fingers at Israel, per Iran",
    "published": "2025-06-20T11:54:00",
    "source": "HackerNews"
  },
  {
    "title": "6 Steps to 24/7 In-House SOC Success",
    "link": "https://thehackernews.com/2025/06/6-steps-to-247-in-house-soc-success.html",
    "summary": "Hackers never sleep, so why should enterprise defenses? Threat actors prefer to target businesses during off-hours. That’s when they can count on fewer security personnel monitoring systems, delaying response and remediation.\nWhen retail giant Marks &amp; Spencer experienced a security event over Ea",
    "published": "2025-06-20T10:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Massive 7.3 Tbps DDoS Attack Delivers 37.4 TB in 45 Seconds, Targeting Hosting Provider",
    "link": "https://thehackernews.com/2025/06/massive-73-tbps-ddos-attack-delivers.html",
    "summary": "Cloudflare on Thursday said it autonomously blocked the largest ever distributed denial-of-service (DDoS) attack ever recorded, which hit a peak of 7.3 terabits per second (Tbps).\nThe attack, which was detected in mid-May 2025, targeted an unnamed hosting provider.\n\"Hosting providers and critical In",
    "published": "2025-06-20T09:36:00",
    "source": "HackerNews"
  },
  {
    "title": "200+ Trojanized GitHub Repositories Found in Campaign Targeting Gamers and Developers",
    "link": "https://thehackernews.com/2025/06/67-trojanized-github-repositories-found.html",
    "summary": "Cybersecurity researchers have uncovered a new campaign in which the threat actors have published more than 67 GitHub repositories that claim to offer Python-based hacking tools, but deliver trojanized payloads instead.\nThe activity, codenamed Banana Squad by ReversingLabs, is assessed to be a conti",
    "published": "2025-06-20T07:41:00",
    "source": "HackerNews"
  }
]