[
  {
    "title": "Louis Vuitton says regional data breaches tied to same cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/louis-vuitton-says-regional-data-breaches-tied-to-same-cyberattack/",
    "summary": "Luxury fashion giant Louis Vuitton confirmed that breaches impacting customers in the UK, South Korea, and Turkey stem from the same security incident, which is believed to be linked to the ShinyHunters extortion group. [...]",
    "published": "2025-07-16T19:26:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Leverage Microsoft Teams to Spread Matanbuchus 3.0 Malware to Targeted Firms",
    "link": "https://thehackernews.com/2025/07/hackers-leverage-microsoft-teams-to.html",
    "summary": "Cybersecurity researchers have flagged a new variant of a known malware loader called Matanbuchus that packs in significant features to enhance its stealth and evade detection.\nMatanbuchus is the name given to a malware-as-a-service (MaaS) offering that can act as a conduit for next-stage payloads, ",
    "published": "2025-07-16T17:48:00",
    "source": "HackerNews"
  },
  {
    "title": "Cloudflare says 1.1.1.1 outage not caused by attack or BGP hijack",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-says-1111-outage-not-caused-by-attack-or-bgp-hijack/",
    "summary": "To quash speculation of a cyberattack or BGP hijack incident causing the recent 1.1.1.1 Resolver service outage, Cloudflare explains in a post mortem that the incident was caused by an internal misconfiguration. [...]",
    "published": "2025-07-16T16:49:29",
    "source": "BleepingComputer"
  },
  {
    "title": "SonicWall SMA devices hacked with OVERSTEP rootkit tied to ransomware",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma-devices-hacked-with-overstep-rootkit-tied-to-ransomware/",
    "summary": "A threat actor has been deploying a previously unseen malware called OVERSTEP that modifies the boot process of fully-patched but no longer supported SonicWall Secure Mobile Access appliances. [...]",
    "published": "2025-07-16T15:33:15",
    "source": "BleepingComputer"
  },
  {
    "title": "New Fortinet FortiWeb hacks likely linked to public RCE exploits",
    "link": "https://www.bleepingcomputer.com/news/security/new-fortinet-fortiweb-hacks-likely-linked-to-public-rce-exploits/",
    "summary": "Multiple Fortinet FortiWeb instances recently infected with web shells are believed to have been compromised using public exploits for a recently patched remote code execution (RCE) flaw tracked as CVE-2025-25257. [...]",
    "published": "2025-07-16T14:58:52",
    "source": "BleepingComputer"
  },
  {
    "title": "Europol disrupts pro-Russian NoName057(16) DDoS hacktivist group",
    "link": "https://www.bleepingcomputer.com/news/security/europol-disrupts-pro-russian-noname05716-ddos-hacktivist-group/",
    "summary": "An international law enforcement operation dubbed \"Operation Eastwood\" has targeted the infrastructure of the pro-Russian hacktivist group NoName057(16), responsible for distributed denial-of-service (DDoS) attacks across Europe and the US. [...]",
    "published": "2025-07-16T14:07:30",
    "source": "BleepingComputer"
  },
  {
    "title": "UNC6148 Backdoors Fully-Patched SonicWall SMA 100 Series Devices with OVERSTEP Rootkit",
    "link": "https://thehackernews.com/2025/07/unc6148-backdoors-fully-patched.html",
    "summary": "A threat activity cluster has been observed targeting fully-patched end-of-life SonicWall Secure Mobile Access (SMA) 100 series appliances as part of a campaign designed to drop a backdoor called OVERSTEP.\nThe malicious activity, dating back to at least October 2024, has been attributed by the Googl",
    "published": "2025-07-16T14:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Critical Golden dMSA Attack in Windows Server 2025 Enables Cross-Domain Attacks and Persistent Access",
    "link": "https://thehackernews.com/2025/07/critical-golden-dmsa-attack-in-windows.html",
    "summary": "Cybersecurity researchers have disclosed what they say is a \"critical design flaw\" in delegated Managed Service Accounts (dMSAs) introduced in Windows Server 2025.\n\"The flaw can result in high-impact attacks, enabling cross-domain lateral movement and persistent access to all managed service account",
    "published": "2025-07-16T11:58:00",
    "source": "HackerNews"
  },
  {
    "title": "AI Agents Act Like Employees With Root Access—Here's How to Regain Control",
    "link": "https://thehackernews.com/2025/07/ai-agents-act-like-employees-with-root.html",
    "summary": "The AI gold rush is on. But without identity-first security, every deployment becomes an open door. Most organizations secure native AI like a web app, but it behaves more like a junior employee with root access and no manager.\nFrom Hype to High Stakes\nGenerative AI has moved beyond the hype cycle. ",
    "published": "2025-07-16T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Grok 4 benchmark results: Tops math, ranks second in coding",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/grok-4-benchmark-results-tops-math-ranks-second-in-coding/",
    "summary": "Grok 4 is a huge leap from Grok 3, but how good is it compared to other models in the market, such as Gemini 2.5 Pro? We now have answers, thanks to new independent benchmarks. [...]",
    "published": "2025-07-16T10:35:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Google fixes actively exploited sandbox escape zero day in Chrome",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-actively-exploited-sandbox-escape-zero-day-in-chrome/",
    "summary": "Google has released a security update for Chrome to address half a dozen vulnerabilities, one of them actively exploited by attackers to escape the browser's sandbox protection. [...]",
    "published": "2025-07-16T09:47:46",
    "source": "BleepingComputer"
  },
  {
    "title": "New Konfety Malware Variant Evades Detection by Manipulating APKs and Dynamic Code",
    "link": "https://thehackernews.com/2025/07/new-konfety-malware-variant-evades.html",
    "summary": "Cybersecurity researchers have discovered a new, sophisticated variant of a known Android malware referred to as Konfety that leverages the evil twin technique to enable ad fraud.\nThe sneaky approach essentially involves a scenario wherein two variants of an application share the same package name: ",
    "published": "2025-07-16T09:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Deepfakes. Fake Recruiters. Cloned CFOs — Learn How to Stop AI-Driven Attacks in Real Time",
    "link": "https://thehackernews.com/2025/07/deepfakes-fake-recruiters-cloned-cfos.html",
    "summary": "Social engineering attacks have entered a new era—and they’re coming fast, smart, and deeply personalized.\nIt’s no longer just suspicious emails in your spam folder. Today’s attackers use generative AI, stolen branding assets, and deepfake tools to mimic your executives, hijack your social channels,",
    "published": "2025-07-16T09:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Urgent: Google Releases Critical Chrome Update for CVE-2025-6558 Exploit Active in the Wild",
    "link": "https://thehackernews.com/2025/07/urgent-google-releases-critical-chrome.html",
    "summary": "Google on Tuesday rolled out fixes for six security issues in its Chrome web browser, including one that it said has been exploited in the wild.\nThe high-severity vulnerability in question is CVE-2025-6558 (CVSS score: 8.8), which has been described as an incorrect validation of untrusted input in t",
    "published": "2025-07-16T09:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Google AI \"Big Sleep\" Stops Exploitation of Critical SQLite Vulnerability Before Hackers Act",
    "link": "https://thehackernews.com/2025/07/google-ai-big-sleep-stops-exploitation.html",
    "summary": "Google on Tuesday revealed that its large language model (LLM)-assisted vulnerability discovery framework discovered a security flaw in the SQLite open-source database engine before it could have been exploited in the wild.\nThe vulnerability, tracked as CVE-2025-6965 (CVSS score: 7.2), is a memory c",
    "published": "2025-07-16T07:44:00",
    "source": "HackerNews"
  }
]