[
  {
    "title": "Grinex exchange suspected rebrand of sanctioned Garantex crypto firm",
    "link": "https://www.bleepingcomputer.com/news/cryptocurrency/grinex-exchange-suspected-rebrand-of-sanctioned-garantex-crypto-firm/",
    "summary": "A new cryptocurrency exchange named Grinex is believed to be a rebrand of Garantex, a Russian cryptocurrency exchange whose domains were seized by the U.S. authorities and an admin arrested. [...]",
    "published": "2025-04-29T20:21:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft: Windows Server hotpatching to require subscription",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-server-hotpatching-to-require-subscription/",
    "summary": "Microsoft has announced it will require paid subscriptions for Windows Server 2025 hotpatching, a service that enables admins to install security updates without restarting. [...]",
    "published": "2025-04-29T19:47:15",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers ramp up scans for leaked Git tokens and secrets",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-ramp-up-scans-for-leaked-git-tokens-and-secrets/",
    "summary": "Threat actors are intensifying internet-wide scanning for Git configuration files that can reveal sensitive secrets and authentication tokens used to compromise cloud services and source code repositories. [...]",
    "published": "2025-04-29T19:02:43",
    "source": "BleepingComputer"
  },
  {
    "title": "France ties Russian APT28 hackers to 12 cyberattacks on French orgs",
    "link": "https://www.bleepingcomputer.com/news/security/france-ties-russian-apt28-hackers-to-12-cyberattacks-on-french-orgs/",
    "summary": "Today, the French foreign ministry blamed the APT28 hacking group linked to Russia's military intelligence service (GRU) for targeting or breaching a dozen French entities over the last four years. [...]",
    "published": "2025-04-29T18:57:15",
    "source": "BleepingComputer"
  },
  {
    "title": "Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks",
    "link": "https://www.bleepingcomputer.com/news/security/apple-airborne-flaws-can-lead-to-zero-click-airplay-rce-attacks/",
    "summary": "​A set of security vulnerabilities in Apple's AirPlay Protocol and AirPlay Software Development Kit (SDK) exposed unpatched third-party and Apple devices to various attacks, including remote code execution. [...]",
    "published": "2025-04-29T17:32:05",
    "source": "BleepingComputer"
  },
  {
    "title": "WhatsApp Launches Private Processing to Enable AI Features While Protecting Message Privacy",
    "link": "https://thehackernews.com/2025/04/whatsapp-launches-private-processing-to.html",
    "summary": "Popular messaging app WhatsApp on Tuesday unveiled a new technology called Private Processing to enable artificial intelligence (AI) capabilities in a privacy-preserving manner.\n\"Private Processing will allow users to leverage powerful optional AI features – like summarizing unread messages or editi",
    "published": "2025-04-29T17:22:00",
    "source": "HackerNews"
  },
  {
    "title": "SK Telecom cyberattack: Free SIM replacements for 25 million customers",
    "link": "https://www.bleepingcomputer.com/news/security/sk-telecom-cyberattack-free-sim-replacements-for-25-million-customers/",
    "summary": "South Korean mobile provider SK Telecom has announced free SIM card replacements to its 25 million mobile customers following a recent USIM data breach, but only 6 million cards are available through May. [...]",
    "published": "2025-04-29T16:49:53",
    "source": "BleepingComputer"
  },
  {
    "title": "New Reports Uncover Jailbreaks, Unsafe Code, and Data Theft Risks in Leading AI Systems",
    "link": "https://thehackernews.com/2025/04/new-reports-uncover-jailbreaks-unsafe.html",
    "summary": "Various generative artificial intelligence (GenAI) services have been found vulnerable to two types of jailbreak attacks that make it possible to produce illicit or dangerous content.\nThe first of the two techniques, codenamed Inception, instructs an AI tool to imagine a fictitious scenario, which c",
    "published": "2025-04-29T16:18:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft fixes Outlook paste, blank calendar rendering issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-paste-blank-calendar-rendering-issues/",
    "summary": "Microsoft has confirmed several issues affecting Microsoft 365 customers using the \"paste special' option and the calendar feature in the classic Outlook email client. [...]",
    "published": "2025-04-29T15:45:25",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-tags-broadcom-fabric-os-commvault-flaws-as-exploited-in-attacks/",
    "summary": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) is warning of Broadcom Brocade Fabric OS, Commvault web servers, and Qualitia Active! Mail clients vulnerabilities that are actively exploited in attacks. [...]",
    "published": "2025-04-29T14:15:36",
    "source": "BleepingComputer"
  },
  {
    "title": "SentinelOne Uncovers Chinese Espionage Campaign Targeting Its Infrastructure and Clients",
    "link": "https://thehackernews.com/2025/04/sentinelone-uncovers-chinese-espionage.html",
    "summary": "Cybersecurity company SentinelOne has revealed that a China-nexus threat cluster dubbed PurpleHaze conducted reconnaissance attempts against its infrastructure and some of its high-value customers.\n\"We first became aware of this threat cluster during a 2024 intrusion conducted against an organizatio",
    "published": "2025-04-29T13:07:00",
    "source": "HackerNews"
  },
  {
    "title": "Product Walkthrough: Securing Microsoft Copilot with Reco",
    "link": "https://thehackernews.com/2025/04/product-walkthrough-securing-microsoft.html",
    "summary": "Find out how Reco keeps Microsoft 365 Copilot safe by spotting risky prompts, protecting data, managing user access, and identifying threats - all while keeping productivity high.\n\nMicrosoft 365 Copilot promises to boost productivity by turning natural language prompts into actions. Employees can ge",
    "published": "2025-04-29T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Reports 75 Zero-Days Exploited in 2024 — 44% Targeted Enterprise Security Products",
    "link": "https://thehackernews.com/2025/04/google-reports-75-zero-days-exploited.html",
    "summary": "Google has revealed that it observed 75 zero-day vulnerabilities exploited in the wild in 2024, down from 98 in 2023.&nbsp;\nOf the 75 zero-days, 44% of them targeted enterprise products. As many as 20 flaws were identified in security software and appliances.\n\"Zero-day exploitation of browsers and m",
    "published": "2025-04-29T10:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Google: 97 zero-days exploited in 2024, over 50% in spyware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/google-97-zero-days-exploited-in-2024-over-50-percent-in-spyware-attacks/",
    "summary": "Google's Threat Intelligence Group (GTIG) says attackers exploited 75 zero-day vulnerabilities in the wild last year, over 50% of which were linked to spyware attacks. [...]",
    "published": "2025-04-29T10:00:00",
    "source": "BleepingComputer"
  }
]