[
  {
    "title": "Hackers are exploiting critical flaw in vBulletin forum software",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-are-exploiting-critical-flaw-in-vbulletin-forum-software/",
    "summary": "Two critical vulnerabilities affecting the open-source forum software vBulletin have been discovered, with one confirmed to be actively exploited in the wild. [...]",
    "published": "2025-05-30T19:26:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft now testing Notepad text formatting in Windows 11",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-now-testing-notepad-text-formatting-in-windows-11/",
    "summary": "Microsoft announced today that the Windows 11 Notepad application is getting a text formatting feature supporting Markdown-style input. [...]",
    "published": "2025-05-30T18:41:24",
    "source": "BleepingComputer"
  },
  {
    "title": "Police takes down AVCheck site used by cybercriminals to scan malware",
    "link": "https://www.bleepingcomputer.com/news/security/police-takes-down-avcheck-antivirus-site-used-by-cybercriminals/",
    "summary": "An international law enforcement operation has taken down AVCheck, a service used by cybercriminals to test whether their malware is detected by commercial antivirus software before deploying it in the wild. [...]",
    "published": "2025-05-30T16:46:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Germany doxxes Conti ransomware and TrickBot ring leader",
    "link": "https://www.bleepingcomputer.com/news/security/germany-doxxes-conti-ransomware-and-trickbot-ring-leader/",
    "summary": "The Federal Criminal Police Office of Germany (Bundeskriminalamt or BKA) claims that Stern, the leader of the Trickbot and Conti cybercrime gangs, is a 36-year-old Russian named Vitaly Nikolaevich Kovalev. [...]",
    "published": "2025-05-30T15:57:26",
    "source": "BleepingComputer"
  },
  {
    "title": "New EDDIESTEALER Malware Bypasses Chrome's App-Bound Encryption to Steal Browser Data",
    "link": "https://thehackernews.com/2025/05/eddiestealer-malware-uses-clickfix.html",
    "summary": "A new malware campaign is distributing a novel Rust-based information stealer dubbed EDDIESTEALER using the popular ClickFix social engineering tactic initiated via fake CAPTCHA verification pages.\n\"This campaign leverages deceptive CAPTCHA verification pages that trick users into executing a malici",
    "published": "2025-05-30T14:14:00",
    "source": "HackerNews"
  },
  {
    "title": "Getting Exposure Management Right: Insights from 500 CISOs",
    "link": "https://www.bleepingcomputer.com/news/security/getting-exposure-management-right-insights-from-500-cisos/",
    "summary": "Pentesting isn't just about finding flaws — it's about knowing which ones matter. Pentera's 2025 State of Pentesting report uncovers which assets attackers target most, where security teams are making progress, and which exposures still fly under the radar. Focus on reducing breach impact, not just ",
    "published": "2025-05-30T14:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "China-Linked Hackers Exploit SAP and SQL Server Flaws in Attacks Across Asia and Brazil",
    "link": "https://thehackernews.com/2025/05/china-linked-hackers-exploit-sap-and.html",
    "summary": "The China-linked threat actor behind the recent in-the-wild exploitation of a critical security flaw in SAP NetWeaver has been attributed to a broader set of attacks targeting organizations in Brazil, India, and Southeast Asia since 2023.\n\"The threat actor mainly targets the SQL injection vulnerabil",
    "published": "2025-05-30T11:12:00",
    "source": "HackerNews"
  }
]