[
  {
    "title": "Ukraine claims it hacked Tupolev, Russia’s strategic warplane maker",
    "link": "https://www.bleepingcomputer.com/news/security/ukraine-claims-it-hacked-tupolev-russias-strategic-warplane-maker/",
    "summary": "The Main Intelligence Directorate (GUR) of Ukraine's Ministry of Defense claims it hacked the Russian aerospace and defense company Tupolev, which develops Russia's supersonic strategic bombers. [...]",
    "published": "2025-06-04T18:00:29",
    "source": "BleepingComputer"
  },
  {
    "title": "BidenCash carding market domains seized in international operation",
    "link": "https://www.bleepingcomputer.com/news/security/bidencash-carding-market-domains-seized-in-international-operation/",
    "summary": "Earlier today, law enforcement seized multiple domains of BidenCash, the infamous dark web market for stolen credit cards, personal information, and SSH access. [...]",
    "published": "2025-06-04T17:10:50",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-warns-of-nft-airdrop-scams-targeting-hedera-hashgraph-wallets/",
    "summary": "The FBI is warning about a new scam where cybercriminals exploit NFT airdrops on the Hedera Hashgraph network to steal crypto from cryptocurrency wallets. [...]",
    "published": "2025-06-04T16:37:33",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Exposes Vishing Group UNC6040 Targeting Salesforce with Fake Data Loader App",
    "link": "https://thehackernews.com/2025/06/google-exposes-vishing-group-unc6040.html",
    "summary": "Google has disclosed details of a financially motivated threat cluster that it said \"specialises\" in voice phishing (aka vishing) campaigns designed to breach organizations' Salesforce instances for large-scale data theft and subsequent extortion.\nThe tech giant's threat intelligence team is trackin",
    "published": "2025-06-04T15:24:00",
    "source": "HackerNews"
  },
  {
    "title": "Media giant Lee Enterprises says data breach affects 39,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/media-giant-lee-enterprises-says-data-breach-affects-39-000-people/",
    "summary": "Publishing giant Lee Enterprises is notifying nearly 40,000 people whose personal information was stolen in a February 2025 ransomware attack. [...]",
    "published": "2025-06-04T14:30:14",
    "source": "BleepingComputer"
  },
  {
    "title": "Google: Hackers target Salesforce accounts in data extortion attacks",
    "link": "https://www.bleepingcomputer.com/news/security/google-hackers-target-salesforce-accounts-in-data-extortion-attacks/",
    "summary": "Google has observed hackers claiming to be the ShinyHunters extortion group conducting social engineering attacks against multi-national companies to steal data from organizations' Salesforce platforms. [...]",
    "published": "2025-06-04T14:11:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Kerberos AS-REP roasting attacks: What you need to know",
    "link": "https://www.bleepingcomputer.com/news/security/kerberos-as-rep-roasting-attacks-what-you-need-to-know/",
    "summary": "Think your passwords are strong enough? AS-REP Roasting is back in the spotlight — and it's targeting weak spots in Active Directory. Learn more from Specops Software how attackers exploit missing Kerberos pre-auth and how to stop them with strong password policies. [...]",
    "published": "2025-06-04T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "Chaos RAT Malware Targets Windows and Linux via Fake Network Tool Downloads",
    "link": "https://thehackernews.com/2025/06/chaos-rat-malware-targets-windows-and.html",
    "summary": "Threat hunters are calling attention to a new variant of a remote access trojan (RAT) called Chaos RAT that has been used in recent attacks targeting Windows and Linux systems.\nAccording to findings from Acronis, the malware artifact may have been distributed by tricking victims into downloading a n",
    "published": "2025-06-04T12:55:00",
    "source": "HackerNews"
  },
  {
    "title": "Your SaaS Data Isn't Safe: Why Traditional DLP Solutions Fail in the Browser Era",
    "link": "https://thehackernews.com/2025/06/your-saas-data-isnt-safe-why.html",
    "summary": "Traditional data leakage prevention (DLP) tools aren't keeping pace with the realities of how modern businesses use SaaS applications.\nCompanies today rely heavily on SaaS platforms like Google Workspace, Salesforce, Slack, and generative AI tools, significantly altering the way sensitive informatio",
    "published": "2025-06-04T12:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious PyPI, npm, and Ruby Packages Exposed in Ongoing Open-Source Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/06/malicious-pypi-npm-and-ruby-packages.html",
    "summary": "Several malicious packages have been uncovered across the npm, Python, and Ruby package repositories that drain funds from cryptocurrency wallets, erase entire codebases after installation, and exfiltrate Telegram API tokens, once again demonstrating the variety of supply chain threats lurking in op",
    "published": "2025-06-04T10:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Hacker targets other hackers and gamers with backdoored GitHub code",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-targets-other-hackers-and-gamers-with-backdoored-github-code/",
    "summary": "A hacker targets other hackers, gamers, and researchers with exploits, bots, and game cheats in source code hosted on GitHub that contain hidden backdoors to give the threat actor remote access to infected devices. [...]",
    "published": "2025-06-04T10:00:00",
    "source": "BleepingComputer"
  }
]