[
  {
    "title": "International Criminal Court hit by new 'sophisticated' cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/international-criminal-court-hit-by-new-sophisticated-cyberattack/",
    "summary": "On Monday, the International Criminal Court (ICC) announced that it's investigating a new \"sophisticated\" cyberattack that targeted its systems last week. [...]",
    "published": "2025-07-01T14:21:28",
    "source": "BleepingComputer"
  },
  {
    "title": "US disrupts North Korean IT worker \"laptop farm\" scheme in 16 states",
    "link": "https://www.bleepingcomputer.com/news/security/us-disrupts-north-korean-it-worker-laptop-farm-scheme-in-16-states/",
    "summary": "The U.S. Department of Justice (DoJ) announced coordinated law enforcement actions against North Korean government's fund raising operations using remote IT workers. [...]",
    "published": "2025-07-01T13:56:51",
    "source": "BleepingComputer"
  },
  {
    "title": "Esse Health says recent data breach affects over 263,000 patients",
    "link": "https://www.bleepingcomputer.com/news/security/esse-health-says-recent-data-breach-affects-over-263-000-patients/",
    "summary": "Esse Health, a healthcare provider based in St. Louis, Missouri, is notifying over 263,000 patients that their personal and health information was stolen in an April cyberattack. [...]",
    "published": "2025-07-01T13:04:29",
    "source": "BleepingComputer"
  },
  {
    "title": "Johnson Controls starts notifying people affected by 2023 breach",
    "link": "https://www.bleepingcomputer.com/news/security/johnson-controls-starts-notifying-people-affected-by-2023-breach/",
    "summary": "Building automation giant Johnson Controls is notifying individuals whose data was stolen in a massive ransomware attack that impacted the company's operations worldwide in September 2023. [...]",
    "published": "2025-07-01T11:47:26",
    "source": "BleepingComputer"
  },
  {
    "title": "A New Maturity Model for Browser Security: Closing the Last-Mile Risk",
    "link": "https://thehackernews.com/2025/07/a-new-maturity-model-for-browser.html",
    "summary": "Despite years of investment in Zero Trust, SSE, and endpoint protection, many enterprises are still leaving one critical layer exposed: the browser.\nIt’s where 85% of modern work now happens. It’s also where copy/paste actions, unsanctioned GenAI usage, rogue extensions, and personal devices create ",
    "published": "2025-07-01T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Google fixes fourth actively exploited Chrome zero-day of 2025",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-fourth-actively-exploited-chrome-zero-day-of-2025/",
    "summary": "Google has released emergency updates to patch another Chrome zero-day vulnerability exploited in attacks, marking the fourth such flaw fixed since the start of the year. [...]",
    "published": "2025-07-01T10:59:51",
    "source": "BleepingComputer"
  },
  {
    "title": "Chrome Zero-Day CVE-2025-6554 Under Active Attack — Google Issues Security Update",
    "link": "https://thehackernews.com/2025/07/google-patches-critical-zero-day-flaw.html",
    "summary": "Google has released security updates to address a vulnerability in its Chrome browser for which an exploit exists in the wild.\nThe zero-day vulnerability, tracked as CVE-2025-6554 (CVSS score: N/A), has been described as a type confusing flaw in the V8 JavaScript and WebAssembly engine.\n\"Type confus",
    "published": "2025-07-01T08:55:00",
    "source": "HackerNews"
  },
  {
    "title": "U.S. Arrests Facilitator in North Korean IT Worker Scheme; Seizes 29 Domains and Raids 21 Laptop Farms",
    "link": "https://thehackernews.com/2025/07/us-arrests-key-facilitator-in-north.html",
    "summary": "The U.S. Department of Justice (DoJ) on Monday announced sweeping actions targeting the North Korean information technology (IT) worker scheme, leading to the arrest of one individual and the seizure of 29 financial accounts, 21 fraudulent websites, and nearly 200 computers.\nThe coordinated action s",
    "published": "2025-07-01T07:53:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Removes Password Management from Authenticator App Starting August 2025",
    "link": "https://thehackernews.com/2025/07/microsoft-removes-password-management.html",
    "summary": "Microsoft has said that it's ending support for passwords in its Authenticator app starting August 1, 2025.\nMicrosoft’s move is part of a much larger shift away from traditional password-based logins. The company said the changes are also meant to streamline autofill within its two-factor authentica",
    "published": "2025-07-01T04:21:00",
    "source": "HackerNews"
  }
]