[
  {
    "title": "Marks & Spencer faces $402 million profit hit after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/marks-and-spencer-faces-402-million-profit-hit-after-cyberattack/",
    "summary": "British retailer giant Marks & Spencer (M&amp;S) is bracing for a potential profit hit of up to £300 million £300 million ($402 million) following a recent cyberattack that led to widespread operational and sales disruptions. [...]",
    "published": "2025-05-21T10:10:22",
    "source": "BleepingComputer"
  },
  {
    "title": "Coinbase says recent data breach impacts 69,461 customers",
    "link": "https://www.bleepingcomputer.com/news/security/coinbase-says-recent-data-breach-impacts-69-461-customers/",
    "summary": "Coinbase, a cryptocurrency exchange with over 100 million customers, revealed that a recent data breach in which cybercriminals stole customer and corporate data affected 69,461 individuals [...]",
    "published": "2025-05-21T09:33:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Expose PWA JavaScript Attack That Redirects Users to Adult Scam Apps",
    "link": "https://thehackernews.com/2025/05/researchers-expose-pwa-javascript.html",
    "summary": "Cybersecurity researchers have discovered a new campaign that employs malicious JavaScript injections to redirect site visitors on mobile devices to a Chinese adult-content Progressive Web App (PWA) scam.\n\"While the payload itself is nothing new (yet another adult gambling scam), the delivery method",
    "published": "2025-05-21T09:01:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Chrome Can Now Auto-Change Compromised Passwords Using Its Built-In Manager",
    "link": "https://thehackernews.com/2025/05/google-chrome-can-now-auto-change.html",
    "summary": "Google has announced a new feature in its Chrome browser that lets its built-in Password Manager automatically change a user's password when it detects the credentials to be compromised.\n\"When Chrome detects a compromised password during sign in, Google Password Manager prompts the user with an opti",
    "published": "2025-05-21T07:11:00",
    "source": "HackerNews"
  },
  {
    "title": "PowerSchool hacker pleads guilty to student data extortion scheme",
    "link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-pleads-guilty-to-student-data-extortion-scheme/",
    "summary": "A 19-year-old college student from Worcester, Massachusetts, has agreed to plead guilty to a massive cyberattack on PowerSchool that extorted millions of dollars in exchange for not leaking the personal data of millions of students and teachers. [...]",
    "published": "2025-05-20T23:27:17",
    "source": "BleepingComputer"
  }
]