[
  {
    "title": "Windows 11 now uses JScript9Legacy engine for improved security",
    "link": "https://www.bleepingcomputer.com/news/security/windows-11-now-uses-jscript9legacy-engine-for-improved-security/",
    "summary": "Microsoft announced that it has replaced the default scripting engine JScript with the newer and more secure JScript9Legacy on Windows 11 version 24H2 and later. [...]",
    "published": "2025-07-10T20:46:27",
    "source": "BleepingComputer"
  },
  {
    "title": "UK Arrests Four in ‘Scattered Spider’ Ransom Group",
    "link": "https://krebsonsecurity.com/2025/07/uk-charges-four-in-scattered-spider-ransom-group/",
    "summary": "Authorities in the United Kingdom this week arrested four alleged members of \"Scattered Spider,\" a prolific data theft and extortion group whose recent victims include multiple airlines and the U.K. retail chain Marks &#038; Spencer.",
    "published": "2025-07-10T17:31:10",
    "source": "Krebs"
  },
  {
    "title": "Critical mcp-remote Vulnerability Enables Remote Code Execution, Impacting 437,000+ Downloads",
    "link": "https://thehackernews.com/2025/07/critical-mcp-remote-vulnerability.html",
    "summary": "Cybersecurity researchers have discovered a critical vulnerability in the open-source mcp-remote project that could result in the execution of arbitrary operating system (OS) commands.\nThe vulnerability, tracked as CVE-2025-6514, carries a CVSS score of 9.6 out of 10.0.\n\"The vulnerability allows att",
    "published": "2025-07-10T17:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Russian pro basketball player arrested for alleged role in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/russian-pro-basketball-player-arrested-for-alleged-role-in-ransomware-attacks/",
    "summary": "Russian professional basketball player Daniil Kasatkin was arrested in France at the request of the United States for allegedly acting as a negotiator for a ransomware gang. [...]",
    "published": "2025-07-10T16:26:35",
    "source": "BleepingComputer"
  },
  {
    "title": "PerfektBlue Bluetooth flaws impact Mercedes, Volkswagen, Skoda cars",
    "link": "https://www.bleepingcomputer.com/news/security/perfektblue-bluetooth-flaws-impact-mercedes-volkswagen-skoda-cars/",
    "summary": "Four vulnerabilities dubbed PerfektBlue and affecting the BlueSDK Bluetooth stack from OpenSynergy can be exploited to achieve remote code execution and potentially allow access to critical elements in vehicles from multiple vendors, including Mercedes-Benz AG, Volkswagen, and Skoda. [...]",
    "published": "2025-07-10T16:01:19",
    "source": "BleepingComputer"
  },
  {
    "title": "Fake Gaming and AI Firms Push Malware on Cryptocurrency Users via Telegram and Discord",
    "link": "https://thehackernews.com/2025/07/fake-gaming-and-ai-firms-push-malware.html",
    "summary": "Cryptocurrency users are the target of an ongoing social engineering campaign that employs fake startup companies to trick users into downloading malware that can drain digital assets from both Windows and macOS systems.\n\"These malicious operations impersonate AI, gaming, and Web3 firms using spoofe",
    "published": "2025-07-10T14:41:00",
    "source": "HackerNews"
  },
  {
    "title": "FBI's CJIS demystified: Best practices for passwords, MFA & access control",
    "link": "https://www.bleepingcomputer.com/news/security/fbis-cjis-demystified-best-practices-for-passwords-mfa-and-access-control/",
    "summary": "FBI's Criminal Justice Information Services (CJIS) compliance isn't optional when handling law enforcement data. From MFA to password hygiene, see how Specops Software helps meet FBI standards while also securing your Windows Active Directory. [...]",
    "published": "2025-07-10T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Four arrested in UK over M&S, Co-op, Harrod cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/four-arrested-in-uk-over-mands-co-op-harrod-cyberattacks/",
    "summary": "The UK's National Crime Agency (NCA) arrested four people suspected of being involved in cyberattacks on major retailers in the country, including Marks & Spencer, Co-op, and Harrods. [...]",
    "published": "2025-07-10T13:46:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Four Arrested in £440M Cyber Attack on Marks & Spencer, Co-op, and Harrods",
    "link": "https://thehackernews.com/2025/07/four-arrested-in-440m-cyber-attack-on.html",
    "summary": "The U.K. National Crime Agency (NCA) on Thursday announced that four people have been arrested in connection with cyber attacks targeting major retailers Marks &amp; Spencer, Co-op, and Harrods.\nThe arrested individuals include two men aged 19, a third aged 17, and a 20-year-old woman. They were app",
    "published": "2025-07-10T12:13:00",
    "source": "HackerNews"
  },
  {
    "title": "What Security Leaders Need to Know About AI Governance for SaaS",
    "link": "https://thehackernews.com/2025/07/what-security-leaders-need-to-know.html",
    "summary": "Generative AI is not arriving with a bang, it’s slowly creeping into the software that companies already use on a daily basis. Whether it is video conferencing or CRM, vendors are scrambling to integrate AI copilots and assistants into their SaaS applications. Slack can now provide AI summaries of c",
    "published": "2025-07-10T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "New ZuRu Malware Variant Targeting Developers via Trojanized Termius macOS App",
    "link": "https://thehackernews.com/2025/07/new-macos-malware-zuru-targeting.html",
    "summary": "Cybersecurity researchers have discovered new artifacts associated with an Apple macOS malware called ZuRu, which is known to propagate via trojanized versions of legitimate software.\nSentinelOne, in a new report shared with The Hacker News, said the malware has been observed masquerading as the cro",
    "published": "2025-07-10T10:59:00",
    "source": "HackerNews"
  },
  {
    "title": "AMD Warns of New Transient Scheduler Attacks Impacting a Wide Range of CPUs",
    "link": "https://thehackernews.com/2025/07/amd-warns-of-new-transient-scheduler.html",
    "summary": "Semiconductor company AMD is warning of a new set of vulnerabilities affecting a broad range of chipsets that could lead to information disclosure.\nThe flaws, collectively called Transient Scheduler Attacks (TSA), manifest in the form of a speculative side channel in its CPUs that leverage execution",
    "published": "2025-07-10T10:44:00",
    "source": "HackerNews"
  }
]