[
  {
    "title": "Threat actors abuse Google Apps Script in evasive phishing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/threat-actors-abuse-google-apps-script-in-evasive-phishing-attacks/",
    "summary": "Threat actors are abusing the trusted Google platform 'Google Apps Script' to host phishing pages, making them appear legitimate and eliminating the risk of them getting flagged by security tools. [...]",
    "published": "2025-05-29T16:25:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Apple Safari exposes users to fullscreen browser-in-the-middle attacks",
    "link": "https://www.bleepingcomputer.com/news/security/apple-safari-exposes-users-to-fullscreen-browser-in-the-middle-attacks/",
    "summary": "A weakness in Apple's Safari web browser allows threat actors to leverage the fullscreen browser-in-the-middle (BitM) technique to steal account credentials from unsuspecting users. [...]",
    "published": "2025-05-29T16:06:25",
    "source": "BleepingComputer"
  },
  {
    "title": "US sanctions firm linked to cyber scams behind $200 million in losses",
    "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-company-linked-to-hundreds-of-thousands-of-cyber-scam-sites/",
    "summary": "The U.S. Treasury Department has sanctioned Funnull Technology, a Philippines-based company that supports hundreds of thousands of malicious websites behind cyber scams linked to over $200 million in losses for Americans. [...]",
    "published": "2025-05-29T15:42:38",
    "source": "BleepingComputer"
  },
  {
    "title": "Cybercriminals exploit AI hype to spread ransomware, malware",
    "link": "https://www.bleepingcomputer.com/news/security/cybercriminals-exploit-ai-hype-to-spread-ransomware-malware/",
    "summary": "Threat actors linked to lesser-known ransomware and malware projects now use AI tools as lures to infect unsuspecting victims with malicious payloads. [...]",
    "published": "2025-05-29T14:25:52",
    "source": "BleepingComputer"
  },
  {
    "title": "Attackers are mapping your attack surface—are you?",
    "link": "https://www.bleepingcomputer.com/news/security/attackers-are-mapping-your-attack-surface-are-you/",
    "summary": "Attackers are mapping your infrastructure before you even realize what's exposed. Sprocket ASM flips the script — giving you the same recon capabilities they use, plus change detection and actionable insights to close gaps fast. See your attack surface the way hackers do and beat them to it. [...]",
    "published": "2025-05-29T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "New Windows RAT Evades Detection for Weeks Using Corrupted DOS and PE Headers",
    "link": "https://thehackernews.com/2025/05/new-windows-rat-evades-detection-for.html",
    "summary": "Cybersecurity researchers have taken the wraps off an unusual cyber attack that leveraged malware with corrupted DOS and PE headers, according to new findings from Fortinet.\nThe DOS (Disk Operating System) and PE (Portable Executable) headers are essential parts of a Windows PE file, providing infor",
    "published": "2025-05-29T13:16:00",
    "source": "HackerNews"
  },
  {
    "title": "Victoria’s Secret takes down website after security incident",
    "link": "https://www.bleepingcomputer.com/news/security/victorias-secret-takes-down-website-after-security-incident/",
    "summary": "Victoria's Secret, the fashion giant, has taken down its website and some store services because of an ongoing security incident [...]",
    "published": "2025-05-29T11:30:41",
    "source": "BleepingComputer"
  },
  {
    "title": "DragonForce Exploits SimpleHelp Flaws to Deploy Ransomware Across Customer Endpoints",
    "link": "https://thehackernews.com/2025/05/dragonforce-exploits-simplehelp-flaws.html",
    "summary": "The threat actors behind the DragonForce ransomware gained access to an unnamed Managed Service Provider's (MSP) SimpleHelp remote monitoring and management (RMM) tool, and then leveraged it to exfiltrate data and drop the locker on multiple endpoints.\nIt's believed that the attackers exploited a tr",
    "published": "2025-05-29T10:34:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft: Windows 11 might fail to start after installing KB5058405",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-might-fail-to-start-after-installing-kb5058405/",
    "summary": "Microsoft has confirmed that some Windows 11 systems might fail to start after installing the KB5058405 security update released during this month's Patch Tuesday. [...]",
    "published": "2025-05-29T09:59:54",
    "source": "BleepingComputer"
  },
  {
    "title": "Data broker LexisNexis discloses data breach affecting 364,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/data-broker-lexisnexis-discloses-data-breach-affecting-364-000-people/",
    "summary": "Data broker giant LexisNexis Risk Solutions has revealed that unknown attackers stole the personal information of over 364,000 individuals in a December breach. [...]",
    "published": "2025-05-29T08:28:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese APT41 Exploits Google Calendar for Malware Command-and-Control Operations",
    "link": "https://thehackernews.com/2025/05/chinese-apt41-exploits-google-calendar.html",
    "summary": "Google on Wednesday disclosed that the Chinese state-sponsored threat actor known as APT41 leveraged a malware called TOUGHPROGRESS that uses Google Calendar for command-and-control (C2).\nThe tech giant, which discovered the activity in late October 2024, said the malware was hosted on a compromised",
    "published": "2025-05-29T05:59:00",
    "source": "HackerNews"
  },
  {
    "title": "Over 100,000 WordPress Sites at Risk from Critical CVSS 10.0 Vulnerability in Wishlist Plugin",
    "link": "https://thehackernews.com/2025/05/over-100000-wordpress-sites-at-risk.html",
    "summary": "Cybersecurity researchers have disclosed a critical unpatched security flaw impacting TI WooCommerce Wishlist plugin for WordPress that could be exploited by unauthenticated attackers to upload arbitrary files.\nTI WooCommerce Wishlist, which has over 100,000 active installations, is a tool to allow ",
    "published": "2025-05-29T05:34:00",
    "source": "HackerNews"
  }
]