[
  {
    "title": "Cartier discloses data breach amid fashion brand cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/cartier-discloses-data-breach-amid-fashion-brand-cyberattacks/",
    "summary": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised. [...]",
    "published": "2025-06-02T22:31:49",
    "source": "BleepingComputer"
  },
  {
    "title": "The North Face warns customers of April credential stuffing attack",
    "link": "https://www.bleepingcomputer.com/news/security/the-north-face-warns-customers-of-april-credential-stuffing-attack/",
    "summary": "Outdoor apparel retailer The North Face is warning customers that their personal information was stolen in credential stuffing attacks targeting the company's website in April. [...]",
    "published": "2025-06-02T18:37:19",
    "source": "BleepingComputer"
  },
  {
    "title": "SentinelOne: Last week’s 7-hour outage caused by software flaw",
    "link": "https://www.bleepingcomputer.com/news/technology/sentinelone-last-weeks-7-hour-outage-caused-by-software-flaw/",
    "summary": "American cybersecurity company SentinelOne revealed over the weekend that a software flaw triggered a seven-hour-long outage on Thursday. [...]",
    "published": "2025-06-02T18:24:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome to distrust Chunghwa Telecom, Netlock certificates in August",
    "link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-distrust-chunghwa-telecom-netlock-certificates-in-august/",
    "summary": "Google says it will no longer trust root CA certificates signed by Chunghwa Telecom and Netlock in the Chrome Root Store due to a pattern of compliance failures and failure to make improvements. [...]",
    "published": "2025-06-02T17:36:30",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft and CrowdStrike partner to link hacking group names",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-and-crowdstrike-partner-to-link-hacking-group-names/",
    "summary": "Microsoft and CrowdStrike announced today that they've partnered to connect the aliases used for specific threat groups without actually using a single naming standard. [...]",
    "published": "2025-06-02T16:56:55",
    "source": "BleepingComputer"
  },
  {
    "title": "Cryptojacking Campaign Exploits DevOps APIs Using Off-the-Shelf Tools from GitHub",
    "link": "https://thehackernews.com/2025/06/cryptojacking-campaign-exploits-devops.html",
    "summary": "Cybersecurity researchers have discovered a new cryptojacking campaign that's targeting publicly accessible DevOps web servers such as those associated with Docker, Gitea, and HashiCorp Consul and Nomad to illicitly mine cryptocurrencies.\nCloud security firm Wiz, which is tracking the activity under",
    "published": "2025-06-02T16:03:00",
    "source": "HackerNews"
  }
]