[
  {
    "title": "Windows 11 and Red Hat Linux hacked on first day of Pwn2Own",
    "link": "https://www.bleepingcomputer.com/news/security/windows-11-and-red-hat-linux-virtualbox-hacked-on-first-day-of-pwn2own/",
    "summary": "On the first day of Pwn2Own Berlin 2025, security researchers were awarded $260,000 after successfully demonstrating zero-day exploits for Windows 11, Red Hat Linux, Docker Desktop, and Oracle VirtualBox. [...]",
    "published": "2025-05-15T15:48:44",
    "source": "BleepingComputer"
  },
  {
    "title": "New Tor Oniux tool anonymizes any Linux app's network traffic",
    "link": "https://www.bleepingcomputer.com/news/security/new-tor-oniux-tool-anonymizes-any-linux-apps-network-traffic/",
    "summary": "Tor has announced Oniux, a new command-line tool for routing any Linux application securely through the Tor network for anonymized network connections. [...]",
    "published": "2025-05-15T15:20:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Coinbase Agents Bribed, Data of ~1% Users Leaked; $20M Extortion Attempt Fails",
    "link": "https://thehackernews.com/2025/05/coinbase-agents-bribed-data-of-1-users.html",
    "summary": "Cryptocurrency exchange Coinbase has disclosed that unknown cyber actors broke into its systems and stole account data for a small subset of its customers.\n\"Criminals targeted our customer support agents overseas,\" the company said in a statement. \"They used cash offers to convince a small group of ",
    "published": "2025-05-15T14:28:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious NPM package uses Unicode steganography to evade detection",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-npm-package-uses-unicode-steganography-to-evade-detection/",
    "summary": "A malicious package in the Node Package Manager index uses invisible Unicode characters to hide malicious code and Google Calendar links to host the URL for the command-and-control location. [...]",
    "published": "2025-05-15T13:31:47",
    "source": "BleepingComputer"
  },
  {
    "title": "Coinbase data breach exposes customer info and government IDs",
    "link": "https://www.bleepingcomputer.com/news/security/coinbase-discloses-breach-faces-up-to-400-million-in-losses/",
    "summary": "Coinbase, a cryptocurrency exchange with over 100 million customers, has disclosed that cybercriminals working with rogue support agents stole customer data and demanded a $20 million ransom not to publish the stolen information. [...]",
    "published": "2025-05-15T13:28:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Pen Testing for Compliance Only? It's Time to Change Your Approach",
    "link": "https://thehackernews.com/2025/05/pen-testing-for-compliance-only-its.html",
    "summary": "Imagine this: Your organization completed its annual penetration test in January, earning high marks for security compliance. In February, your development team deployed a routine software update. By April, attackers had already exploited a vulnerability introduced in that February update, gaining a",
    "published": "2025-05-15T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "New Chrome Vulnerability Enables Cross-Origin Data Leak via Loader Referrer Policy",
    "link": "https://thehackernews.com/2025/05/new-chrome-vulnerability-enables-cross.html",
    "summary": "Google on Wednesday released updates to address four security issues in its Chrome web browser, including one for which it said there exists an exploit in the wild.\nThe high-severity vulnerability, tracked as CVE-2025-4664 (CVSS score: 4.3), has been characterized as a case of insufficient policy en",
    "published": "2025-05-15T10:43:00",
    "source": "HackerNews"
  },
  {
    "title": "5 BCDR Essentials for Effective Ransomware Defense",
    "link": "https://thehackernews.com/2025/05/top-5-bcdr-capabilities-for-ransomware-defense.html",
    "summary": "Ransomware has evolved into a deceptive, highly coordinated and dangerously sophisticated threat capable of crippling organizations of any size. Cybercriminals now exploit even legitimate IT tools to infiltrate networks and launch ransomware attacks. In a chilling example, Microsoft recently disclos",
    "published": "2025-05-15T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Russia-Linked APT28 Exploited MDaemon Zero-Day to Hack Government Webmail Servers",
    "link": "https://thehackernews.com/2025/05/russia-linked-apt28-exploited-mdaemon.html",
    "summary": "A Russia-linked threat actor has been attributed to a cyber espionage operation targeting webmail servers such as Roundcube, Horde, MDaemon, and Zimbra via cross-site scripting (XSS) vulnerabilities, including a then-zero-day in MDaemon, according to new findings from ESET.\nThe activity, which comme",
    "published": "2025-05-15T10:05:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious npm Package Leverages Unicode Steganography, Google Calendar as C2 Dropper",
    "link": "https://thehackernews.com/2025/05/malicious-npm-package-leverages-unicode.html",
    "summary": "Cybersecurity researchers have discovered a malicious package named \"os-info-checker-es6\" that disguises itself as an operating system information utility to stealthily drop a next-stage payload onto compromised systems.\n\"This campaign employs clever Unicode-based steganography to hide its initial m",
    "published": "2025-05-15T10:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Google fixes high severity Chrome flaw with public exploit",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-high-severity-chrome-flaw-with-public-exploit/",
    "summary": "Google has released emergency security updates to patch a high-severity Chrome vulnerability that has a public exploit and can let attackers hijack accounts. [...]",
    "published": "2025-05-15T08:25:44",
    "source": "BleepingComputer"
  }
]