[
  {
    "title": "Apache Parquet exploit tool detect servers vulnerable to critical flaw",
    "link": "https://www.bleepingcomputer.com/news/security/apache-parquet-exploit-tool-detect-servers-vulnerable-to-critical-flaw/",
    "summary": "A proof-of-concept exploit tool has been publicly released for a maximum severity Apache Parquet vulnerability, tracked as CVE-2025-30065, making it easy to find vulnerable servers. [...]",
    "published": "2025-05-06T18:16:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Samsung MagicINFO 9 Server RCE flaw now exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/samsung-magicinfo-9-server-rce-flaw-now-exploited-in-attacks/",
    "summary": "Hackers are exploiting an unauthenticated remote code execution (RCE) vulnerability in the Samsung MagicINFO 9 Server to hijack devices and deploy malware. [...]",
    "published": "2025-05-06T17:10:23",
    "source": "BleepingComputer"
  },
  {
    "title": "UK Legal Aid Agency investigates cybersecurity incident",
    "link": "https://www.bleepingcomputer.com/news/security/uk-legal-aid-agency-investigates-cybersecurity-incident/",
    "summary": "The Legal Aid Agency (LAA), an executive agency of the UK's Ministry of Justice that oversees billions in legal funding, warned law firms of a security incident and said the attackers might have accessed financial information. [...]",
    "published": "2025-05-06T16:20:30",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Langflow RCE flaw exploited to hack AI app servers",
    "link": "https://www.bleepingcomputer.com/news/security/critical-langflow-rce-flaw-exploited-to-hack-ai-app-servers/",
    "summary": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) has tagged a Langflow remote code execution vulnerability as actively exploited, urging organizations to apply security updates and mitigations as soon as possible. [...]",
    "published": "2025-05-06T16:05:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Exploit Samsung MagicINFO, GeoVision IoT Flaws to Deploy Mirai Botnet",
    "link": "https://thehackernews.com/2025/05/hackers-exploit-samsung-magicinfo.html",
    "summary": "Threat actors have been observed actively exploiting security flaws in GeoVision end-of-life (EoL) Internet of Things (IoT) devices to corral them into a Mirai botnet for conducting distributed denial-of-service (DDoS) attacks.\nThe activity, first observed by the Akamai Security Intelligence and Res",
    "published": "2025-05-06T15:33:00",
    "source": "HackerNews"
  },
  {
    "title": "New Microsoft 365 outage impacts Teams and other services",
    "link": "https://www.bleepingcomputer.com/news/microsoft/new-microsoft-365-outage-impacts-teams-and-other-services/",
    "summary": "Microsoft is investigating a new Microsoft 365 outage affecting multiple services across North America, including the company's Teams collaboration platform. [...]",
    "published": "2025-05-06T15:31:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Why EASM is vital to modern digital risk protection",
    "link": "https://www.bleepingcomputer.com/news/security/why-easm-is-vital-to-modern-digital-risk-protection/",
    "summary": "You can't protect what you can't see. From shadow IT to supplier risk, modern attack surfaces are sprawling fast — and External Attack Surface Management (EASM) is how security teams take back control. Learn from Outpost24 how EASM powers proactive digital risk protection. [...]",
    "published": "2025-05-06T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "New Investment Scams Use Facebook Ads, RDGA Domains, and IP Checks to Filter Victims",
    "link": "https://thehackernews.com/2025/05/new-investment-scams-use-facebook-ads.html",
    "summary": "Cybersecurity researchers have lifted the lid on two threat actors that orchestrate investment scams through spoofed celebrity endorsements and conceal their activity through traffic distribution systems (TDSes).\nThe activity clusters have been codenamed Reckless Rabbit and Ruthless Rabbit by DNS th",
    "published": "2025-05-06T13:36:00",
    "source": "HackerNews"
  },
  {
    "title": "Google fixes actively exploited FreeType flaw on Android",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-actively-exploited-freetype-flaw-on-android/",
    "summary": "Google has released the May 2025 security updates for Android with fixes for 45 security flaws, including an actively exploited zero-click FreeType 2 code execution vulnerability. [...]",
    "published": "2025-05-06T13:33:38",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft unveils new AI agents that can modify Windows settings",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-new-ai-agents-that-can-modify-windows-settings/",
    "summary": "Today, Microsoft announced new Windows experiences for Copilot+ PCs, including AI agents that will make changing settings on your Windows computer easier. [...]",
    "published": "2025-05-06T13:00:00",
    "source": "BleepingComputer"
  }
]