[
  {
    "title": "Pakistani Firm Shipped Fentanyl Analogs, Scams to US",
    "link": "https://krebsonsecurity.com/2025/05/pakistani-firm-shipped-fentanyl-analogs-scams-to-us/",
    "summary": "A Texas firm recently charged with conspiring to distribute synthetic opioids in the United States is at the center of a vast network of companies in the U.S. and Pakistan whose employees are accused of using online ads to scam westerners seeking help with trademarks, book writing, mobile app develo",
    "published": "2025-05-07T22:22:48",
    "source": "Krebs"
  },
  {
    "title": "PowerSchool hacker now extorting individual school districts",
    "link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-now-extorting-individual-school-districts/",
    "summary": "PowerSchool is warning that the hacker behind its December cyberattack is now individually extorting schools, threatening to release the previously stolen student and teacher data if a ransom is not paid. [...]",
    "published": "2025-05-07T18:25:39",
    "source": "BleepingComputer"
  },
  {
    "title": "CoGUI phishing platform sent 580 million emails to steal credentials",
    "link": "https://www.bleepingcomputer.com/news/security/cogui-phishing-platform-sent-580-million-emails-to-steal-credentials/",
    "summary": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data. [...]",
    "published": "2025-05-07T18:02:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers exploit OttoKit WordPress plugin flaw to add admin accounts",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-ottokit-wordpress-plugin-flaw-to-add-admin-accounts/",
    "summary": "Hackers are exploiting a critical unauthenticated privilege escalation vulnerability in the OttoKit WordPress plugin to create rogue admin accounts on targeted sites. [...]",
    "published": "2025-05-07T15:37:48",
    "source": "BleepingComputer"
  },
  {
    "title": "Play ransomware exploited Windows logging flaw in zero-day attacks",
    "link": "https://www.bleepingcomputer.com/news/security/play-ransomware-exploited-windows-logging-flaw-in-zero-day-attacks/",
    "summary": "The Play ransomware gang has exploited a high-severity Windows Common Log File System flaw in zero-day attacks to gain SYSTEM privileges and deploy malware on compromised systems. [...]",
    "published": "2025-05-07T14:45:19",
    "source": "BleepingComputer"
  },
  {
    "title": "NSO Group fined $167M for spyware attacks on 1,400 WhatsApp users",
    "link": "https://www.bleepingcomputer.com/news/legal/nso-group-fined-167m-for-spyware-attacks-on-1-400-whatsapp-users/",
    "summary": "A U.S. federal jury has ordered Israeli spyware vendor NSO Group to pay WhatsApp $167,254,000 in punitive damages and $444,719 in compensatory damages for a 2019 campaign that targeted 1,400 users of the communication app. [...]",
    "published": "2025-05-07T14:09:33",
    "source": "BleepingComputer"
  },
  {
    "title": "Doubling down: How Universal 2nd Factor (U2F) boosts online security",
    "link": "https://www.bleepingcomputer.com/news/security/doubling-down-how-universal-2nd-factor-u2f-boosts-online-security/",
    "summary": "Passwords alone aren't cutting it—31% of breaches involve stolen credentials. Learn from Specops Software about how Universal 2nd Factor (U2F) and strong password policies can work together to keep your organization secure. [...]",
    "published": "2025-05-07T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Europol Shuts Down Six DDoS-for-Hire Services Used in Global Attacks",
    "link": "https://thehackernews.com/2025/05/europol-shuts-down-six-ddos-for-hire.html",
    "summary": "Europol has announced the takedown of distributed denial of service (DDoS)-for-hire services that were used to launch thousands of cyber-attacks across the world.\nIn connection with the operation, Polish authorities have arrested four individuals and the United States has seized nine domains that ar",
    "published": "2025-05-07T13:54:00",
    "source": "HackerNews"
  },
  {
    "title": "OttoKit WordPress Plugin with 100K+ Installs Hit by Exploits Targeting Multiple Flaws",
    "link": "https://thehackernews.com/2025/05/ottokit-wordpress-plugin-with-100k.html",
    "summary": "A second security flaw impacting the OttoKit (formerly SureTriggers) WordPress plugin has come under active exploitation in the wild.\nThe vulnerability, tracked as CVE-2025-27007 (CVSS score: 9.8), is a privilege escalation bug impacting all versions of the plugin prior to and including version 1.0.",
    "published": "2025-05-07T13:44:00",
    "source": "HackerNews"
  },
  {
    "title": "Medical device maker Masimo warns of cyberattack, manufacturing delays",
    "link": "https://www.bleepingcomputer.com/news/security/medical-device-maker-masimo-warns-of-cyberattack-manufacturing-delays/",
    "summary": "Medical device company Masimo Corporation warns that a cyberattack is impacting production operations and causing delays in fulfilling customers' orders. [...]",
    "published": "2025-05-07T13:39:33",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA warns of hackers targeting critical oil infrastructure",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-hackers-targeting-critical-oil-infrastructure/",
    "summary": "CISA warned critical infrastructure organizations of \"unsophisticated\" threat actors actively targeting the U.S. oil and natural gas sectors. [...]",
    "published": "2025-05-07T13:17:39",
    "source": "BleepingComputer"
  },
  {
    "title": "SysAid Patches 4 Critical Flaws Enabling Pre-Auth RCE in On-Premise Version",
    "link": "https://thehackernews.com/2025/05/sysaid-patches-4-critical-flaws.html",
    "summary": "Cybersecurity researchers have disclosed multiple security flaw in the on-premise version of SysAid IT support software that could be exploited to achieve pre-authenticated remote code execution with elevated privileges.\nThe vulnerabilities, tracked as CVE-2025-2775, CVE-2025-2776, and CVE-2025-2777",
    "published": "2025-05-07T11:31:00",
    "source": "HackerNews"
  },
  {
    "title": "Police takes down six DDoS-for-hire services, arrests admins",
    "link": "https://www.bleepingcomputer.com/news/security/police-takes-down-six-ddos-for-hire-services-arrests-admins/",
    "summary": "​Polish authorities have detained four suspects linked to six DDoS-for-hire platforms, believed to have facilitated thousands of attacks targeting schools, government services, businesses, and gaming platforms worldwide since 2022. [...]",
    "published": "2025-05-07T11:23:37",
    "source": "BleepingComputer"
  }
]