[
  {
    "title": "Claude 4 benchmarks show improvements, but context is still 200K",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/claude-4-benchmarks-show-improvements-but-context-is-still-200k/",
    "summary": "Today, OpenAI rival Anthropic announced Claude 4 models, which are significantly better than Claude 3 in benchmarks, but we're left disappointed with the same 200,000 context window limit. [...]",
    "published": "2025-05-22T23:17:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Oops: DanaBot Malware Devs Infected Their Own PCs",
    "link": "https://krebsonsecurity.com/2025/05/oops-danabot-malware-devs-infected-their-own-pcs/",
    "summary": "The U.S. government today unsealed criminal charges against 16 individuals accused of operating and selling DanaBot, a prolific strain of information-stealing malware that has been sold on Russian cybercrime forums since 2018. The FBI says a newer version of DanaBot was used for espionage, and that ",
    "published": "2025-05-22T21:53:21",
    "source": "Krebs"
  },
  {
    "title": "US indicts leader of Qakbot botnet linked to ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-indicts-leader-of-qakbot-botnet-linked-to-ransomware-attacks/",
    "summary": "The U.S. government has indicted Russian national Rustam Rafailevich Gallyamov, the leader of the Qakbot botnet malware operation that compromised over 700,000 computers and enabled ransomware attacks. [...]",
    "published": "2025-05-22T20:16:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers use fake Ledger apps to steal Mac users’ seed phrases",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-use-fake-ledger-apps-to-steal-mac-users-seed-phrases/",
    "summary": "Cybercriminal campaigns are using fake Ledger apps to target macOS users and their digital assets by deploying malware that attempts to steal seed phrases that protect access to digital cryptocurrency wallets. [...]",
    "published": "2025-05-22T16:45:56",
    "source": "BleepingComputer"
  },
  {
    "title": "Police arrests 270 dark web vendors, buyers in global crackdown",
    "link": "https://www.bleepingcomputer.com/news/security/police-arrests-270-dark-web-vendors-buyers-in-global-crackdown/",
    "summary": "Police arrested 270 suspects following an international law enforcement action codenamed 'Operation RapTor' that targeted dark web vendors and customers from ten countries. [...]",
    "published": "2025-05-22T15:42:29",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese Hackers Exploit Trimble Cityworks Flaw to Infiltrate U.S. Government Networks",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-trimble.html",
    "summary": "A Chinese-speaking threat actor tracked as UAT-6382 has been linked to the exploitation of a now-patched remote-code-execution vulnerability in Trimble Cityworks to deliver Cobalt Strike and VShell.\n\"UAT-6382 successfully exploited CVE-2025-0944, conducted reconnaissance, and rapidly deployed a vari",
    "published": "2025-05-22T15:06:00",
    "source": "HackerNews"
  },
  {
    "title": "Ivanti EPMM flaw exploited by Chinese hackers to breach govt agencies",
    "link": "https://www.bleepingcomputer.com/news/security/ivanti-epmm-flaw-exploited-by-chinese-hackers-to-breach-govt-agencies/",
    "summary": "Chinese hackers have been exploiting a remote code execution flaw in Ivanti Endpoint Manager Mobile (EPMM) to breach high-profile organizations worldwide. [...]",
    "published": "2025-05-22T14:23:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese hackers breach US local governments using Cityworks zero-day",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-breach-us-local-governments-using-cityworks-zero-day/",
    "summary": "Chinese-speaking hackers have exploited a now-patched Trimble Cityworks zero-day to breach multiple local governing bodies across the United States. [...]",
    "published": "2025-05-22T13:58:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Windows Server 2025 dMSA Vulnerability Enables Active Directory Compromise",
    "link": "https://thehackernews.com/2025/05/critical-windows-server-2025-dmsa.html",
    "summary": "A privilege escalation flaw has been demonstrated in Windows Server 2025 that makes it possible for attackers to compromise any user in Active Directory (AD).\n\"The attack exploits the delegated Managed Service Account (dMSA) feature that was introduced in Windows Server 2025, works with the default ",
    "published": "2025-05-22T12:35:00",
    "source": "HackerNews"
  },
  {
    "title": "FTC finalizes order requiring GoDaddy to secure hosting services",
    "link": "https://www.bleepingcomputer.com/news/security/ftc-finalizes-order-requiring-godaddy-to-secure-hosting-services/",
    "summary": "The Federal Trade Commission (FTC) has finalized an order requiring web hosting giant GoDaddy to secure its services to settle charges of data security failures that led to several data breaches since 2018. [...]",
    "published": "2025-05-22T12:28:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese Hackers Exploit Ivanti EPMM Bugs in Global Enterprise Network Attacks",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-ivanti-epmm.html",
    "summary": "A recently patched pair of security flaws affecting Ivanti Endpoint Manager Mobile (EPMM) software has been exploited by a China-nexus threat actor to target a wide range of sectors across Europe, North America, and the Asia-Pacific region.\nThe vulnerabilities, tracked as CVE-2025-4427 (CVSS score: ",
    "published": "2025-05-22T12:07:00",
    "source": "HackerNews"
  }
]