[
  {
    "title": "New Android Malware Surge Hits Devices via Overlays, Virtualization Fraud and NFC Theft",
    "link": "https://thehackernews.com/2025/06/new-android-malware-surge-hits-devices.html",
    "summary": "Cybersecurity researchers have exposed the inner workings of an Android malware called AntiDot that has compromised over 3,775 devices as part of 273 unique campaigns.\n\"Operated by the financially motivated threat actor LARVA-398, AntiDot is actively sold as a Malware-as-a-Service (MaaS) on undergro",
    "published": "2025-06-19T17:23:00",
    "source": "HackerNews"
  },
  {
    "title": "Webinar: Stolen credentials are the new front door to your network",
    "link": "https://www.bleepingcomputer.com/news/security/webinar-stolen-credentials-are-the-new-front-door-to-your-network/",
    "summary": "Cybercriminals no longer need zero-days to breach your systems—these days, they just log in. Join BleepingComputer, SC Media, and Specops Software's Darren Siegel on July 9 at 2:00 PM ET for a live webinar on how attackers are using stolen credentials to infiltrate networks and how you can stop them",
    "published": "2025-06-19T16:33:21",
    "source": "BleepingComputer"
  },
  {
    "title": "OpenAI’s Sam Altman discusses GPT-5 release date",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-sam-altman-discusses-gpt-5-release-date/",
    "summary": "ChatGPT's next big upgrade, or the new foundational model \"GPT-5,\" is still being prepared for a release in the summer, but OpenAI won't share the specifics. [...]",
    "published": "2025-06-19T15:43:06",
    "source": "BleepingComputer"
  },
  {
    "title": "US recovers $225 million of crypto stolen in investment scams",
    "link": "https://www.bleepingcomputer.com/news/legal/us-recovers-225-million-of-crypto-stolen-in-investment-scams/",
    "summary": "The U.S. Department of Justice has seized more than $225 million in cryptocurrency linked to investment fraud and money laundering operations, the largest crypto seizure in the history of the U.S. Secret Service. [...]",
    "published": "2025-06-19T14:33:01",
    "source": "BleepingComputer"
  },
  {
    "title": "Special Webinar: Key Insights from Verizon’s 2025 DBIR",
    "link": "https://www.bleepingcomputer.com/news/security/special-webinar-key-insights-from-verizons-2025-dbir/",
    "summary": "GenAI, credential theft, third-party risks—Verizon's 2025 DBIR reveals what's putting your org at risk. Join DBIR author Alex Pinto & LayerX CEO Or Eshed as they break down this year's key insights and defense strategies. Don't miss the webinar—register now. [...]",
    "published": "2025-06-19T14:04:50",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft unveils new security defaults for Windows 365 Cloud PCs",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-unveils-new-security-defaults-for-windows-365-cloud-pcs/",
    "summary": "Microsoft has announced new Windows 365 security defaults starting in the second half of 2025 and affecting newly provisioned and reprovisioned Cloud PCs. [...]",
    "published": "2025-06-19T13:55:26",
    "source": "BleepingComputer"
  },
  {
    "title": "ChatGPT will analyze Gmail emails, manage schedule on Google Calendar",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-will-analyze-gmail-emails-manage-schedule-on-google-calendar/",
    "summary": "ChatGPT appears to be testing support for Gmail and Google Calendar integration. This will allow users to summarise emails and create events. [...]",
    "published": "2025-06-19T13:29:30",
    "source": "BleepingComputer"
  },
  {
    "title": "DuckDuckGo beefs up scam defense to block fake stores, crypto sites",
    "link": "https://www.bleepingcomputer.com/news/security/duckduckgo-beefs-up-scam-defense-to-block-fake-stores-crypto-sites/",
    "summary": "The DuckDuckGo web browser has expanded its built-in Scam Blocker tool to protect against a broader range of online scams, including fake e-commerce, cryptocurrency exchanges, and \"scareware\" sites. [...]",
    "published": "2025-06-19T12:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Telecom giant Viasat breached by China's Salt Typhoon hackers",
    "link": "https://www.bleepingcomputer.com/news/security/telecom-giant-viasat-breached-by-chinas-salt-typhoon-hackers/",
    "summary": "Satellite communications company Viasat is the latest victim of China's Salt Typhoon cyber-espionage group, which has previously hacked into the networks of multiple other telecom providers in the United States and worldwide. [...]",
    "published": "2025-06-19T11:54:51",
    "source": "BleepingComputer"
  },
  {
    "title": "BlueNoroff Deepfake Zoom Scam Hits Crypto Employee with macOS Backdoor Malware",
    "link": "https://thehackernews.com/2025/06/bluenoroff-deepfake-zoom-scam-hits.html",
    "summary": "The North Korea-aligned threat actor known as BlueNoroff has been observed targeting an employee in the Web3 sector with deceptive Zoom calls featuring deepfaked company executives to trick them into installing malware on their Apple macOS devices.\nHuntress, which revealed details of the cyber intru",
    "published": "2025-06-19T11:38:00",
    "source": "HackerNews"
  },
  {
    "title": "Secure Vibe Coding: The Complete New Guide",
    "link": "https://thehackernews.com/2025/06/secure-vibe-coding-complete-new-guide.html",
    "summary": "DALL-E for coders? That’s the promise behind vibe coding, a term describing the use of natural language to create software. While this ushers in a new era of AI-generated code, it introduces \"silent killer\" vulnerabilities: exploitable flaws that evade traditional security tools despite perfect test",
    "published": "2025-06-19T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Uncover LOTS Attacks Hiding in Trusted Tools — Learn How in This Free Expert Session",
    "link": "https://thehackernews.com/2025/06/uncover-lots-attacks-hiding-in-trusted.html",
    "summary": "Most cyberattacks today don’t start with loud alarms or broken firewalls. They start quietly—inside tools and websites your business already trusts.\nIt’s called “Living Off Trusted Sites” (LOTS)—and it’s the new favorite strategy of modern attackers. Instead of breaking in, they blend in.\nHackers ar",
    "published": "2025-06-19T10:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Krispy Kreme says November data breach impacts over 160,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/krispy-kreme-says-november-data-breach-impacts-over-160-000-people/",
    "summary": "U.S. doughnut chain Krispy Kreme confirmed that attackers stole the personal information of over 160,000 individuals in a November 2024 cyberattack. [...]",
    "published": "2025-06-19T09:59:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Russian APT29 Exploits Gmail App Passwords to Bypass 2FA in Targeted Phishing Campaign",
    "link": "https://thehackernews.com/2025/06/russian-apt29-exploits-gmail-app.html",
    "summary": "Threat actors with suspected ties to Russia have been observed taking advantage of a Google account feature called application specific passwords (or app passwords) as part of a novel social engineering tactic designed to gain access to victims' emails.\nDetails of the highly targeted campaign were d",
    "published": "2025-06-19T08:06:00",
    "source": "HackerNews"
  }
]