[
  {
    "title": "Paddle settles for $5 million over facilitating tech support scams",
    "link": "https://www.bleepingcomputer.com/news/security/paddle-settles-for-5-million-over-facilitating-tech-support-scams/",
    "summary": "Paddle.com and its U.S. subsidiary will pay $5 million to settle Federal Trade Commission (FTC) allegations that the company facilitated deceptive tech-support schemes that harmed many U.S. consumers, including older adults. [...]",
    "published": "2025-06-17T21:14:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome Zero-Day CVE-2025-2783 Exploited by TaxOff to Deploy Trinper Backdoor",
    "link": "https://thehackernews.com/2025/06/google-chrome-zero-day-cve-2025-2783.html",
    "summary": "A now-patched security flaw in Google Chrome was exploited as a zero-day by a threat actor known as TaxOff to deploy a backdoor codenamed Trinper.\nThe attack, observed in mid-March 2025 by Positive Technologies, involved the use of a sandbox escape vulnerability tracked as CVE-2025-2783 (CVSS score:",
    "published": "2025-06-17T19:16:00",
    "source": "HackerNews"
  },
  {
    "title": "Scania confirms insurance claim data breach in extortion attempt",
    "link": "https://www.bleepingcomputer.com/news/security/scania-confirms-insurance-claim-data-breach-in-extortion-attempt/",
    "summary": "Automotive giant Scania confirmed it suffered a cybersecurity incident where threat actors used compromised credentials to breach its systems and steal insurance claim documents. [...]",
    "published": "2025-06-17T19:04:39",
    "source": "BleepingComputer"
  },
  {
    "title": "LangSmith Bug Could Expose OpenAI Keys and User Data via Malicious Agents",
    "link": "https://thehackernews.com/2025/06/langchain-langsmith-bug-let-hackers.html",
    "summary": "Cybersecurity researchers have disclosed a now-patched security flaw in LangChain's LangSmith platform that could be exploited to capture sensitive data, including API keys and user prompts.\nThe vulnerability, which carries a CVSS score of 8.8 out of a maximum of 10.0, has been codenamed AgentSmith ",
    "published": "2025-06-17T17:33:00",
    "source": "HackerNews"
  },
  {
    "title": "Instagram 'BMO' ads use AI deepfakes to scam banking customers",
    "link": "https://www.bleepingcomputer.com/news/security/instagram-bmo-ads-use-ai-deepfakes-to-scam-banking-customers/",
    "summary": "Instagram ads impersonating financial institutions like Bank of Montreal (BMO) and EQ Bank (Equitable Bank) are being used to target Canadian consumers with phishing scams and investment fraud.\n\nSome ads use AI-powered deepfake videos in an attempt to collect your personal information, while others ",
    "published": "2025-06-17T16:52:09",
    "source": "BleepingComputer"
  }
]