[
  {
    "title": "Google Chrome to block admin-level browser launches for better security",
    "link": "https://www.bleepingcomputer.com/news/google/google-chrome-to-block-admin-level-browser-launches-for-better-security/",
    "summary": "Google is rolling out a change to Chromium that \"de-elevates\" Google Chrome so it does not run as an administrator to increase security in Windows. [...]",
    "published": "2025-05-14T20:25:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers behind UK retail attacks now targeting US companies",
    "link": "https://www.bleepingcomputer.com/news/security/google-scattered-spider-switches-targets-to-us-retail-chains/",
    "summary": "Google warned today that hackers using Scattered Spider tactics against retail chains in the United Kingdom have also started targeting retailers in the United States. [...]",
    "published": "2025-05-14T19:38:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Samsung Patches CVE-2025-4632 Used to Deploy Mirai Botnet via MagicINFO 9 Exploit",
    "link": "https://thehackernews.com/2025/05/samsung-patches-cve-2025-4632-used-to.html",
    "summary": "Samsung has released software updates to address a critical security flaw in MagicINFO 9 Server that has been actively exploited in the wild.\nThe vulnerability, tracked as CVE-2025-4632 (CVSS score: 9.8), has been described as a path traversal flaw.\n\"Improper limitation of a pathname to a restricted",
    "published": "2025-05-14T17:57:00",
    "source": "HackerNews"
  },
  {
    "title": "BianLian and RansomExx Exploit SAP NetWeaver Flaw to Deploy PipeMagic Trojan",
    "link": "https://thehackernews.com/2025/05/bianlian-and-ransomexx-exploit-sap.html",
    "summary": "At least two different cybercrime groups BianLian and RansomExx are said to have exploited a recently disclosed security flaw in SAP NetWeaver, indicating that multiple threat actors are taking advantage of the bug.\nCybersecurity firm ReliaQuest, in a new update published today, said it uncovered ev",
    "published": "2025-05-14T17:50:00",
    "source": "HackerNews"
  },
  {
    "title": "Ransomware gangs join ongoing SAP NetWeaver attacks",
    "link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-join-ongoing-sap-netweaver-attacks/",
    "summary": "Ransomware gangs have joined ongoing SAP NetWeaver attacks, exploiting a maximum-severity vulnerability that allows threat actors to gain remote code execution on vulnerable servers. [...]",
    "published": "2025-05-14T17:39:41",
    "source": "BleepingComputer"
  },
  {
    "title": "Australian Human Rights Commission leaks docs to search engines",
    "link": "https://www.bleepingcomputer.com/news/security/australian-human-rights-commission-leaks-docs-to-search-engines/",
    "summary": "The Australian Human Rights Commission (AHRC) disclosed a data breach incident where private documents leaked online and were indexed by major search engines. [...]",
    "published": "2025-05-14T16:28:31",
    "source": "BleepingComputer"
  },
  {
    "title": "Xinbi Telegram Market Tied to $8.4B in Crypto Crime, Romance Scams, North Korea Laundering",
    "link": "https://thehackernews.com/2025/05/xinbi-telegram-market-tied-to-84b-in.html",
    "summary": "A Chinese-language, Telegram-based marketplace called Xinbi Guarantee has facilitated no less than $8.4 billion in transactions since 2022, making it the second major black market to be exposed after HuiOne Guarantee.\nAccording to a report published by blockchain analytics firm Elliptic, merchants o",
    "published": "2025-05-14T15:27:00",
    "source": "HackerNews"
  }
]