[
  {
    "title": "PowerSchool hacker pleads guilty to student data extortion scheme",
    "link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-pleads-guilty-to-student-data-extortion-scheme/",
    "summary": "A 19-year-old college student from Worcester, Massachusetts, has agreed to plead guilty to a massive cyberattack on PowerSchool that extorted millions of dollars in exchange for not leaking the personal data of millions of students and teachers. [...]",
    "published": "2025-05-20T23:27:17",
    "source": "BleepingComputer"
  },
  {
    "title": "KrebsOnSecurity Hit With Near-Record 6.3 Tbps DDoS",
    "link": "https://krebsonsecurity.com/2025/05/krebsonsecurity-hit-with-near-record-6-3-tbps-ddos/",
    "summary": "KrebsOnSecurity last week was hit by a near record distributed denial-of-service (DDoS) attack that clocked in at more than 6.3 terabits of data per second (a terabit is one trillion bits of data). The brief attack appears to have been a test run for a massive new Internet of Things (IoT) botnet cap",
    "published": "2025-05-20T21:30:30",
    "source": "Krebs"
  },
  {
    "title": "Mobile carrier Cellcom confirms cyberattack behind extended outages",
    "link": "https://www.bleepingcomputer.com/news/security/mobile-carrier-cellcom-confirms-cyberattack-behind-extended-outages/",
    "summary": "Wisconsin wireless provider Cellcom has confirmed that a cyberattack is responsible for the widespread service outage and disruptions that began on the evening of May 14, 2025. [...]",
    "published": "2025-05-20T20:19:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Premium WordPress 'Motors' theme vulnerable to admin takeover attacks",
    "link": "https://www.bleepingcomputer.com/news/security/premium-wordpress-motors-theme-vulnerable-to-admin-takeover-attacks/",
    "summary": "A critical privilege escalation vulnerability has been discovered in the premium WordPress theme Motors, which allows unauthenticated attackers to hijack administrator accounts and take complete control of websites. [...]",
    "published": "2025-05-20T19:46:18",
    "source": "BleepingComputer"
  },
  {
    "title": "VanHelsing ransomware builder leaked on hacking forum",
    "link": "https://www.bleepingcomputer.com/news/security/vanhelsing-ransomware-builder-leaked-on-hacking-forum/",
    "summary": "The VanHelsing ransomware-as-a-service operation published the source code for its affiliate panel, data leak blog, and Windows encryptor builder after an old developer tried to sell it on the RAMP cybercrime forum. [...]",
    "published": "2025-05-20T19:06:25",
    "source": "BleepingComputer"
  },
  {
    "title": "SK Telecom says malware breach lasted 3 years, impacted 27 million numbers",
    "link": "https://www.bleepingcomputer.com/news/security/sk-telecom-says-malware-breach-lasted-3-years-impacted-27-million-numbers/",
    "summary": "SK Telecom says that a recently disclosed cybersecurity incident in April, first occurred all the way back in 2022, ultimately exposing the USIM data of 27 million subscribers. [...]",
    "published": "2025-05-20T17:07:40",
    "source": "BleepingComputer"
  },
  {
    "title": "Hazy Hawk gang exploits DNS misconfigs to hijack trusted domains",
    "link": "https://www.bleepingcomputer.com/news/security/hazy-hawk-gang-exploits-dns-misconfigs-to-hijack-trusted-domains/",
    "summary": "A threat actor named 'Hazy Hawk' has been using DNS CNAME hijacking to hijack abandoned cloud endpoints of domains belonging to trusted organizations and incorporate them in large-scale scam delivery and traffic distribution systems (TDS). [...]",
    "published": "2025-05-20T15:57:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Hazy Hawk Exploits DNS Records to Hijack CDC, Corporate Domains for Malware Delivery",
    "link": "https://thehackernews.com/2025/05/hazy-hawk-exploits-dns-records-to.html",
    "summary": "A threat actor known as Hazy Hawk has been observed hijacking abandoned cloud resources of high-profile organizations, including Amazon S3 buckets and Microsoft Azure endpoints, by leveraging misconfigurations in the Domain Name System (DNS) records.\nThe hijacked domains are then used to host URLs t",
    "published": "2025-05-20T15:53:00",
    "source": "HackerNews"
  },
  {
    "title": "100+ Fake Chrome Extensions Found Hijacking Sessions, Stealing Credentials, Injecting Ads",
    "link": "https://thehackernews.com/2025/05/100-fake-chrome-extensions-found.html",
    "summary": "An unknown threat actor has been attributed to creating several malicious Chrome Browser extensions since February 2024 that masquerade as seemingly benign utilities but incorporate covert functionality to exfiltrate data, receive commands, and execute arbitrary code.\n\"The actor creates websites tha",
    "published": "2025-05-20T15:01:00",
    "source": "HackerNews"
  },
  {
    "title": "RVTools hit in supply chain attack to deliver Bumblebee malware",
    "link": "https://www.bleepingcomputer.com/news/security/rvtools-hit-in-supply-chain-attack-to-deliver-bumblebee-malware/",
    "summary": "The official website for the RVTools VMware management tool was taken offline in what appears to be a supply chain attack that distributed a trojanized installer to drop the Bumblebee malware loader on users' machines. [...]",
    "published": "2025-05-20T14:39:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Service desks are under attack: What can you do about it?",
    "link": "https://www.bleepingcomputer.com/news/security/service-desks-are-under-attack-what-can-you-do-about-it/",
    "summary": "Service desks are on the front lines of defense—and attackers know it. Attackers are using social engineering attacks to trick agents into changing passwords, disabling MFA, and granting access. Learn more from Specops Software on how to secure your service desk. [...]",
    "published": "2025-05-20T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "AWS Default IAM Roles Found to Enable Lateral Movement and Cross-Service Exploitation",
    "link": "https://thehackernews.com/2025/05/aws-default-iam-roles-found-to-enable.html",
    "summary": "Cybersecurity researchers have discovered risky default identity and access management (IAM) roles impacting Amazon Web Services that could open the door for attackers to escalate privileges, manipulate other AWS services, and, in some cases, even fully compromise AWS accounts.\n\"These roles, often c",
    "published": "2025-05-20T12:42:00",
    "source": "HackerNews"
  }
]