[
  {
    "title": "Google Chrome to block admin-level browser launches for better security",
    "link": "https://www.bleepingcomputer.com/news/google/google-chrome-to-block-admin-level-browser-launches-for-better-security/",
    "summary": "Google is rolling out a change to Chromium that \"de-elevates\" Google Chrome so it does not run as an administrator to increase security in Windows. [...]",
    "published": "2025-05-14T20:25:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers behind UK retail attacks now targeting US companies",
    "link": "https://www.bleepingcomputer.com/news/security/google-scattered-spider-switches-targets-to-us-retail-chains/",
    "summary": "Google warned today that hackers using Scattered Spider tactics against retail chains in the United Kingdom have also started targeting retailers in the United States. [...]",
    "published": "2025-05-14T19:38:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Samsung Patches CVE-2025-4632 Used to Deploy Mirai Botnet via MagicINFO 9 Exploit",
    "link": "https://thehackernews.com/2025/05/samsung-patches-cve-2025-4632-used-to.html",
    "summary": "Samsung has released software updates to address a critical security flaw in MagicINFO 9 Server that has been actively exploited in the wild.\nThe vulnerability, tracked as CVE-2025-4632 (CVSS score: 9.8), has been described as a path traversal flaw.\n\"Improper limitation of a pathname to a restricted",
    "published": "2025-05-14T17:57:00",
    "source": "HackerNews"
  },
  {
    "title": "BianLian and RansomExx Exploit SAP NetWeaver Flaw to Deploy PipeMagic Trojan",
    "link": "https://thehackernews.com/2025/05/bianlian-and-ransomexx-exploit-sap.html",
    "summary": "At least two different cybercrime groups BianLian and RansomExx are said to have exploited a recently disclosed security flaw in SAP NetWeaver tracked as CVE-2025-31324, indicating that multiple threat actors are taking advantage of the bug.\nCybersecurity firm ReliaQuest, in a new update published t",
    "published": "2025-05-14T17:50:00",
    "source": "HackerNews"
  }
]