[
  {
    "title": "ConnectWise rotating code signing certificates over security concerns",
    "link": "https://www.bleepingcomputer.com/news/security/connectwise-rotating-code-signing-certificates-over-security-concerns/",
    "summary": "ConnectWise is warning customers that it is rotating the digital code signing certificates used to sign ScreenConnect, ConnectWise Automate, and ConnectWise RMM executables over security concerns. [...]",
    "published": "2025-06-10T21:17:53",
    "source": "BleepingComputer"
  },
  {
    "title": "New Secure Boot flaw lets attackers install bootkit malware, patch now",
    "link": "https://www.bleepingcomputer.com/news/security/new-secure-boot-flaw-lets-attackers-install-bootkit-malware-patch-now/",
    "summary": "Security researchers have disclosed a new Secure Boot bypass tracked as CVE-2025-3052 that can be used to turn off security on PCs and servers and install bootkit malware. [...]",
    "published": "2025-06-10T20:02:19",
    "source": "BleepingComputer"
  },
  {
    "title": "Adobe Releases Patch Fixing 254 Vulnerabilities, Closing High-Severity Security Gaps",
    "link": "https://thehackernews.com/2025/06/adobe-releases-patch-fixing-254.html",
    "summary": "Adobe on Tuesday pushed security updates to address a total of 254 security flaws impacting its software products, a majority of which affect Experience Manager (AEM).\nOf the 254 flaws, 225 reside in AEM, impacting AEM Cloud Service (CS) as well as all versions prior to and including 6.5.22. The iss",
    "published": "2025-06-10T18:29:00",
    "source": "HackerNews"
  },
  {
    "title": "Researchers Uncover 20+ Configuration Risks, Including Five CVEs, in Salesforce Industry Cloud",
    "link": "https://thehackernews.com/2025/06/researchers-uncover-20-configuration.html",
    "summary": "Cybersecurity researchers have uncovered over 20 configuration-related risks affecting Salesforce Industry Cloud (aka Salesforce Industries), exposing sensitive data to unauthorized internal and external parties.\nThe weaknesses affect various components like FlexCards, Data Mappers, Integration Proc",
    "published": "2025-06-10T18:04:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 10 KB5060533 cumulative update released with 7 changes, fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5060533-cumulative-update-released-with-7-changes-fixes/",
    "summary": "Microsoft has released the KB5060533 cumulative update for Windows 10 22H2 and Windows 10 21H2, with seven fixes or changes, including bringing seconds back to the time shown in the Calendar flyout. [...]",
    "published": "2025-06-10T18:03:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-june-2025-patch-tuesday-fixes-exploited-zero-day-66-flaws/",
    "summary": "Today is Microsoft's June 2025 Patch Tuesday, which includes security updates for 66 flaws, including one actively exploited vulnerability and another that was publicly disclosed. [...]",
    "published": "2025-06-10T17:37:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 KB5060842 and KB5060999 cumulative updates released",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5060842-and-kb5060999-cumulative-updates-released/",
    "summary": "Microsoft has released Windows 11 KB5060842 and KB5060999 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues, including 66 flaws. [...]",
    "published": "2025-06-10T17:32:44",
    "source": "BleepingComputer"
  },
  {
    "title": "FIN6 Uses AWS-Hosted Fake Resumes on LinkedIn to Deliver More_eggs Malware",
    "link": "https://thehackernews.com/2025/06/fin6-uses-aws-hosted-fake-resumes-on.html",
    "summary": "The financially motivated threat actor known as FIN6 has been observed leveraging fake resumes hosted on Amazon Web Services (AWS) infrastructure to deliver a malware family called More_eggs.\n\"By posing as job seekers and initiating conversations through platforms like LinkedIn and Indeed, the group",
    "published": "2025-06-10T16:46:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Outlook to block more risky attachments used in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-outlook-to-block-more-risky-attachments-used-in-attacks/",
    "summary": "Microsoft announced it will expand the list of blocked attachments in Outlook Web and the new Outlook for Windows starting next month. [...]",
    "published": "2025-06-10T16:36:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Texas Dept. of Transportation breached, 300k crash records stolen",
    "link": "https://www.bleepingcomputer.com/news/security/texas-dept-of-transportation-breached-300k-crash-records-stolen/",
    "summary": "The Texas Department of Transportation (TxDOT) is warning that it suffered a data breach after a threat actor downloaded 300,000 crash records from its database. [...]",
    "published": "2025-06-10T16:25:16",
    "source": "BleepingComputer"
  },
  {
    "title": "FIN6 hackers pose as job seekers to backdoor recruiters’ devices",
    "link": "https://www.bleepingcomputer.com/news/security/fin6-hackers-pose-as-job-seekers-to-backdoor-recruiters-devices/",
    "summary": "In a twist on typical hiring-related social engineering attacks, the FIN6 hacking group impersonates job seekers to target recruiters, using convincing resumes and phishing sites to deliver malware. [...]",
    "published": "2025-06-10T15:57:13",
    "source": "BleepingComputer"
  },
  {
    "title": "Ivanti Workspace Control hardcoded key flaws expose SQL credentials",
    "link": "https://www.bleepingcomputer.com/news/security/ivanti-workspace-control-hardcoded-key-flaws-expose-sql-credentials/",
    "summary": "Ivanti has released security updates to fix three high-severity hardcoded key vulnerabilities in the company's Workspace Control (IWC) solution. [...]",
    "published": "2025-06-10T15:22:44",
    "source": "BleepingComputer"
  },
  {
    "title": "Massive Heroku outage impacts web platforms worldwide",
    "link": "https://www.bleepingcomputer.com/news/technology/massive-heroku-outage-impacts-web-platforms-worldwide/",
    "summary": "Heroku is suffering a widespread outage that has lasted over six hours, preventing developers from logging into the platform and breaking website functionality. [...]",
    "published": "2025-06-10T14:51:47",
    "source": "BleepingComputer"
  },
  {
    "title": "Rust-based Myth Stealer Malware Spread via Fake Gaming Sites Targets Chrome, Firefox Users",
    "link": "https://thehackernews.com/2025/06/rust-based-myth-stealer-malware-spread.html",
    "summary": "Cybersecurity researchers have shed light on a previously undocumented Rust-based information stealer called Myth Stealer that's being propagated via fraudulent gaming websites.\n\"Upon execution, the malware displays a fake window to appear legitimate while simultaneously decrypting and executing mal",
    "published": "2025-06-10T14:20:00",
    "source": "HackerNews"
  },
  {
    "title": "AI is a data-breach time bomb, reveals new report",
    "link": "https://www.bleepingcomputer.com/news/security/ai-is-a-data-breach-time-bomb-reveals-new-report/",
    "summary": "AI acts like Pac-Man—devouring sensitive data across clouds, apps, and copilots. Varonis analyzed 1,000 orgs and found 99% have exposed data AI can access, exposing them to data risks. [...]",
    "published": "2025-06-10T14:02:20",
    "source": "BleepingComputer"
  },
  {
    "title": "OpenAI working to fix ChatGPT outage affecting users worldwide",
    "link": "https://www.bleepingcomputer.com/news/technology/openai-working-to-fix-chatgpt-outage-affecting-users-worldwide/",
    "summary": "OpenAI is working to fix an ongoing outage impacting ChatGPT users worldwide and preventing them from accessing the chatbot on the web or via mobile and desktop apps. [...]",
    "published": "2025-06-10T13:22:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Five plead guilty to laundering $36 million stolen in investment scams",
    "link": "https://www.bleepingcomputer.com/news/security/five-plead-guilty-to-laundering-36-million-stolen-in-investment-scams/",
    "summary": "Five men from China, the United States, and Turkey pleaded guilty to their involvement in an international crime ring and laundering nearly $37 million stolen from U.S. victims in cryptocurrency investment scams carried out from Cambodia. [...]",
    "published": "2025-06-10T11:59:30",
    "source": "BleepingComputer"
  },
  {
    "title": "The Hidden Threat in Your Stack: Why Non-Human Identity Management is the Next Cybersecurity Frontier",
    "link": "https://thehackernews.com/2025/06/the-hidden-threat-in-your-stack-why-non.html",
    "summary": "Modern enterprise networks are highly complex environments that rely on hundreds of apps and infrastructure services. These systems need to interact securely and efficiently without constant human oversight, which is where non-human identities (NHIs) come in. NHIs — including application secrets, AP",
    "published": "2025-06-10T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Researcher Found Flaw to Discover Phone Numbers Linked to Any Google Account",
    "link": "https://thehackernews.com/2025/06/researcher-found-flaw-to-discover-phone.html",
    "summary": "Google has stepped in to address a security flaw that could have made it possible to brute-force an account's recovery phone number, potentially exposing them to privacy and security risks.\nThe issue, according to Singaporean security researcher \"brutecat,\" leverages an issue in the company's accoun",
    "published": "2025-06-10T10:11:00",
    "source": "HackerNews"
  }
]