[
  {
    "title": "Hackers abuse IPv6 networking feature to hijack software updates",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-abuse-ipv6-networking-feature-to-hijack-software-updates/",
    "summary": "A China-aligned APT threat actor named \"TheWizards\" abuses an IPv6 networking feature to launch adversary-in-the-middle (AitM) attacks that hijack software updates to install Windows malware. [...]",
    "published": "2025-05-01T00:33:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Alleged ‘Scattered Spider’ Member Extradited to U.S.",
    "link": "https://krebsonsecurity.com/2025/04/alleged-scattered-spider-member-extradited-to-u-s/",
    "summary": "A 23-year-old Scottish man thought to be a member of the prolific Scattered Spider cybercrime group was extradited last week from Spain to the United States, where he is facing charges of wire fraud, conspiracy and identity theft. U.S. prosecutors allege Tyler Robert Buchanan and co-conspirators hac",
    "published": "2025-04-30T21:54:59",
    "source": "Krebs"
  },
  {
    "title": "WordPress plugin disguised as a security tool injects backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/wordpress-plugin-disguised-as-a-security-tool-injects-backdoor/",
    "summary": "A new malware campaign targeting WordPress sites employs a malicious plugin disguised as a security tool to trick users into installing and trusting it. [...]",
    "published": "2025-04-30T21:05:46",
    "source": "BleepingComputer"
  },
  {
    "title": "WhatsApp unveils 'Private Processing' for cloud-based AI features",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-unveils-private-processing-for-cloud-based-ai-features/",
    "summary": "WhatsApp has announced the introduction of 'Private Processing,' a new technology that enables users to utilize advanced AI features by offloading tasks to privacy-preserving cloud servers. [...]",
    "published": "2025-04-30T19:01:26",
    "source": "BleepingComputer"
  },
  {
    "title": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma100-vpn-vulnerabilities-now-exploited-in-attacks/",
    "summary": "Cybersecurity company SonicWall has warned customers that several vulnerabilities impacting its Secure Mobile Access (SMA) appliances are now being actively exploited in attacks. [...]",
    "published": "2025-04-30T17:23:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Commvault says recent breach didn't impact customer backup data",
    "link": "https://www.bleepingcomputer.com/news/security/commvault-says-recent-breach-didnt-impact-customer-backup-data/",
    "summary": "Commvault, a leading provider of data protection solutions, says a nation-state threat actor who breached its Azure environment didn't gain access to customer backup data. [...]",
    "published": "2025-04-30T16:20:53",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI shares massive list of 42,000 LabHost phishing domains",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-shares-massive-list-of-42-000-labhost-phishing-domains/",
    "summary": "The FBI has shared 42,000 phishing domains tied to the LabHost cybercrime platform, one of the largest global phishing-as-a-service (PhaaS) platforms that was dismantled in April 2024. [...]",
    "published": "2025-04-30T16:01:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Demonstrate How MCP Prompt Injection Can Be Used for Both Attack and Defense",
    "link": "https://thehackernews.com/2025/04/experts-uncover-critical-mcp-and-a2a.html",
    "summary": "As the field of artificial intelligence (AI) continues to evolve at a rapid pace, new research has found how techniques that render the Model Context Protocol (MCP) susceptible to prompt injection attacks could be used to develop security tooling or identify malicious tools, according to a new repor",
    "published": "2025-04-30T15:59:00",
    "source": "HackerNews"
  },
  {
    "title": "UK retailer Co-op shuts down some IT systems after hack attempt",
    "link": "https://www.bleepingcomputer.com/news/security/uk-retailer-co-op-shuts-down-some-it-systems-after-hack-attempt/",
    "summary": "British supermarket chain Co-op Food has confirmed to BleepingComputer via a statement that it has suffered limited operational disruption as it responds to a cyberattack. [...]",
    "published": "2025-04-30T14:12:54",
    "source": "BleepingComputer"
  }
]