[
  {
    "title": "Microsoft wants Windows to update all software on your PC",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-wants-windows-to-update-all-software-on-your-pc/",
    "summary": "Microsoft has introduced a new update orchestration platform built on the existing Windows Update infrastructure, which aims to unify the updating system for all apps, drivers, and system components on Windows systems. [...]",
    "published": "2025-05-28T12:15:03",
    "source": "BleepingComputer"
  },
  {
    "title": "Mimo Hackers Exploit CVE-2025-32432 in Craft CMS to Deploy Cryptominer and Proxyware",
    "link": "https://thehackernews.com/2025/05/mimo-hackers-exploit-cve-2025-32432-in.html",
    "summary": "A financially motivated threat actor has been observed exploiting a recently disclosed remote code execution flaw affecting the Craft Content Management System (CMS) to deploy multiple payloads, including a cryptocurrency miner, a loader dubbed Mimo Loader, and residential proxyware.\nThe vulnerabili",
    "published": "2025-05-28T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Apple blocked over $9 billion in App Store fraud in five years",
    "link": "https://www.bleepingcomputer.com/news/apple/apple-blocked-over-9-billion-in-apap-store-fraud-since-2020/",
    "summary": "Apple says it blocked over $9 billion in fraudulent App Store transactions over the last five years, with over $2 billion in potentially fraudulent sanctions prevented in 2024 alone. [...]",
    "published": "2025-05-28T10:18:34",
    "source": "BleepingComputer"
  },
  {
    "title": "How 'Browser-in-the-Middle' Attacks Steal Sessions in Seconds",
    "link": "https://thehackernews.com/2025/05/how-browser-in-middle-attacks-steal.html",
    "summary": "Would you expect an end user to log on to a cybercriminal’s computer, open their browser, and type in their usernames and passwords? Hopefully not! But that’s essentially what happens if they fall victim to a Browser-in-the-Middle (BitM) attack.\nLike Man-in-the-Middle (MitM) attacks, BiTM sees crimi",
    "published": "2025-05-28T09:32:00",
    "source": "HackerNews"
  },
  {
    "title": "251 Amazon-Hosted IPs Used in Exploit Scan Targeting ColdFusion, Struts, and Elasticsearch",
    "link": "https://thehackernews.com/2025/05/251-amazon-hosted-ips-used-in-exploit.html",
    "summary": "Cybersecurity researchers have disclosed details of a coordinated cloud-based scanning activity that targeted 75 distinct \"exposure points\" earlier this month.\nThe activity, observed by GreyNoise on May 8, 2025, involved as many as 251 malicious IP addresses that are all geolocated to Japan and host",
    "published": "2025-05-28T09:23:00",
    "source": "HackerNews"
  },
  {
    "title": "Apple Blocks $9 Billion in Fraud Over 5 Years Amid Rising App Store Threats",
    "link": "https://thehackernews.com/2025/05/apple-blocks-9-billion-in-fraud-over-5.html",
    "summary": "Apple on Tuesday revealed that it prevented over $9 billion in fraudulent transactions in the last five years, including more than $2 billion in 2024 alone.\nThe company said the App Store is confronted by a wide range of threats that seek to defraud users in various ways, ranging from \"deceptive app",
    "published": "2025-05-28T06:11:00",
    "source": "HackerNews"
  }
]