[
  {
    "title": "Exploits for pre-auth Fortinet FortiWeb RCE flaw released, patch now",
    "link": "https://www.bleepingcomputer.com/news/security/exploits-for-pre-auth-fortinet-fortiweb-rce-flaw-released-patch-now/",
    "summary": "Proof-of-concept exploits have been released for a critical SQLi vulnerability in Fortinet FortiWeb that can be used to achieve pre-authenticated remote code execution on vulnerable servers. [...]",
    "published": "2025-07-11T19:41:39",
    "source": "BleepingComputer"
  },
  {
    "title": "WordPress Gravity Forms developer hacked to push backdoored plugins",
    "link": "https://www.bleepingcomputer.com/news/security/wordpress-gravity-forms-developer-hacked-to-push-backdoored-plugins/",
    "summary": "The popular WordPress plugin Gravity Forms has been compromised in what seems a supply-chain attack where manual installers from the official website were infected with a backdoor. [...]",
    "published": "2025-07-11T19:30:07",
    "source": "BleepingComputer"
  },
  {
    "title": "NVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks",
    "link": "https://www.bleepingcomputer.com/news/security/nvidia-issues-guidance-to-defend-gddr6-gpus-against-rowhammer/",
    "summary": "NVIDIA is warning users to activate System Level Error-Correcting Code  mitigation to protect against Rowhammer attacks on graphical processors with GDDR6 memory. [...]",
    "published": "2025-07-11T15:39:05",
    "source": "BleepingComputer"
  },
  {
    "title": "The zero-day that could've compromised every Cursor and Windsurf user",
    "link": "https://www.bleepingcomputer.com/news/security/the-zero-day-that-couldve-compromised-every-cursor-and-windsurf-user/",
    "summary": "Learn how one overlooked flaw in OpenVSX discovered by Koi Secureity could've let attackers hijack millions of dev machines via an extension supply chain attack. The zero-day threat's been patched—but the wake-up call is clear: extensions are a new, massive supply chain risk. [...]",
    "published": "2025-07-11T15:03:14",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-tags-citrix-bleed-2-as-exploited-gives-agencies-a-day-to-patch/",
    "summary": "The U.S. Cybersecurity & Infrastructure Security Agency has confirmed active exploitation of the CitrixBleed 2 vulnerability (CVE-2025-5777) in Citrix NetScaler ADC and Gateway and is giving federal agencies one day to apply fixes. [...]",
    "published": "2025-07-11T14:45:57",
    "source": "BleepingComputer"
  },
  {
    "title": "Fortinet Releases Patch for Critical SQL Injection Flaw in FortiWeb (CVE-2025-25257)",
    "link": "https://thehackernews.com/2025/07/fortinet-releases-patch-for-critical.html",
    "summary": "Fortinet has released fixes for a critical security flaw impacting FortiWeb that could enable an unauthenticated attacker to run arbitrary database commands on susceptible instances.\nTracked as CVE-2025-25257, the vulnerability carries a CVSS score of 9.6 out of a maximum of 10.0.\n\"An improper neutr",
    "published": "2025-07-11T14:38:00",
    "source": "HackerNews"
  },
  {
    "title": "PerfektBlue Bluetooth Vulnerabilities Expose Millions of Vehicles to Remote Code Execution",
    "link": "https://thehackernews.com/2025/07/perfektblue-bluetooth-vulnerabilities.html",
    "summary": "Cybersecurity researchers have discovered a set of four security flaws in OpenSynergy's BlueSDK Bluetooth stack that, if successfully exploited, could allow remote code execution on millions of transport vehicles from different vendors.\nThe vulnerabilities, dubbed PerfektBlue, can be fashioned toget",
    "published": "2025-07-11T12:10:00",
    "source": "HackerNews"
  },
  {
    "title": "Securing Data in the AI Era",
    "link": "https://thehackernews.com/2025/07/securing-data-in-ai-era.html",
    "summary": "The 2025 Data Risk Report: Enterprises face potentially serious data loss risks from AI-fueled tools. Adopting a unified, AI-driven approach to data security can help.\nAs businesses increasingly rely on cloud-driven platforms and AI-powered tools to accelerate digital transformation, the stakes for ",
    "published": "2025-07-11T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Critical Wing FTP Server Vulnerability (CVE-2025-47812) Actively Being Exploited in the Wild",
    "link": "https://thehackernews.com/2025/07/critical-wing-ftp-server-vulnerability.html",
    "summary": "A recently disclosed maximum-severity security flaw impacting the Wing FTP Server has come under active exploitation in the wild, according to Huntress.\nThe vulnerability, tracked as CVE-2025-47812 (CVSS score: 10.0), is a case of improper handling of null ('\\0') bytes in the server's web interface,",
    "published": "2025-07-11T10:58:00",
    "source": "HackerNews"
  },
  {
    "title": "Iranian-Backed Pay2Key Ransomware Resurfaces with 80% Profit Share for Cybercriminals",
    "link": "https://thehackernews.com/2025/07/iranian-backed-pay2key-ransomware.html",
    "summary": "An Iranian-backed ransomware-as-a-service (RaaS) named Pay2Key has resurfaced in the wake of the Israel-Iran-U.S. conflict last month, offering bigger payouts to cybercriminals who launch attacks against Israel and the U.S.\nThe financially motivated scheme, now operating under the moniker Pay2Key.I2",
    "published": "2025-07-11T10:46:00",
    "source": "HackerNews"
  }
]