[
  {
    "title": "Windows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058379-update-fixes-sgrmbroker-errors-in-event-viewer/",
    "summary": "Microsoft has released the KB5058379 cumulative update for Windows 10 22H2 and Windows 10 21H2, with four fixes and changes, including one for an SGRMBroker bug. [...]",
    "published": "2025-05-13T17:18:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Fortinet fixes critical zero-day exploited in FortiVoice attacks",
    "link": "https://www.bleepingcomputer.com/news/security/fortinet-fixes-critical-zero-day-exploited-in-fortivoice-attacks/",
    "summary": "Fortinet released security updates to patch a critical remote code execution vulnerability exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems. [...]",
    "published": "2025-05-13T16:46:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Ivanti warns of critical Neurons for ITSM auth bypass flaw",
    "link": "https://www.bleepingcomputer.com/news/security/ivanti-warns-of-critical-neurons-for-itsm-auth-bypass-flaw/",
    "summary": "​Ivanti has released security updates for its Neurons for ITSM IT service management solution that mitigate a critical authentication bypass vulnerability. [...]",
    "published": "2025-05-13T15:54:41",
    "source": "BleepingComputer"
  },
  {
    "title": "China-Linked APTs Exploit SAP CVE-2025-31324 to Breach 581 Critical Systems Worldwide",
    "link": "https://thehackernews.com/2025/05/china-linked-apts-exploit-sap-cve-2025.html",
    "summary": "A recently disclosed critical security flaw impacting SAP NetWeaver is being exploited by multiple China-nexus nation-state actors to target critical infrastructure networks.\n\"Actors leveraged CVE-2025-31324, an unauthenticated file upload vulnerability that enables remote code execution (RCE),\" Ecl",
    "published": "2025-05-13T15:13:00",
    "source": "HackerNews"
  },
  {
    "title": "New Intel CPU flaws leak sensitive data from privileged memory",
    "link": "https://www.bleepingcomputer.com/news/security/new-intel-cpu-flaws-leak-sensitive-data-from-privileged-memory/",
    "summary": "A new \"Branch Privilege Injection\" flaw in all modern Intel CPUs allows attackers to leak sensitive data from memory regions allocated to privileged software like the operating system kernel. [...]",
    "published": "2025-05-13T15:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Malicious PyPI Package Posing as Solana Tool Stole Source Code in 761 Downloads",
    "link": "https://thehackernews.com/2025/05/malicious-pypi-package-posing-as-solana.html",
    "summary": "Cybersecurity researchers have discovered a malicious package on the Python Package Index (PyPI) repository that purports to be an application related to the Solana blockchain, but contains malicious functionality to steal source code and developer secrets.\nThe package, named solana-token, is no lon",
    "published": "2025-05-13T14:47:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft will update Office apps on Windows 10 until 2028",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-will-update-office-apps-on-windows-10-until-2028/",
    "summary": "Microsoft has backtracked on its plan to end support for Office apps on Windows 10 later this year and announced that it will continue providing security updates for three more years, until 2028. [...]",
    "published": "2025-05-13T14:44:47",
    "source": "BleepingComputer"
  },
  {
    "title": "Increase Red Team Operations 10X with Adversarial Exposure Validation",
    "link": "https://www.bleepingcomputer.com/news/security/increase-red-team-operations-10x-with-adversarial-exposure-validation/",
    "summary": "Red teams uncover what others miss — but they can't be everywhere, all the time. Adversarial Exposure Validation combines BAS + Automated Pentesting to extend red team impact, uncover real attack paths, and validate defenses continuously. Learn more from Picus Security on how AEV can help protect yo",
    "published": "2025-05-13T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "M&S says customer data stolen in cyberattack, forces password resets",
    "link": "https://www.bleepingcomputer.com/news/security/mands-says-customer-data-stolen-in-cyberattack-forces-password-resets/",
    "summary": "Marks and Spencer (M&amp;S) confirms that customer data was stolen in a cyberattack last month, when ransomware was used to encrypt servers. [...]",
    "published": "2025-05-13T13:35:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Deepfake Defense in the Age of AI",
    "link": "https://thehackernews.com/2025/05/deepfake-defense-in-age-of-ai.html",
    "summary": "The cybersecurity landscape has been dramatically reshaped by the advent of generative AI. Attackers now leverage large language models (LLMs) to impersonate trusted individuals and automate these social engineering tactics at scale.&nbsp;\nLet’s review the status of these rising attacks, what’s fuel",
    "published": "2025-05-13T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "North Korean Konni APT Targets Ukraine with Malware to track Russian Invasion Progress",
    "link": "https://thehackernews.com/2025/05/north-korean-konni-apt-targets-ukraine.html",
    "summary": "The North Korea-linked threat actor known as Konni APT has been attributed to a phishing campaign targeting government entities in Ukraine, indicating the threat actor's targeting beyond Russia.\nEnterprise security firm Proofpoint said the end goal of the campaign is to collect intelligence on the \"",
    "published": "2025-05-13T10:57:00",
    "source": "HackerNews"
  },
  {
    "title": "Moldovan Police Arrest Suspect in €4.5M Ransomware Attack on Dutch Research Agency",
    "link": "https://thehackernews.com/2025/05/moldovan-police-arrest-suspect-in-45m.html",
    "summary": "Moldovan law enforcement authorities have arrested a 45-year-old foreign man suspected of involvement in a series of ransomware attacks targeting Dutch companies in 2021.\n\"He is wanted internationally for committing several cybercrimes (ransomware attacks, blackmail, and money laundering) against co",
    "published": "2025-05-13T06:33:00",
    "source": "HackerNews"
  }
]