[
  {
    "title": "Kettering Health confirms Interlock ransomware behind cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/kettering-health-confirms-interlock-ransomware-behind-cyberattack/",
    "summary": "Healthcare giant Kettering Health, which manages 14 medical centers in Ohio, confirmed that the Interlock ransomware group breached its network and stole data in a May cyberattack. [...]",
    "published": "2025-06-06T15:26:10",
    "source": "BleepingComputer"
  },
  {
    "title": "New PathWiper data wiper malware hits critical infrastructure in Ukraine",
    "link": "https://www.bleepingcomputer.com/news/security/new-pathwiper-data-wiper-malware-hits-critical-infrastructure-in-ukraine/",
    "summary": "A new data wiper malware named 'PathWiper' is being used in targeted attacks against critical infrastructure in Ukraine, aimed at disrupting operations in the country. [...]",
    "published": "2025-06-06T14:40:31",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Fortinet flaws now exploited in Qilin ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/critical-fortinet-flaws-now-exploited-in-qilin-ransomware-attacks/",
    "summary": "The Qilin ransomware operation has recently joined attacks exploiting two Fortinet vulnerabilities that allow bypassing authentication on vulnerable devices and executing malicious code remotely. [...]",
    "published": "2025-06-06T13:53:40",
    "source": "BleepingComputer"
  },
  {
    "title": "Empower Users and Protect Against GenAI Data Loss",
    "link": "https://thehackernews.com/2025/06/empower-users-and-protect-against-genai.html",
    "summary": "When generative AI tools became widely available in late 2022, it wasn’t just technologists who paid attention. Employees across all industries immediately recognized the potential of generative AI to boost productivity, streamline communication and accelerate work. Like so many waves of consumer-fi",
    "published": "2025-06-06T13:41:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Helps CBI Dismantle Indian Call Centers Behind Japanese Tech Support Scam",
    "link": "https://thehackernews.com/2025/06/microsoft-helps-cbi-dismantle-indian.html",
    "summary": "India's Central Bureau of Investigation (CBI) has revealed that it has arrested four individuals and dismantled two illegal call centers that were found to be engaging in a sophisticated transnational tech support scam targeting Japanese citizens.\nThe law enforcement agency said it conducted coordin",
    "published": "2025-06-06T13:12:00",
    "source": "HackerNews"
  },
  {
    "title": "Inside the Mind of the Adversary: Why More Security Leaders Are Selecting AEV",
    "link": "https://thehackernews.com/2025/06/inside-mind-of-adversary-why-more.html",
    "summary": "Cybersecurity involves both playing the good guy and the bad guy. Diving deep into advanced technologies and yet also going rogue in the Dark Web. Defining technical policies and also profiling attacker behavior. Security teams cannot be focused on just ticking boxes, they need to inhabit the attack",
    "published": "2025-06-06T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Police arrests 20 suspects for distributing child sexual abuse content",
    "link": "https://www.bleepingcomputer.com/news/security/police-arrests-20-suspects-for-distributing-child-sexual-abuse-content/",
    "summary": "Law enforcement authorities from over a dozen countries have arrested 20 suspects in an international operation targeting the production and distribution of child sexual abuse material. [...]",
    "published": "2025-06-06T08:55:21",
    "source": "BleepingComputer"
  },
  {
    "title": "New PathWiper Data Wiper Malware Disrupts Ukrainian Critical Infrastructure in 2025 Attack",
    "link": "https://thehackernews.com/2025/06/new-pathwiper-data-wiper-malware.html",
    "summary": "A critical infrastructure entity within Ukraine was targeted by a previously unseen data wiper malware named PathWiper, according to new findings from Cisco Talos.\n\"The attack was instrumented via a legitimate endpoint administration framework, indicating that the attackers likely had access to the ",
    "published": "2025-06-06T08:35:00",
    "source": "HackerNews"
  }
]