[
  {
    "title": "Are Forgotten AD Service Accounts Leaving You at Risk?",
    "link": "https://thehackernews.com/2025/06/are-forgotten-ad-service-accounts.html",
    "summary": "For many organizations, Active Directory (AD) service accounts are quiet afterthoughts, persisting in the background long after their original purpose has been forgotten. To make matters worse, these orphaned service accounts (created for legacy applications, scheduled tasks, automation scripts, or ",
    "published": "2025-06-17T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Hard-Coded 'b' Password in Sitecore XP Sparks Major RCE Risk in Enterprise Deployments",
    "link": "https://thehackernews.com/2025/06/hard-coded-b-password-in-sitecore-xp.html",
    "summary": "Cybersecurity researchers have disclosed three security flaws in the popular Sitecore Experience Platform (XP) that could be chained to achieve pre-authenticated remote code execution.\nSitecore Experience Platform is an enterprise-oriented software that provides users with tools for content manageme",
    "published": "2025-06-17T10:33:00",
    "source": "HackerNews"
  },
  {
    "title": "Backups Are Under Attack: How to Protect Your Backups",
    "link": "https://thehackernews.com/2025/06/how-to-protect-your-backups-from-ransomware-attacks.html",
    "summary": "Ransomware has become a highly coordinated and pervasive threat, and traditional defenses are increasingly struggling to neutralize it. Today’s ransomware attacks initially target your last line of defense — your backup infrastructure. Before locking up your production environment, cybercriminals go",
    "published": "2025-06-17T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "New Flodrix Botnet Variant Exploits Langflow AI Server RCE Bug to Launch DDoS Attacks",
    "link": "https://thehackernews.com/2025/06/new-flodrix-botnet-variant-exploits.html",
    "summary": "Cybersecurity researchers have called attention to a new campaign that's actively exploiting a recently disclosed critical security flaw in Langflow to deliver the Flodrix botnet malware.\n\"Attackers use the vulnerability to execute downloader scripts on compromised Langflow servers, which in turn fe",
    "published": "2025-06-17T09:32:00",
    "source": "HackerNews"
  },
  {
    "title": "TP-Link Router Flaw CVE-2023-33538 Under Active Exploit, CISA Issues Immediate Alert",
    "link": "https://thehackernews.com/2025/06/tp-link-router-flaw-cve-2023-33538.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added a high-severity security flaw in TP-Link wireless routers to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation.&nbsp;\nThe vulnerability in question is CVE-2023-33538 (CVSS score: ",
    "published": "2025-06-17T08:12:00",
    "source": "HackerNews"
  },
  {
    "title": "Meta Starts Showing Ads on WhatsApp After 6-Year Delay From 2018 Announcement",
    "link": "https://thehackernews.com/2025/06/meta-starts-showing-ads-on-whatsapp.html",
    "summary": "Meta Platforms on Monday announced that it's bringing advertising to WhatsApp, but emphasized that the ads are \"built with privacy in mind.\"\nThe ads are expected to be displayed on the Updates tab through its Stories-like Status feature, which allows ephemeral sharing of photos, videos, voice notes,",
    "published": "2025-06-17T04:53:00",
    "source": "HackerNews"
  }
]