[
  {
    "title": "Windows 11 KB5058499 update rolls out new Share and Click to Do features",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5058499-update-rolls-out-new-share-and-click-to-do-features/",
    "summary": "​​Microsoft has released the KB5058499 preview cumulative update for Windows 11 24H2 with forty-eight new features or changes, with many gradually rolling out, such as the new Windows Share feature and tje Click to Do Preview. [...]",
    "published": "2025-05-28T22:19:54",
    "source": "BleepingComputer"
  },
  {
    "title": "APT41 malware abuses Google Calendar for stealthy C2 communication",
    "link": "https://www.bleepingcomputer.com/news/security/apt41-malware-abuses-google-calendar-for-stealthy-c2-communication/",
    "summary": "The Chinese APT41 hacking group uses a new malware named 'ToughProgress' that abuses Google Calendar for command-and-control (C2) operations, hiding malicious activity behind a trusted cloud service. [...]",
    "published": "2025-05-28T22:04:04",
    "source": "BleepingComputer"
  },
  {
    "title": "New PumaBot botnet brute forces SSH credentials to breach devices",
    "link": "https://www.bleepingcomputer.com/news/security/new-pumabot-botnet-brute-forces-ssh-credentials-to-breach-devices/",
    "summary": "A newly discovered Go-based Linux botnet malware named PumaBot is brute-forcing SSH credentials on embedded IoT devices to deploy malicious payloads. [...]",
    "published": "2025-05-28T19:59:38",
    "source": "BleepingComputer"
  },
  {
    "title": "Interlock ransomware gang deploys new NodeSnake RAT on universities",
    "link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-gang-deploys-new-nodesnake-rat-on-universities/",
    "summary": "The Interlock ransomware gang is deploying a previously undocumented remote access trojan (RAT) named NodeSnake against educational institutes for persistent access to corporate networks. [...]",
    "published": "2025-05-28T18:14:01",
    "source": "BleepingComputer"
  },
  {
    "title": "Pakistan Arrests 21 in ‘Heartsender’ Malware Service",
    "link": "https://krebsonsecurity.com/2025/05/pakistan-arrests-21-in-heartsender-malware-service/",
    "summary": "Authorities in Pakistan have arrested 21 individuals accused of operating \"Heartsender,\" a once popular spam and malware dissemination service that operated for more than a decade. The main clientele for HeartSender were organized crime groups that tried to trick victim companies into making payment",
    "published": "2025-05-28T17:41:47",
    "source": "Krebs"
  },
  {
    "title": "Iranian Hacker Pleads Guilty in $19 Million Robbinhood Ransomware Attack on Baltimore",
    "link": "https://thehackernews.com/2025/05/iranian-hacker-pleads-guilty-in-19.html",
    "summary": "An Iranian national has pleaded guilty in the U.S. over his involvement in an international ransomware and extortion scheme involving the Robbinhood ransomware.\nSina Gholinejad (aka Sina Ghaaf), 37, and his co-conspirators are said to have breached the computer networks of various organizations in t",
    "published": "2025-05-28T17:20:00",
    "source": "HackerNews"
  },
  {
    "title": "Botnet hacks 9,000+ ASUS routers to add persistent SSH backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/botnet-hacks-9-000-plus-asus-routers-to-add-persistent-ssh-backdoor/",
    "summary": "Over 9,000 ASUS routers are compromised by a novel botnet dubbed \"AyySSHush\" that was also observed targeting SOHO routers from Cisco, D-Link, and Linksys. [...]",
    "published": "2025-05-28T16:44:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Dark Partners cybercrime gang fuels large-scale crypto heists",
    "link": "https://www.bleepingcomputer.com/news/security/dark-partners-cybercrime-gang-fuels-large-scale-crypto-heists/",
    "summary": "A sprawling network of fake AI, VPN, and crypto software download sites is being used by the \"Dark Partner\" threat actors to conduct a crypto theft attacks worldwide. [...]",
    "published": "2025-05-28T16:39:13",
    "source": "BleepingComputer"
  },
  {
    "title": "Czech Republic Blames China-Linked APT31 Hackers for 2022 Cyberattack",
    "link": "https://thehackernews.com/2025/05/czech-republic-blames-china-linked.html",
    "summary": "The Czech Republic on Wednesday formally accused a threat actor associated with the People's Republic of China (PRC) of targeting its Ministry of Foreign Affairs.\nIn a public statement, the government said it identified China as the culprit behind a malicious campaign targeting one of the unclassifi",
    "published": "2025-05-28T16:01:00",
    "source": "HackerNews"
  },
  {
    "title": "Czechia blames China for Ministry of Foreign Affairs cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/czechia-blames-china-for-ministry-of-foreign-affairs-cyberattack/",
    "summary": "The Czech Republic says the Chinese-backed APT31 hacking group was behind cyberattacks targeting the country's Ministry of Foreign Affairs and critical infrastructure organizations. [...]",
    "published": "2025-05-28T14:39:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft OneDrive File Picker Flaw Grants Apps Full Cloud Access — Even When Uploading Just One File",
    "link": "https://thehackernews.com/2025/05/microsoft-onedrive-file-picker-flaw.html",
    "summary": "Cybersecurity researchers have discovered a security flaw in Microsoft's OneDrive File Picker that, if successfully exploited, could allow websites to access a user's entire cloud storage content, as opposed to just the files selected for upload via the tool.\n\"This stems from overly broad OAuth scop",
    "published": "2025-05-28T13:41:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft introduces new Windows backup tool for businesses",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-introduces-new-windows-backup-tool-for-businesses/",
    "summary": "Microsoft has introduced Windows Backup for Organizations, a new backup tool for enterprises that simplifies backups and makes the transition to Windows 11 easier. [...]",
    "published": "2025-05-28T13:09:15",
    "source": "BleepingComputer"
  },
  {
    "title": "New PumaBot Botnet Targets Linux IoT Devices to Steal SSH Credentials and Mine Crypto",
    "link": "https://thehackernews.com/2025/05/new-pumabot-botnet-targets-linux-iot.html",
    "summary": "Embedded Linux-based Internet of Things (IoT) devices have become the target of a new botnet dubbed PumaBot.\nWritten in Go, the botnet is designed to conduct brute-force attacks against SSH instances to expand in size and scale and deliver additional malware to the infected hosts.\n\"Rather than scann",
    "published": "2025-05-28T12:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft wants Windows to update all software on your PC",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-wants-windows-to-update-all-software-on-your-pc/",
    "summary": "Microsoft has introduced a new update orchestration platform built on the existing Windows Update infrastructure, which aims to unify the updating system for all apps, drivers, and system components on Windows systems. [...]",
    "published": "2025-05-28T12:15:03",
    "source": "BleepingComputer"
  },
  {
    "title": "From Infection to Access: A 24-Hour Timeline of a Modern Stealer Campaign",
    "link": "https://thehackernews.com/2025/05/from-infection-to-access-24-hour.html",
    "summary": "Stealer malware no longer just steals passwords. In 2025, it steals live sessions—and attackers are moving faster and more efficiently than ever.\nWhile many associate account takeovers with personal services, the real threat is unfolding in the enterprise. Flare’s latest research, The Account and Se",
    "published": "2025-05-28T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Mimo Hackers Exploit CVE-2025-32432 in Craft CMS to Deploy Cryptominer and Proxyware",
    "link": "https://thehackernews.com/2025/05/mimo-hackers-exploit-cve-2025-32432-in.html",
    "summary": "A financially motivated threat actor has been observed exploiting a recently disclosed remote code execution flaw affecting the Craft Content Management System (CMS) to deploy multiple payloads, including a cryptocurrency miner, a loader dubbed Mimo Loader, and residential proxyware.\nThe vulnerabili",
    "published": "2025-05-28T11:00:00",
    "source": "HackerNews"
  }
]