[
  {
    "title": "NSO Group fined $167M for spyware attacks on 1,400 WhatsApp users",
    "link": "https://www.bleepingcomputer.com/news/legal/nso-group-fined-167m-for-spyware-attacks-on-1-400-whatsapp-users/",
    "summary": "A U.S. federal jury has ordered Israeli spyware vendor NSO Group to pay WhatsApp $167,254,000 in punitive damages and $444,719 in compensatory damages for a 2019 campaign that targeted 1,400 users of the communication app. [...]",
    "published": "2025-05-07T14:09:33",
    "source": "BleepingComputer"
  },
  {
    "title": "Doubling down: How Universal 2nd Factor (U2F) boosts online security",
    "link": "https://www.bleepingcomputer.com/news/security/doubling-down-how-universal-2nd-factor-u2f-boosts-online-security/",
    "summary": "Passwords alone aren't cutting it—31% of breaches involve stolen credentials. Learn from Specops Software about how Universal 2nd Factor (U2F) and strong password policies can work together to keep your organization secure. [...]",
    "published": "2025-05-07T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Europol Shuts Down Six DDoS-for-Hire Services Used in Global Attacks",
    "link": "https://thehackernews.com/2025/05/europol-shuts-down-six-ddos-for-hire.html",
    "summary": "Europol has announced the takedown of distributed denial of service (DDoS)-for-hire services that were used to launch thousands of cyber-attacks across the world.\nIn connection with the operation, Polish authorities have arrested four individuals and the United States has seized nine domains that ar",
    "published": "2025-05-07T13:54:00",
    "source": "HackerNews"
  },
  {
    "title": "OttoKit WordPress Plugin with 100K+ Installs Hit by Exploits Targeting Multiple Flaws",
    "link": "https://thehackernews.com/2025/05/ottokit-wordpress-plugin-with-100k.html",
    "summary": "A second security flaw impacting the OttoKit (formerly SureTriggers) WordPress plugin has come under active exploitation in the wild.\nThe vulnerability, tracked as CVE-2025-27007 (CVSS score: 9.8), is a privilege escalation bug impacting all versions of the plugin prior to and including version 1.0.",
    "published": "2025-05-07T13:44:00",
    "source": "HackerNews"
  },
  {
    "title": "Medical device maker Masimo warns of cyberattack, manufacturing delays",
    "link": "https://www.bleepingcomputer.com/news/security/medical-device-maker-masimo-warns-of-cyberattack-manufacturing-delays/",
    "summary": "Medical device company Masimo Corporation warns that a cyberattack is impacting production operations and causing delays in fulfilling customers' orders. [...]",
    "published": "2025-05-07T13:39:33",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA warns of hackers targeting critical oil infrastructure",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-hackers-targeting-critical-oil-infrastructure/",
    "summary": "CISA warned critical infrastructure organizations of \"unsophisticated\" threat actors actively targeting the U.S. oil and natural gas sectors. [...]",
    "published": "2025-05-07T13:17:39",
    "source": "BleepingComputer"
  },
  {
    "title": "SysAid Patches 4 Critical Flaws Enabling Pre-Auth RCE in On-Premise Version",
    "link": "https://thehackernews.com/2025/05/sysaid-patches-4-critical-flaws.html",
    "summary": "Cybersecurity researchers have disclosed multiple security flaw in the on-premise version of SysAid IT support software that could be exploited to achieve pre-authenticated remote code execution with elevated privileges.\nThe vulnerabilities, tracked as CVE-2025-2775, CVE-2025-2776, and CVE-2025-2777",
    "published": "2025-05-07T11:31:00",
    "source": "HackerNews"
  },
  {
    "title": "Police takes down six DDoS-for-hire services, arrests admins",
    "link": "https://www.bleepingcomputer.com/news/security/police-takes-down-six-ddos-for-hire-services-arrests-admins/",
    "summary": "​Polish authorities have detained four suspects linked to six DDoS-for-hire platforms, believed to have facilitated thousands of attacks targeting schools, government services, businesses, and gaming platforms worldwide since 2022. [...]",
    "published": "2025-05-07T11:23:37",
    "source": "BleepingComputer"
  },
  {
    "title": "Reevaluating SSEs: A Technical Gap Analysis of Last-Mile Protection",
    "link": "https://thehackernews.com/2025/05/reevaluating-sses-technical-gap.html",
    "summary": "Security Service Edge (SSE) platforms have become the go-to architecture for securing hybrid work and SaaS access. They promise centralized enforcement, simplified connectivity, and consistent policy control across users and devices.\nBut there's a problem: they stop short of where the most sensitive",
    "published": "2025-05-07T10:56:00",
    "source": "HackerNews"
  },
  {
    "title": "Play Ransomware Exploited Windows CVE-2025-29824 as Zero-Day to Breach U.S. Organization",
    "link": "https://thehackernews.com/2025/05/play-ransomware-exploited-windows-cve.html",
    "summary": "Threat actors with links to the Play ransomware family exploited a recently patched security flaw in Microsoft Windows as a zero-day as part of an attack targeting an unnamed organization in the United States.\nThe attack, per the Symantec Threat Hunter Team, part of Broadcom, leveraged CVE-2025-2982",
    "published": "2025-05-07T10:44:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft: April updates cause Windows Server auth issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-april-updates-cause-windows-server-auth-issues/",
    "summary": "Microsoft says the April 2025 security updates are causing authentication issues on some Windows Server 2025 domain controllers. [...]",
    "published": "2025-05-07T09:55:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Uncover Malware in Fake Discord PyPI Package Downloaded 11,500+ Times",
    "link": "https://thehackernews.com/2025/05/researchers-uncover-malware-in-fake.html",
    "summary": "Cybersecurity researchers have discovered a malicious package on the Python Package Index (PyPI) repository that masquerades as a seemingly harmless Discord-related utility but incorporates a remote access trojan.\nThe package in question is discordpydebug, which was uploaded to PyPI on March 21, 202",
    "published": "2025-05-07T07:37:00",
    "source": "HackerNews"
  },
  {
    "title": "NSO Group Fined $168M for Targeting 1,400 WhatsApp Users With Pegasus Spyware",
    "link": "https://thehackernews.com/2025/05/nso-group-fined-168m-for-targeting-1400.html",
    "summary": "A federal jury on Tuesday decided that NSO Group must pay Meta-owned WhatsApp WhatsApp approximately $168 million in monetary damages, more than four months after a federal judge ruled that the Israeli company violated U.S. laws by exploiting WhatsApp servers to deploy Pegasus spyware, targeting ove",
    "published": "2025-05-07T06:22:00",
    "source": "HackerNews"
  }
]