[
  {
    "title": "Hackers switch to targeting U.S. insurance companies",
    "link": "https://www.bleepingcomputer.com/news/security/google-warns-scattered-spider-hackers-now-target-us-insurance-companies/",
    "summary": "Threat intelligence researchers are warning of hackers breaching multiple U.S. companies in the insurance industry using all the tactics observed with Scattered Spider activity. [...]",
    "published": "2025-06-16T20:43:00",
    "source": "BleepingComputer"
  },
  {
    "title": "ASUS Armoury Crate bug lets attackers get Windows admin privileges",
    "link": "https://www.bleepingcomputer.com/news/security/asus-armoury-crate-bug-lets-attackers-get-windows-admin-privileges/",
    "summary": "A high-severity vulnerability in ASUS Armoury Crate software could allow threat actors to escalate their privileges to SYSTEM level on Windows machines. [...]",
    "published": "2025-06-16T18:08:29",
    "source": "BleepingComputer"
  },
  {
    "title": "U.S. Seizes $7.74M in Crypto Tied to North Korea’s Global Fake IT Worker Network",
    "link": "https://thehackernews.com/2025/06/us-seizes-774m-in-crypto-tied-to-north.html",
    "summary": "The U.S. Department of Justice (DoJ) said it has filed a civil forfeiture complaint in federal court that targets over $7.74 million in cryptocurrency, non-fungible tokens (NFTs), and other digital assets allegedly linked to a global IT worker scheme orchestrated by North Korea.\n\"For years, North Ko",
    "published": "2025-06-16T17:49:00",
    "source": "HackerNews"
  },
  {
    "title": "Washington Post's email system hacked, journalists' accounts compromised",
    "link": "https://www.bleepingcomputer.com/news/security/washington-posts-email-system-hacked-journalists-accounts-compromised/",
    "summary": "Email accounts of several Washington Post journalists were compromised in a cyberattack believed to have been carried out by a foreign government. [...]",
    "published": "2025-06-16T15:08:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Anubis Ransomware Encrypts and Wipes Files, Making Recovery Impossible Even After Payment",
    "link": "https://thehackernews.com/2025/06/anubis-ransomware-encrypts-and-wipes.html",
    "summary": "An emerging ransomware strain has been discovered incorporating capabilities to encrypt files as well as permanently erase them, a development that has been described as a \"rare dual-threat.\"\n\"The ransomware features a 'wipe mode,' which permanently erases files, rendering recovery impossible even i",
    "published": "2025-06-16T14:21:00",
    "source": "HackerNews"
  },
  {
    "title": "Kali Linux 2025.2 released with 13 new tools, car hacking updates",
    "link": "https://www.bleepingcomputer.com/news/security/kali-linux-20252-released-with-13-new-tools-car-hacking-updates/",
    "summary": "Kali Linux 2025.2, the second release of the year, is now available for download with 13 new tools and an expanded car hacking toolkit. [...]",
    "published": "2025-06-16T14:18:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Zoomcar discloses security breach impacting 8.4 million users",
    "link": "https://www.bleepingcomputer.com/news/security/zoomcar-discloses-security-breach-impacting-84-million-users/",
    "summary": "Zoomcar Holdings (Zoomcar) has disclosed via an 8-K form filing with the U.S. Securities and Exchange Commission (SEC) a data breach incident impacting 8.4 million users. [...]",
    "published": "2025-06-16T14:13:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft shares temp fix for Outlook crashes when opening emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-workaround-for-classic-outlook-crashes/",
    "summary": "Microsoft has shared a workaround for a known issue that causes the classic Outlook email client to crash when opening or starting a new message. [...]",
    "published": "2025-06-16T12:23:55",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: iPhone Spyware, Microsoft 0-Day, TokenBreak Hack, AI Data Leaks and More",
    "link": "https://thehackernews.com/2025/06/weekly-recap-iphone-spyware-microsoft-0.html",
    "summary": "Some of the biggest security problems start quietly. No alerts. No warnings. Just small actions that seem normal but aren't. Attackers now know how to stay hidden by blending in, and that makes it hard to tell when something’s wrong.\nThis week’s stories aren’t just about what was attacked—but how ea",
    "published": "2025-06-16T11:29:00",
    "source": "HackerNews"
  },
  {
    "title": "Playbook: Transforming Your Cybersecurity Practice Into An MRR Machine",
    "link": "https://thehackernews.com/2025/06/playbook-transforming-your.html",
    "summary": "Introduction\nThe cybersecurity landscape is evolving rapidly, and so are the cyber needs of organizations worldwide. While businesses face mounting pressure from regulators, insurers, and rising threats, many still treat cybersecurity as an afterthought. As a result, providers may struggle to move b",
    "published": "2025-06-16T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Police seizes Archetyp Market drug marketplace, arrests admin",
    "link": "https://www.bleepingcomputer.com/news/security/police-seizes-archetyp-market-drug-marketplace-arrests-admin/",
    "summary": "Law enforcement authorities from six countries took down the Archetyp Market, an infamous darknet drug marketplace that has been operating since May 2020. [...]",
    "published": "2025-06-16T11:15:52",
    "source": "BleepingComputer"
  }
]