[
  {
    "title": "Ascension says recent data breach affects over 430,000 patients",
    "link": "https://www.bleepingcomputer.com/news/security/ascension-says-recent-data-breach-affects-over-430-000-patients/",
    "summary": "Ascension, one of the largest private healthcare systems in the United States, has revealed that the personal and healthcare information of over 430,000 patients was exposed in a data breach disclosed last month. [...]",
    "published": "2025-05-09T18:48:15",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome to use on-device AI to detect tech support scams",
    "link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-use-on-device-ai-to-detect-tech-support-scams/",
    "summary": "Google is implementing a new Chrome security feature that uses the built-in 'Gemini Nano' large-language model (LLM) to detect and block tech support scams while browsing the web. [...]",
    "published": "2025-05-09T17:49:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Police dismantles botnet selling hacked routers as residential proxies",
    "link": "https://www.bleepingcomputer.com/news/security/police-dismantles-botnet-selling-hacked-routers-as-residential-proxies/",
    "summary": "Law enforcement authorities have dismantled a botnet that infected thousands of routers over the last 20 years to build two networks of residential proxies known as Anyproxy and 5socks. [...]",
    "published": "2025-05-09T17:47:08",
    "source": "BleepingComputer"
  },
  {
    "title": "BREAKING: 7,000-Device Proxy Botnet Using IoT, EoL Systems Dismantled in U.S. - Dutch Operation",
    "link": "https://thehackernews.com/2025/05/breaking-7000-device-proxy-botnet-using.html",
    "summary": "A joint law enforcement operation undertaken by Dutch and U.S. authorities has dismantled a criminal proxy network that's powered by thousands of infected Internet of Things (IoT) and end-of-life (EoL) devices, enlisting them into a botnet for providing anonymity to malicious actors.\nIn conjunction ",
    "published": "2025-05-09T16:28:00",
    "source": "HackerNews"
  }
]