[
  {
    "title": "Not Every CVE Deserves a Fire Drill: Focus on What’s Exploitable",
    "link": "https://www.bleepingcomputer.com/news/security/not-every-cve-deserves-a-fire-drill-focus-on-whats-exploitable/",
    "summary": "Not every \"critical\" vulnerability is a critical risk. Picus Exposure Validation cuts through the noise by testing what's actually exploitable in your environment — so you can patch what matters. [...]",
    "published": "2025-05-27T14:25:31",
    "source": "BleepingComputer"
  },
  {
    "title": "MATLAB dev confirms ransomware attack behind service outage",
    "link": "https://www.bleepingcomputer.com/news/security/mathworks-blames-ransomware-attack-for-ongoing-outages/",
    "summary": "MathWorks, a leading developer of mathematical computing and simulation software, has revealed that a recent ransomware attack is behind an ongoing service outage. [...]",
    "published": "2025-05-27T13:37:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Russian Hackers Breach 20+ NGOs Using Evilginx Phishing via Fake Microsoft Entra Pages",
    "link": "https://thehackernews.com/2025/05/russian-hackers-breach-20-ngos-using.html",
    "summary": "Microsoft has shed light on a previously undocumented cluster of threat activity originating from a Russia-affiliated threat actor dubbed Void Blizzard (aka Laundry Bear) that it said is attributed to \"worldwide cloud abuse.\"\nActive since at least April 2024, the hacking group is linked to espionage",
    "published": "2025-05-27T11:51:00",
    "source": "HackerNews"
  },
  {
    "title": "Russian Laundry Bear cyberspies linked to Dutch Police hack",
    "link": "https://www.bleepingcomputer.com/news/security/russian-void-blizzard-cyberspies-linked-to-dutch-police-breach/",
    "summary": "A previously unknown Russian-backed cyberespionage group now tracked as Laundry Bear has been linked to a September 2024 Dutch police security breach. [...]",
    "published": "2025-05-27T11:16:03",
    "source": "BleepingComputer"
  },
  {
    "title": "AI Agents and the Non‑Human Identity Crisis: How to Deploy AI More Securely at Scale",
    "link": "https://thehackernews.com/2025/05/ai-agents-and-nonhuman-identity-crisis.html",
    "summary": "Artificial intelligence is driving a massive shift in enterprise productivity, from GitHub Copilot’s code completions to chatbots that mine internal knowledge bases for instant answers. Each new agent must authenticate to other services, quietly swelling the population of non‑human identities (NHIs)",
    "published": "2025-05-27T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Employees Searching Payroll Portals on Google Tricked Into Sending Paychecks to Hackers",
    "link": "https://thehackernews.com/2025/05/employees-searching-payroll-portals-on.html",
    "summary": "Threat hunters have exposed a novel campaign that makes use of search engine optimization (SEO) poisoning techniques to target employee mobile devices and facilitate payroll fraud.\nThe activity, first detected by ReliaQuest in May 2025 targeting an unnamed customer in the manufacturing sector, is ch",
    "published": "2025-05-27T09:52:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows Server emergency update fixes Hyper-V VM freezes, restart issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-server-emergency-update-fixes-hyper-v-vm-freezes-restart-issues/",
    "summary": "Microsoft has released an emergency update to address a known issue causing some Hyper-V virtual machines with Windows Server 2022 to freeze or restart unexpectedly. [...]",
    "published": "2025-05-27T09:25:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Adidas warns of data breach after customer service provider hack",
    "link": "https://www.bleepingcomputer.com/news/security/adidas-warns-of-data-breach-after-customer-service-provider-hack/",
    "summary": "German sportswear giant Adidas disclosed a data breach after attackers hacked a customer service provider and stole some customers' data. [...]",
    "published": "2025-05-27T08:29:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Are Calling Your Office: FBI Alerts Law Firms to Luna Moth’s Stealth Phishing Campaign",
    "link": "https://thehackernews.com/2025/05/hackers-are-calling-your-office-fbi.html",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) has warned of social engineering attacks mounted by a criminal extortion actor known as Luna Moth targeting law firms over the past two years.\nThe campaign leverages \"information technology (IT) themed social engineering calls, and callback phishing ema",
    "published": "2025-05-27T07:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Russia-Linked Hackers Target Tajikistan Government with Weaponized Word Documents",
    "link": "https://thehackernews.com/2025/05/russia-linked-hackers-target-tajikistan.html",
    "summary": "The Russia-aligned threat actor known as TAG-110 has been observed conducting a spear-phishing campaign targeting Tajikistan using macro-enabled Word templates as an initial payload.\nThe attack chain is a departure from the threat actor's previously documented use of an HTML Application (.HTA) loade",
    "published": "2025-05-27T06:54:00",
    "source": "HackerNews"
  }
]