[
  {
    "title": "SinoTrack GPS Devices Vulnerable to Remote Vehicle Control via Default Passwords",
    "link": "https://thehackernews.com/2025/06/sinotrack-gps-devices-vulnerable-to.html",
    "summary": "Two security vulnerabilities have been disclosed in SinoTrack GPS devices that could be exploited to control certain remote functions on connected vehicles and even track their locations.\n\"Successful exploitation of these vulnerabilities could allow an attacker to access device profiles without auth",
    "published": "2025-06-11T10:28:00",
    "source": "HackerNews"
  },
  {
    "title": "How to Build a Lean Security Model: 5 Lessons from River Island",
    "link": "https://thehackernews.com/2025/06/how-to-build-lean-security-model-5.html",
    "summary": "In today&rsquo;s security landscape, budgets are tight, attack surfaces are sprawling, and new threats emerge daily. Maintaining a strong security posture under these circumstances without a large team or budget can be a real challenge. Yet lean security models are not only possible - they can be hi",
    "published": "2025-06-11T10:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Patches 67 Vulnerabilities Including WEBDAV Zero-Day Exploited in the Wild",
    "link": "https://thehackernews.com/2025/06/microsoft-patches-67-vulnerabilities.html",
    "summary": "Microsoft has released patches to fix 67 security flaws, including one zero-day bug in Web Distributed Authoring and Versioning (WebDAV) that it said has come under active exploitation in the wild.\nOf the 67 vulnerabilities, 11 are rated Critical and 56 are rated Important in severity. This includes",
    "published": "2025-06-11T07:46:00",
    "source": "HackerNews"
  },
  {
    "title": "Patch Tuesday, June 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/06/patch-tuesday-june-2025-edition/",
    "summary": "Microsoft today released security updates to fix at least 67 vulnerabilities in its Windows operating systems and software. Redmond warns that one of the flaws is already under active attack, and that software blueprints showing how to exploit a pervasive Windows bug patched this month are now publi",
    "published": "2025-06-11T00:10:53",
    "source": "Krebs"
  }
]