[
  {
    "title": "Qantas discloses cyberattack amid Scattered Spider aviation breaches",
    "link": "https://www.bleepingcomputer.com/news/security/qantas-discloses-cyberattack-amid-scattered-spider-aviation-breaches/",
    "summary": "Australian airline Qantas disclosed that it detected a cyberattack on Monday after threat actors gained access to a third-party platform containing customer data. [...]",
    "published": "2025-07-02T00:54:45",
    "source": "BleepingComputer"
  },
  {
    "title": "AT&T rolls out \"Wireless Lock\" feature to block SIM swap attacks",
    "link": "https://www.bleepingcomputer.com/news/security/atandt-rolls-out-wireless-lock-feature-to-block-sim-swap-attacks/",
    "summary": "AT&amp;T has launched a new security feature called \"Wireless Lock\" that protects customers from SIM swapping attacks by preventing changes to their account information and the porting of phone numbers while the feature is enabled. [...]",
    "published": "2025-07-01T20:23:03",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft open-sources VS Code Copilot Chat extension on GitHub",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-open-sources-vs-code-copilot-chat-extension-on-github/",
    "summary": "Microsoft has released the source code for the GitHub Copilot Chat extension for VS Code under the MIT license. [...]",
    "published": "2025-07-01T19:11:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Vulnerability in Anthropic's MCP Exposes Developer Machines to Remote Exploits",
    "link": "https://thehackernews.com/2025/07/critical-vulnerability-in-anthropics.html",
    "summary": "Cybersecurity researchers have discovered a critical security vulnerability in artificial intelligence (AI) company Anthropic's Model Context Protocol (MCP) Inspector project that could result in remote code execution (RCE) and allow an attacker to gain complete access to the hosts.\nThe vulnerabilit",
    "published": "2025-07-01T18:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Kelly Benefits says 2024 data breach impacts 550,000 customers",
    "link": "https://www.bleepingcomputer.com/news/security/kelly-benefits-says-2024-data-breach-impacts-550-000-customers/",
    "summary": "Kelly & Associates Insurance Group (dba Kelly Benefits) is informing more than half a million people of a data breach that compromised their personal information. [...]",
    "published": "2025-07-01T17:28:39",
    "source": "BleepingComputer"
  }
]