[
  {
    "title": "Luna Moth extortion hackers pose as IT help desks to breach US firms",
    "link": "https://www.bleepingcomputer.com/news/security/luna-moth-extortion-hackers-pose-as-it-help-desks-to-breach-us-firms/",
    "summary": "The data-theft extortion group known as Luna Moth, aka Silent Ransom Group, has ramped up callback phishing campaigns in attacks on legal and financial institutions in the United States. [...]",
    "published": "2025-05-05T22:19:42",
    "source": "BleepingComputer"
  },
  {
    "title": "New \"Bring Your Own Installer\" EDR bypass used in ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/new-bring-your-own-installer-edr-bypass-used-in-ransomware-attack/",
    "summary": "A new \"Bring Your Own Installer\" EDR bypass technique is exploited in attacks to bypass SentinelOne's tamper protection feature, allowing threat actors to disable endpoint detection and response (EDR) agents to install the Babuk ransomware. [...]",
    "published": "2025-05-05T20:28:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft finds default Kubernetes Helm charts can expose data",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-finds-default-kubernetes-helm-charts-can-expose-data/",
    "summary": "Microsoft warns about the security risks posed by default configurations in Kubernetes deployments, particularly those using out-of-the-box Helm charts, which could publicly expose sensitive data. [...]",
    "published": "2025-05-05T19:17:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Unofficial Signal app used by Trump officials investigates hack",
    "link": "https://www.bleepingcomputer.com/news/security/unofficial-signal-app-used-by-trump-officials-investigates-hack/",
    "summary": "TeleMessage, an Israeli company that sells an unofficial Signal message archiving tool used by some U.S. government officials, has suspended all services after reportedly being hacked. [...]",
    "published": "2025-05-05T19:11:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Darcula PhaaS steals 884,000 credit cards via phishing texts",
    "link": "https://www.bleepingcomputer.com/news/security/darcula-phaas-steals-884-000-credit-cards-via-phishing-texts/",
    "summary": "The Darcula phishing-as-a-service (PhaaS) platform stole 884,000 credit cards from 13 million clicks on malicious links sent via text messages to targets worldwide. [...]",
    "published": "2025-05-05T17:31:32",
    "source": "BleepingComputer"
  },
  {
    "title": "Wormable AirPlay Flaws Enable Zero-Click RCE on Apple Devices via Public Wi-Fi",
    "link": "https://thehackernews.com/2025/05/wormable-airplay-flaws-enable-zero.html",
    "summary": "Cybersecurity researchers have disclosed a series of now-patched security vulnerabilities in Apple's AirPlay protocol that, if successfully exploited, could enable an attacker to take over susceptible devices supporting the proprietary wireless technology.\nThe shortcomings have been collectively cod",
    "published": "2025-05-05T17:06:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft is killing Skype today, pushes users to Teams",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-killing-skype-today-pushes-users-to-teams/",
    "summary": "The Skype video call and messaging service is shutting down today, 14 years after replacing Microsoft's Windows Live Messenger. [...]",
    "published": "2025-05-05T16:12:07",
    "source": "BleepingComputer"
  },
  {
    "title": "Commvault CVE-2025-34028 Added to CISA KEV After Active Exploitation Confirmed",
    "link": "https://thehackernews.com/2025/05/commvault-cve-2025-34028-added-to-cisa.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a maximum-severity security flaw impacting Commvault Command Center to its Known Exploited Vulnerabilities (KEV) catalog, a little over a week after it was publicly disclosed.\nThe vulnerability in question is CVE-2025-34028 (",
    "published": "2025-05-05T16:01:00",
    "source": "HackerNews"
  }
]