[
  {
    "title": "ConnectWise breached in cyberattack linked to nation-state hackers",
    "link": "https://www.bleepingcomputer.com/news/security/connectwise-breached-in-cyberattack-linked-to-nation-state-hackers/",
    "summary": "IT management software firm ConnectWise says a suspected state-sponsored cyberattack breached its environment and impacted a limited number of ScreenConnect customers. [...]",
    "published": "2025-05-29T19:12:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Threat actors abuse Google Apps Script in evasive phishing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/threat-actors-abuse-google-apps-script-in-evasive-phishing-attacks/",
    "summary": "Threat actors are abusing the trusted Google platform 'Google Apps Script' to host phishing pages, making them appear legitimate and eliminating the risk of them getting flagged by security tools. [...]",
    "published": "2025-05-29T16:25:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Apple Safari exposes users to fullscreen browser-in-the-middle attacks",
    "link": "https://www.bleepingcomputer.com/news/security/apple-safari-exposes-users-to-fullscreen-browser-in-the-middle-attacks/",
    "summary": "A weakness in Apple's Safari web browser allows threat actors to leverage the fullscreen browser-in-the-middle (BitM) technique to steal account credentials from unsuspecting users. [...]",
    "published": "2025-05-29T16:06:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Cybercriminals Target AI Users with Malware-Loaded Installers Posing as Popular Tools",
    "link": "https://thehackernews.com/2025/05/cybercriminals-target-ai-users-with.html",
    "summary": "Fake installers for popular artificial intelligence (AI) tools like OpenAI ChatGPT and InVideo AI are being used as lures to propagate various threats, such as the CyberLock and Lucky_Gh0$t ransomware families, and a new malware dubbed Numero.\n\"CyberLock ransomware, developed using PowerShell, prima",
    "published": "2025-05-29T15:47:00",
    "source": "HackerNews"
  },
  {
    "title": "US sanctions firm linked to cyber scams behind $200 million in losses",
    "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-company-linked-to-hundreds-of-thousands-of-cyber-scam-sites/",
    "summary": "The U.S. Treasury Department has sanctioned Funnull Technology, a Philippines-based company that supports hundreds of thousands of malicious websites behind cyber scams linked to over $200 million in losses for Americans. [...]",
    "published": "2025-05-29T15:42:38",
    "source": "BleepingComputer"
  },
  {
    "title": "Cybercriminals exploit AI hype to spread ransomware, malware",
    "link": "https://www.bleepingcomputer.com/news/security/cybercriminals-exploit-ai-hype-to-spread-ransomware-malware/",
    "summary": "Threat actors linked to lesser-known ransomware and malware projects now use AI tools as lures to infect unsuspecting victims with malicious payloads. [...]",
    "published": "2025-05-29T14:25:52",
    "source": "BleepingComputer"
  },
  {
    "title": "Attackers are mapping your attack surface—are you?",
    "link": "https://www.bleepingcomputer.com/news/security/attackers-are-mapping-your-attack-surface-are-you/",
    "summary": "Attackers are mapping your infrastructure before you even realize what's exposed. Sprocket ASM flips the script — giving you the same recon capabilities they use, plus change detection and actionable insights to close gaps fast. See your attack surface the way hackers do and beat them to it. [...]",
    "published": "2025-05-29T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "New Windows RAT Evades Detection for Weeks Using Corrupted DOS and PE Headers",
    "link": "https://thehackernews.com/2025/05/new-windows-rat-evades-detection-for.html",
    "summary": "Cybersecurity researchers have taken the wraps off an unusual cyber attack that leveraged malware with corrupted DOS and PE headers, according to new findings from Fortinet.\nThe DOS (Disk Operating System) and PE (Portable Executable) headers are essential parts of a Windows PE file, providing infor",
    "published": "2025-05-29T13:16:00",
    "source": "HackerNews"
  },
  {
    "title": "Victoria’s Secret takes down website after security incident",
    "link": "https://www.bleepingcomputer.com/news/security/victorias-secret-takes-down-website-after-security-incident/",
    "summary": "Victoria's Secret, the fashion giant, has taken down its website and some store services because of an ongoing security incident [...]",
    "published": "2025-05-29T11:30:41",
    "source": "BleepingComputer"
  },
  {
    "title": "DragonForce Exploits SimpleHelp Flaws to Deploy Ransomware Across Customer Endpoints",
    "link": "https://thehackernews.com/2025/05/dragonforce-exploits-simplehelp-flaws.html",
    "summary": "The threat actors behind the DragonForce ransomware gained access to an unnamed Managed Service Provider's (MSP) SimpleHelp remote monitoring and management (RMM) tool, and then leveraged it to exfiltrate data and drop the locker on multiple endpoints.\nIt's believed that the attackers exploited a tr",
    "published": "2025-05-29T10:34:00",
    "source": "HackerNews"
  }
]