[
  {
    "title": "Deepfake Defense in the Age of AI",
    "link": "https://thehackernews.com/2025/05/deepfake-defense-in-age-of-ai.html",
    "summary": "The cybersecurity landscape has been dramatically reshaped by the advent of generative AI. Attackers now leverage large language models (LLMs) to impersonate trusted individuals and automate these social engineering tactics at scale.&nbsp;\nLet’s review the status of these rising attacks, what’s fuel",
    "published": "2025-05-13T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "North Korean Konni APT Targets Ukraine with Malware to track Russian Invasion Progress",
    "link": "https://thehackernews.com/2025/05/north-korean-konni-apt-targets-ukraine.html",
    "summary": "The North Korea-linked threat actor known as Konni APT has been attributed to a phishing campaign targeting government entities in Ukraine, indicating the threat actor's targeting beyond Russia.\nEnterprise security firm Proofpoint said the end goal of the campaign is to collect intelligence on the \"",
    "published": "2025-05-13T10:57:00",
    "source": "HackerNews"
  },
  {
    "title": "Moldovan Police Arrest Suspect in €4.5M Ransomware Attack on Dutch Research Agency",
    "link": "https://thehackernews.com/2025/05/moldovan-police-arrest-suspect-in-45m.html",
    "summary": "Moldovan law enforcement authorities have arrested a 45-year-old foreign man suspected of involvement in a series of ransomware attacks targeting Dutch companies in 2021.\n\"He is wanted internationally for committing several cybercrimes (ransomware attacks, blackmail, and money laundering) against co",
    "published": "2025-05-13T06:33:00",
    "source": "HackerNews"
  },
  {
    "title": "Türkiye Hackers Exploited Output Messenger Zero-Day to Drop Golang Backdoors on Kurdish Servers",
    "link": "https://thehackernews.com/2025/05/turkiye-hackers-exploited-output.html",
    "summary": "A Türkiye-affiliated threat actor exploited a zero-day security flaw in an Indian enterprise communication platform called Output Messenger as part of a cyber espionage attack campaign since April 2024.\n\"These exploits have resulted in a collection of related user data from targets in Iraq,\" the Mic",
    "published": "2025-05-13T05:08:00",
    "source": "HackerNews"
  }
]