[
  {
    "title": "Bitcoin Depot breach exposes data of nearly 27,000 crypto users",
    "link": "https://www.bleepingcomputer.com/news/security/bitcoin-depot-breach-exposes-data-of-nearly-27-000-crypto-users/",
    "summary": "Bitcoin Depot, an operator of Bitcoin ATMs, is notifying customers of a data breach incident that has exposed their sensitive information. [...]",
    "published": "2025-07-09T17:33:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Ruckus Networks leaves severe flaws unpatched in management devices",
    "link": "https://www.bleepingcomputer.com/news/security/ruckus-networks-leaves-severe-flaws-unpatched-in-management-devices/",
    "summary": "Multiple vulnerabilities that remain unpatched in Ruckus Wireless management products could be exploited to fully compromise the network environment they serve. [...]",
    "published": "2025-07-09T15:42:07",
    "source": "BleepingComputer"
  },
  {
    "title": "Ingram Micro starts restoring systems after ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/ingram-micro-starts-restoring-systems-after-ransomware-attack/",
    "summary": "Ingram Micro has begun restoring systems and business services after suffering a massive SafePay ransomware attack right before the July 4th holiday. [...]",
    "published": "2025-07-09T15:13:50",
    "source": "BleepingComputer"
  },
  {
    "title": "Treasury sanctions North Korean over IT worker malware scheme",
    "link": "https://www.bleepingcomputer.com/news/legal/treasury-sanctions-north-korean-over-it-worker-malware-scheme/",
    "summary": "The U.S. Department of the Treasury sanctioned cyber actor Song Kum Hyok for his association with North Korea's hacking group Andariel and for facilitating IT worker schemes that generated revenue for the Pyongyang regime. [...]",
    "published": "2025-07-09T14:43:11",
    "source": "BleepingComputer"
  },
  {
    "title": "The MFA You Trust Is Lying to You – and Here's How Attackers Exploit It",
    "link": "https://www.bleepingcomputer.com/news/security/the-mfa-you-trust-is-lying-to-you-and-heres-how-attackers-exploit-it/",
    "summary": "MFA Authenticator apps aren't cutting it anymore. Attackers are bypassing legacy MFA with fake sites and real-time phishing. Token Ring and BioStick stop them cold—with fingerprint-bound hardware. Learn more from Token. [...]",
    "published": "2025-07-09T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "DoNot APT Expands Operations, Targets European Foreign Ministries with LoptikMod Malware",
    "link": "https://thehackernews.com/2025/07/donot-apt-expands-operations-targets.html",
    "summary": "A threat actor with suspected ties to India has been observed targeting a European foreign affairs ministry with malware capable of harvesting sensitive data from compromised hosts.\nThe activity has been attributed by Trellix Advanced Research Center to an advanced persistent threat (APT) group call",
    "published": "2025-07-09T13:28:00",
    "source": "HackerNews"
  },
  {
    "title": "New ServiceNow flaw lets attackers enumerate restricted data",
    "link": "https://www.bleepingcomputer.com/news/security/new-servicenow-flaw-lets-attackers-enumerate-restricted-data/",
    "summary": "A new vulnerability in ServiceNow, dubbed Count(er) Strike, allows low-privileged users to extract sensitive data from tables to which they should not have access. [...]",
    "published": "2025-07-09T13:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "U.S. Sanctions North Korean Andariel Hacker Behind Fraudulent IT Worker Scheme",
    "link": "https://thehackernews.com/2025/07/us-sanctions-north-korean-andariel.html",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday sanctioned a member of a North Korean hacking group called Andariel for their role in the infamous remote information technology (IT) worker scheme.\nThe Treasury said Song Kum Hyok, a 38-year-old North Korean na",
    "published": "2025-07-09T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "How To Automate Ticket Creation, Device Identification and Threat Triage With Tines",
    "link": "https://thehackernews.com/2025/07/how-to-automate-ticket-creation-device.html",
    "summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features over 1,000 pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform’s Community Edition.\nA recent standout is a workflow that handles",
    "published": "2025-07-09T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hacker Xu Zewei Arrested for Ties to Silk Typhoon Group and U.S. Cyber Attacks",
    "link": "https://thehackernews.com/2025/07/chinese-hacker-xu-zewei-arrested-for.html",
    "summary": "A Chinese national has been arrested in Milan, Italy, for his alleged links to a state-sponsored hacking group known as Silk Typhoon and for carrying out cyber attacks against American organizations and government agencies.\nThe 33-year-old, Xu Zewei, has been charged with nine counts of wire fraud a",
    "published": "2025-07-09T08:40:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server",
    "link": "https://thehackernews.com/2025/07/microsoft-patches-130-vulnerabilities.html",
    "summary": "For the first time in 2025, Microsoft's Patch Tuesday updates did not bundle fixes for exploited security vulnerabilities, but the company acknowledged one of the addressed flaws had been publicly known.\nThe patches resolve a whopping 130 vulnerabilities, along with 10 other non-Microsoft CVEs that ",
    "published": "2025-07-09T07:10:00",
    "source": "HackerNews"
  }
]