[
  {
    "title": "Cartier discloses data breach amid fashion brand cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/cartier-discloses-data-breach-amid-fashion-brand-cyberattacks/",
    "summary": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised. [...]",
    "published": "2025-06-02T22:31:49",
    "source": "BleepingComputer"
  },
  {
    "title": "The North Face warns customers of April credential stuffing attack",
    "link": "https://www.bleepingcomputer.com/news/security/the-north-face-warns-customers-of-april-credential-stuffing-attack/",
    "summary": "Outdoor apparel retailer The North Face is warning customers that their personal information was stolen in credential stuffing attacks targeting the company's website in April. [...]",
    "published": "2025-06-02T18:37:19",
    "source": "BleepingComputer"
  },
  {
    "title": "SentinelOne: Last week’s 7-hour outage caused by software flaw",
    "link": "https://www.bleepingcomputer.com/news/technology/sentinelone-last-weeks-7-hour-outage-caused-by-software-flaw/",
    "summary": "American cybersecurity company SentinelOne revealed over the weekend that a software flaw triggered a seven-hour-long outage on Thursday. [...]",
    "published": "2025-06-02T18:24:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome to distrust Chunghwa Telecom, Netlock certificates in August",
    "link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-distrust-chunghwa-telecom-netlock-certificates-in-august/",
    "summary": "Google says it will no longer trust root CA certificates signed by Chunghwa Telecom and Netlock in the Chrome Root Store due to a pattern of compliance failures and failure to make improvements. [...]",
    "published": "2025-06-02T17:36:30",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft and CrowdStrike partner to link hacking group names",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-and-crowdstrike-partner-to-link-hacking-group-names/",
    "summary": "Microsoft and CrowdStrike announced today that they've partnered to connect the aliases used for specific threat groups without actually using a single naming standard. [...]",
    "published": "2025-06-02T16:56:55",
    "source": "BleepingComputer"
  },
  {
    "title": "Cryptojacking Campaign Exploits DevOps APIs Using Off-the-Shelf Tools from GitHub",
    "link": "https://thehackernews.com/2025/06/cryptojacking-campaign-exploits-devops.html",
    "summary": "Cybersecurity researchers have discovered a new cryptojacking campaign that's targeting publicly accessible DevOps web servers such as those associated with Docker, Gitea, and HashiCorp Consul and Nomad to illicitly mine cryptocurrencies.\nCloud security firm Wiz, which is tracking the activity under",
    "published": "2025-06-02T16:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Preinstalled Apps on Ulefone, Krüger&Matz Phones Let Any App Reset Device, Steal PIN",
    "link": "https://thehackernews.com/2025/06/preinstalled-apps-on-ulefone-kruger.html",
    "summary": "Three security vulnerabilities have been disclosed in preloaded Android applications on smartphones from Ulefone and Krüger&amp;Matz that could enable any app installed on the device to perform a factory reset and encrypt an application.\nA brief description of the three flaws is as follows -\n\nCVE-20",
    "published": "2025-06-02T15:12:00",
    "source": "HackerNews"
  },
  {
    "title": "‘Russian Market’ emerges as a go-to shop for stolen credentials",
    "link": "https://www.bleepingcomputer.com/news/security/russian-market-emerges-as-a-go-to-shop-for-stolen-credentials/",
    "summary": "The \"Russian Market\" cybercrime marketplace has emerged as one of the most popular platforms for buying and selling credentials stolen by information stealer malware. [...]",
    "published": "2025-06-02T14:28:33",
    "source": "BleepingComputer"
  },
  {
    "title": "Qualcomm Fixes 3 Zero-Days Used in Targeted Android Attacks via Adreno GPU",
    "link": "https://thehackernews.com/2025/06/qualcomm-fixes-3-zero-days-used-in.html",
    "summary": "Qualcomm has shipped security updates to address three zero-day vulnerabilities that it said have been exploited in limited, targeted attacks in the wild.\nThe flaws in question, which were responsibly disclosed to the company by the Google Android Security team, are listed below -\n\nCVE-2025-21479 an",
    "published": "2025-06-02T14:22:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft ships emergency patch to fix Windows 11 startup failures",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-ships-emergency-patch-to-fix-windows-11-installation-issues/",
    "summary": "Microsoft has released an out-of-band update to address a known issue causing some Windows 11 systems to enter recovery and fail to start after installing the KB5058405 May 2025 security update. [...]",
    "published": "2025-06-02T12:06:25",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: APT Intrusions, AI Malware, Zero-Click Exploits, Browser Hijacks and More",
    "link": "https://thehackernews.com/2025/06/weekly-recap-apt-intrusions-ai-malware.html",
    "summary": "If this had been a security drill, someone would’ve said it went too far. But it wasn’t a drill—it was real. The access? Everything looked normal. The tools? Easy to find. The detection? Came too late.\nThis is how attacks happen now—quiet, convincing, and fast. Defenders aren’t just chasing hackers ",
    "published": "2025-06-02T11:23:00",
    "source": "HackerNews"
  }
]