[
  {
    "title": "MintsLoader Drops GhostWeaver via Phishing, ClickFix — Uses DGA, TLS for Stealth Attacks",
    "link": "https://thehackernews.com/2025/05/mintsloader-drops-ghostweaver-via.html",
    "summary": "The malware loader known as MintsLoader has been used to deliver a PowerShell-based remote access trojan called GhostWeaver.\n\"MintsLoader operates through a multi-stage infection chain involving obfuscated JavaScript and PowerShell scripts,\" Recorded Future's Insikt Group said in a report shared wit",
    "published": "2025-05-02T08:57:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft makes all new accounts passwordless by default",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-makes-all-new-accounts-passwordless-by-default/",
    "summary": "Microsoft has announced that all new Microsoft accounts will be \"passwordless by default\" to secure them against password attacks such as phishing, brute force, and credential stuffing. [...]",
    "published": "2025-05-02T07:21:24",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft Sets Passkeys Default for New Accounts; 15 Billion Users Gain Passwordless Support",
    "link": "https://thehackernews.com/2025/05/microsoft-sets-passkeys-default-for-new.html",
    "summary": "A year after Microsoft announced passkeys support for consumer accounts, the tech giant has announced a big change that pushes individuals signing up for new accounts to use the phishing-resistant authentication method by default.\n\"Brand new Microsoft accounts will now be 'passwordless by default,'\"",
    "published": "2025-05-02T06:40:00",
    "source": "HackerNews"
  },
  {
    "title": "xAI Dev Leaks API Key for Private SpaceX, Tesla LLMs",
    "link": "https://krebsonsecurity.com/2025/05/xai-dev-leaks-api-key-for-private-spacex-tesla-llms/",
    "summary": "A employee at Elon Musk's artificial intelligence company xAI leaked a private key on GitHub that for the past two months could have allowed anyone to query private xAI large language models (LLMs) which appear to have been custom made for working with internal data from Musk's companies, including ",
    "published": "2025-05-02T00:52:00",
    "source": "Krebs"
  },
  {
    "title": "Hacker 'NullBulge' pleads guilty to stealing Disney's Slack data",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-nullbulge-pleads-guilty-to-stealing-disneys-slack-data/",
    "summary": "A California man who used the alias \"NullBulge\" has pleaded guilty to illegally accessing Disney's internal Slack channels and stealing over 1.1 terabytes of internal company data. [...]",
    "published": "2025-05-01T23:13:05",
    "source": "BleepingComputer"
  }
]