[
  {
    "title": "Microsoft fixes Linux boot issues on dual-boot Windows systems",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-linux-boot-issues-on-dual-boot-windows-systems/",
    "summary": "​Microsoft has fixed a known issue preventing Linux from booting on dual-boot systems with Secure Boot enabled after installing the August 2024 Windows security updates. [...]",
    "published": "2025-05-14T14:50:45",
    "source": "BleepingComputer"
  },
  {
    "title": "Steel giant Nucor Corporation facing disruptions after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/steel-giant-nucor-corporation-facing-disruptions-after-cyberattack/",
    "summary": "A cybersecurity incident on Nucor Corporation's systems forced the company to take offline parts of its networks and implement containment measures. [...]",
    "published": "2025-05-14T14:39:20",
    "source": "BleepingComputer"
  },
  {
    "title": "CTM360 Identifies Surge in Phishing Attacks Targeting Meta Business Users",
    "link": "https://thehackernews.com/2025/05/ctm360-identifies-surge-in-phishing.html",
    "summary": "A new global phishing threat called \"Meta Mirage\" has been uncovered, targeting businesses using Meta's Business Suite. This campaign specifically aims at hijacking high-value accounts, including those managing advertising and official brand pages.\nCybersecurity researchers at CTM360 revealed that a",
    "published": "2025-05-14T14:05:00",
    "source": "HackerNews"
  },
  {
    "title": "Focused Phishing: Attack Targets Victims With Trusted Sites and Live Validation",
    "link": "https://www.bleepingcomputer.com/news/security/focused-phishing-attack-targets-victims-with-trusted-sites-and-live-validation/",
    "summary": "New phishing tactics are abusing trusted domains, real CAPTCHAs, and server-side email validation to selectively target victims with customized fake login pages. Keep Aware's latest research breaks down the full attack chain and how these zero-day phish operate. [...]",
    "published": "2025-05-14T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Fashion giant Dior discloses cyberattack, warns of data breach",
    "link": "https://www.bleepingcomputer.com/news/security/fashion-giant-dior-discloses-cyberattack-warns-of-data-breach/",
    "summary": "House of Dior, the French luxury fashion brand commonly referred to as Dior, has disclosed a cybersecurity incident that has exposed customer information. [...]",
    "published": "2025-05-14T13:37:35",
    "source": "BleepingComputer"
  },
  {
    "title": "Kosovo extradites BlackDB admin to face US cybercrime charges",
    "link": "https://www.bleepingcomputer.com/news/security/kosovo-extradites-blackdb-admin-to-face-us-cybercrime-charges/",
    "summary": "A Kosovo national has been extradited to the United States to face charges of running an online cybercrime marketplace active since 2018. [...]",
    "published": "2025-05-14T13:22:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Patch Tuesday, May 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/05/patch-tuesday-may-2025-edition/",
    "summary": "Microsoft on Tuesday released software updates to fix at least 70 vulnerabilities in Windows and related products, including five zero-day flaws that are already seeing active exploitation. Adding to the sense of urgency with this month's patch batch from Redmond are fixes for two other weaknesses t",
    "published": "2025-05-14T11:57:48",
    "source": "Krebs"
  },
  {
    "title": "Earth Ammit Breached Drone Supply Chains via ERP in VENOM, TIDRONE Campaigns",
    "link": "https://thehackernews.com/2025/05/earth-ammit-breached-drone-supply.html",
    "summary": "A cyber espionage group known as Earth Ammit has been linked to two related but distinct campaigns from 2023 to 2024 targeting various entities in Taiwan and South Korea, including military, satellite, heavy industry, media, technology, software services, and healthcare sectors.\nCybersecurity firm T",
    "published": "2025-05-14T11:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Learning How to Hack: Why Offensive Security Training Benefits Your Entire Security Team",
    "link": "https://thehackernews.com/2025/05/learning-how-to-hack-why-offensive.html",
    "summary": "Organizations across industries are experiencing significant escalations in cyberattacks, particularly targeting critical infrastructure providers and cloud-based enterprises. Verizon’s recently released 2025 Data Breach Investigations Report found an 18% YoY increase in confirmed breaches, with the",
    "published": "2025-05-14T10:54:00",
    "source": "HackerNews"
  },
  {
    "title": "Horabot Malware Targets 6 Latin American Nations Using Invoice-Themed Phishing Emails",
    "link": "https://thehackernews.com/2025/05/horabot-malware-targets-6-latin.html",
    "summary": "Cybersecurity researchers have discovered a new phishing campaign that's being used to distribute malware called Horabot targeting Windows users in Latin American countries like Mexico, Guatemala, Colombia, Peru, Chile, and Argentina.\nThe campaign is \"using crafted emails that impersonate invoices o",
    "published": "2025-05-14T10:40:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Fixes 78 Flaws, 5 Zero-Days Exploited; CVSS 10 Bug Impacts Azure DevOps Server",
    "link": "https://thehackernews.com/2025/05/microsoft-fixes-78-flaws-5-zero-days.html",
    "summary": "Microsoft on Tuesday shipped fixes to address a total of 78 security flaws across its software lineup, including a set of five zero-days that have come under active exploitation in the wild.\nOf the 78 flaws resolved by the tech giant, 11 are rated Critical, 66 are rated Important, and one is rated L",
    "published": "2025-05-14T08:14:00",
    "source": "HackerNews"
  },
  {
    "title": "Fortinet Patches CVE-2025-32756 Zero-Day RCE Flaw Exploited in FortiVoice Systems",
    "link": "https://thehackernews.com/2025/05/fortinet-patches-cve-2025-32756-zero.html",
    "summary": "Fortinet has patched a critical security flaw that it said has been exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems.\nThe vulnerability, tracked as CVE-2025-32756, carries a CVSS score of 9.6 out of 10.0.\n\"A stack-based overflow vulnerability [CWE-121] in FortiVoice, ",
    "published": "2025-05-14T04:21:00",
    "source": "HackerNews"
  },
  {
    "title": "Ivanti Patches EPMM Vulnerabilities Exploited for Remote Code Execution in Limited Attacks",
    "link": "https://thehackernews.com/2025/05/ivanti-patches-epmm-vulnerabilities.html",
    "summary": "Ivanti has released security updates to address two security flaws in Endpoint Manager Mobile (EPMM) software that have been chained in attacks to gain remote code execution.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-4427 (CVSS score: 5.3) - An authentication bypass in Ivanti Endp",
    "published": "2025-05-14T04:00:00",
    "source": "HackerNews"
  }
]