[
  {
    "title": "U.S. Sanctions North Korean Andariel Hacker Behind Fraudulent IT Worker Scheme",
    "link": "https://thehackernews.com/2025/07/us-sanctions-north-korean-andariel.html",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday sanctioned a member of a North Korean hacking group called Andariel for their role in the infamous remote information technology (IT) worker scheme.\nThe Treasury said Song Kum Hyok, a 38-year-old North Korean na",
    "published": "2025-07-09T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "How To Automate Ticket Creation, Device Identification and Threat Triage With Tines",
    "link": "https://thehackernews.com/2025/07/how-to-automate-ticket-creation-device.html",
    "summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features over 1,000 pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform’s Community Edition.\nA recent standout is a workflow that handles",
    "published": "2025-07-09T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hacker Xu Zewei Arrested for Ties to Silk Typhoon Group and U.S. Cyber Attacks",
    "link": "https://thehackernews.com/2025/07/chinese-hacker-xu-zewei-arrested-for.html",
    "summary": "A Chinese national has been arrested in Milan, Italy, for his alleged links to a state-sponsored hacking group known as Silk Typhoon and for carrying out cyber attacks against American organizations and government agencies.\nThe 33-year-old, Xu Zewei, has been charged with nine counts of wire fraud a",
    "published": "2025-07-09T08:40:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server",
    "link": "https://thehackernews.com/2025/07/microsoft-patches-130-vulnerabilities.html",
    "summary": "For the first time in 2025, Microsoft's Patch Tuesday updates did not bundle fixes for exploited security vulnerabilities, but the company acknowledged one of the addressed flaws had been publicly known.\nThe patches resolve a whopping 130 vulnerabilities, along with 10 other non-Microsoft CVEs that ",
    "published": "2025-07-09T07:10:00",
    "source": "HackerNews"
  }
]