[
  {
    "title": "Microsoft 365 'Direct Send' abused to send phishing as internal users",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-365-direct-send-abused-to-send-phishing-as-internal-users/",
    "summary": "An ongoing phishing campaign abuses a little‑known feature in Microsoft 365 called \"Direct Send\" to evade detection by email security and steal credentials. [...]",
    "published": "2025-06-26T13:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "The Hidden Risks of SaaS: Why Built-In Protections Aren't Enough for Modern Data Resilience",
    "link": "https://thehackernews.com/2025/06/the-hidden-risks-of-saas-why-built-in.html",
    "summary": "SaaS Adoption is Skyrocketing, Resilience Hasn’t Kept Pace\nSaaS platforms have revolutionized how businesses operate. They simplify collaboration, accelerate deployment, and reduce the overhead of managing infrastructure. But with their rise comes a subtle, dangerous assumption: that the convenience",
    "published": "2025-06-26T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft fixes Outlook bug causing crashes when opening emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-bug-causing-crashes-when-opening-emails/",
    "summary": "Microsoft has fixed a known issue that will cause the classic Outlook email client to crash when opening emails or starting a new message. [...]",
    "published": "2025-06-26T10:26:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft confirms Family Safety blocks Google Chrome from launching",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-family-safety-blocks-google-chrome-from-launching/",
    "summary": "Microsoft has confirmed that its Family Safety parental control service is blocking users from launching Google Chrome and other web browsers on Windows systems. [...]",
    "published": "2025-06-26T09:50:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Iranian APT35 Hackers Targeting Israeli Tech Experts with AI-Powered Phishing Attacks",
    "link": "https://thehackernews.com/2025/06/iranian-apt35-hackers-targeting-israeli.html",
    "summary": "An Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (IRGC) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security experts, and computer science professors in Israel.\n\"In some of those campaigns, Israeli technology an",
    "published": "2025-06-26T08:45:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA: AMI MegaRAC bug enabling server hijacks exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-ami-megarac-bug-that-lets-hackers-brick-servers-now-actively-exploited/",
    "summary": "CISA says a maximum severity vulnerability in AMI's MegaRAC Baseboard Management Controller (BMC) software, which enables attackers to hijack and brick servers, is currently under active exploitation. [...]",
    "published": "2025-06-26T08:38:05",
    "source": "BleepingComputer"
  },
  {
    "title": "Cyber Criminals Exploit Open-Source Tools to Compromise Financial Institutions Across Africa",
    "link": "https://thehackernews.com/2025/06/cyber-criminals-exploit-open-source.html",
    "summary": "Cybersecurity researchers are calling attention to a series of cyber attacks targeting financial organizations across Africa since at least July 2023 using a mix of open-source and publicly available tools to maintain access.\nPalo Alto Networks Unit 42 is tracking the activity under the moniker CL-C",
    "published": "2025-06-26T07:19:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds 3 Flaws to KEV Catalog, Impacting AMI MegaRAC, D-Link, Fortinet",
    "link": "https://thehackernews.com/2025/06/cisa-adds-3-flaws-to-kev-catalog.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added three security flaws, each impacting AMI MegaRAC, D-Link DIR-859 router, and Fortinet FortiOS, to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe list of vulnerabiliti",
    "published": "2025-06-26T06:02:00",
    "source": "HackerNews"
  },
  {
    "title": "WhatsApp Adds AI-Powered Message Summaries for Faster Chat Previews",
    "link": "https://thehackernews.com/2025/06/whatsapp-adds-ai-powered-message.html",
    "summary": "Popular messaging platform WhatsApp has added a new artificial intelligence (AI)-powered feature that leverages its in-house solution Meta AI to summarize unread messages in chats.\nThe feature, called Message Summaries, is currently rolling out in the English language to users in the United States, ",
    "published": "2025-06-26T04:36:00",
    "source": "HackerNews"
  }
]