[
  {
    "title": "CISA Warns of Suspected Broader SaaS Attacks Exploiting App Secrets and Cloud Misconfigs",
    "link": "https://thehackernews.com/2025/05/cisa-warns-of-suspected-broader-saas.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday revealed that Commvault is monitoring cyber threat activity targeting applications hosted in their Microsoft Azure cloud environment.\n\"Threat actors may have accessed client secrets for Commvault's (Metallic) Microsoft 365 ",
    "published": "2025-05-23T05:16:00",
    "source": "HackerNews"
  },
  {
    "title": "GitLab Duo Vulnerability Enabled Attackers to Hijack AI Responses with Hidden Prompts",
    "link": "https://thehackernews.com/2025/05/gitlab-duo-vulnerability-enabled.html",
    "summary": "Cybersecurity researchers have discovered an indirect prompt injection flaw in GitLab's artificial intelligence (AI) assistant Duo that could have allowed attackers to steal source code and inject untrusted HTML into its responses, which could then be used to direct victims to malicious websites.\nGi",
    "published": "2025-05-23T04:34:00",
    "source": "HackerNews"
  },
  {
    "title": "Claude 4 benchmarks show improvements, but context is still 200K",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/claude-4-benchmarks-show-improvements-but-context-is-still-200k/",
    "summary": "Today, OpenAI rival Anthropic announced Claude 4 models, which are significantly better than Claude 3 in benchmarks, but we're left disappointed with the same 200,000 context window limit. [...]",
    "published": "2025-05-22T23:17:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Oops: DanaBot Malware Devs Infected Their Own PCs",
    "link": "https://krebsonsecurity.com/2025/05/oops-danabot-malware-devs-infected-their-own-pcs/",
    "summary": "The U.S. government today unsealed criminal charges against 16 individuals accused of operating and selling DanaBot, a prolific strain of information-stealing malware that has been sold on Russian cybercrime forums since 2018. The FBI says a newer version of DanaBot was used for espionage, and that ",
    "published": "2025-05-22T21:53:21",
    "source": "Krebs"
  },
  {
    "title": "US indicts leader of Qakbot botnet linked to ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-indicts-leader-of-qakbot-botnet-linked-to-ransomware-attacks/",
    "summary": "The U.S. government has indicted Russian national Rustam Rafailevich Gallyamov, the leader of the Qakbot botnet malware operation that compromised over 700,000 computers and enabled ransomware attacks. [...]",
    "published": "2025-05-22T20:16:25",
    "source": "BleepingComputer"
  }
]