[
  {
    "title": "ChatGPT will soon record, transcribe, and summarize your meetings",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-will-soon-record-transcribe-and-summarize-your-meetings/",
    "summary": "OpenAI may be planning to challenge Microsoft Teams Copilot integration with a new \"Record\" feature in ChatGPT. [...]",
    "published": "2025-05-15T23:09:40",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 10 KB5058379 update triggers BitLocker recovery on some devices",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058379-update-triggering-bitlocker-recovery-after-install/",
    "summary": "The Windows 10 KB5058379 cumulative update is triggering unexpected BitLocker recovery prompts on some devices afters it's installed and the computer restarted. [...]",
    "published": "2025-05-15T21:38:27",
    "source": "BleepingComputer"
  },
  {
    "title": "Breachforums Boss to Pay $700k in Healthcare Breach",
    "link": "https://krebsonsecurity.com/2025/05/breachforums-boss-to-pay-700k-in-healthcare-breach/",
    "summary": "In what experts are calling a novel legal outcome, the 22-year-old former administrator of the cybercrime community Breachforums will forfeit nearly $700,000 to settle a civil lawsuit from a health insurance company whose customer data was posted for sale on the forum in 2023. Conor Brian Fitzpatric",
    "published": "2025-05-15T19:56:51",
    "source": "Krebs"
  },
  {
    "title": "Government webmail hacked via XSS bugs in global spy campaign",
    "link": "https://www.bleepingcomputer.com/news/security/government-webmail-hacked-via-xss-bugs-in-global-spy-campaign/",
    "summary": "Hackers are running a worldwide cyberespionage campaign dubbed 'RoundPress,' leveraging zero-day and n-day flaws in webmail servers to steal email from high-value government organizations. [...]",
    "published": "2025-05-15T19:14:39",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI: US officials targeted in voice deepfake attacks since April",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-us-officials-targeted-in-voice-deepfake-attacks-since-april/",
    "summary": "The FBI warned that cybercriminals using AI-generated audio deepfakes to target U.S. officials in voice phishing attacks that started in April. [...]",
    "published": "2025-05-15T18:22:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Meta to Train AI on E.U. User Data From May 27 Without Consent; Noyb Threatens Lawsuit",
    "link": "https://thehackernews.com/2025/05/meta-to-train-ai-on-eu-user-data-from.html",
    "summary": "Austrian privacy non-profit noyb (none of your business) has sent Meta's Irish headquarters a cease-and-desist letter, threatening the company with a class action lawsuit if it proceeds with its plans to train users' data for training its artificial intelligence (AI) models without an explicit opt-i",
    "published": "2025-05-15T16:45:00",
    "source": "HackerNews"
  },
  {
    "title": "Nova Scotia Power confirms hackers stole customer data in cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/nova-scotia-power-confirms-hackers-stole-customer-data-in-cyberattack/",
    "summary": "Nova Scotia Power confirms it suffered a data breach after threat actors stole sensitive customer data in a cybersecurity incident discovered last month. [...]",
    "published": "2025-05-15T16:38:29",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 and Red Hat Linux hacked on first day of Pwn2Own",
    "link": "https://www.bleepingcomputer.com/news/security/windows-11-and-red-hat-linux-virtualbox-hacked-on-first-day-of-pwn2own/",
    "summary": "On the first day of Pwn2Own Berlin 2025, security researchers were awarded $260,000 after successfully demonstrating zero-day exploits for Windows 11, Red Hat Linux, Docker Desktop, and Oracle VirtualBox. [...]",
    "published": "2025-05-15T15:48:44",
    "source": "BleepingComputer"
  },
  {
    "title": "New Tor Oniux tool anonymizes any Linux app's network traffic",
    "link": "https://www.bleepingcomputer.com/news/security/new-tor-oniux-tool-anonymizes-any-linux-apps-network-traffic/",
    "summary": "Tor has announced Oniux, a new command-line tool for routing any Linux application securely through the Tor network for anonymized network connections. [...]",
    "published": "2025-05-15T15:20:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Coinbase Agents Bribed, Data of ~1% Users Leaked; $20M Extortion Attempt Fails",
    "link": "https://thehackernews.com/2025/05/coinbase-agents-bribed-data-of-1-users.html",
    "summary": "Cryptocurrency exchange Coinbase has disclosed that unknown cyber actors broke into its systems and stole account data for a small subset of its customers.\n\"Criminals targeted our customer support agents overseas,\" the company said in a statement. \"They used cash offers to convince a small group of ",
    "published": "2025-05-15T14:28:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious NPM package uses Unicode steganography to evade detection",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-npm-package-uses-unicode-steganography-to-evade-detection/",
    "summary": "A malicious package in the Node Package Manager index uses invisible Unicode characters to hide malicious code and Google Calendar links to host the URL for the command-and-control location. [...]",
    "published": "2025-05-15T13:31:47",
    "source": "BleepingComputer"
  },
  {
    "title": "Coinbase data breach exposes customer info and government IDs",
    "link": "https://www.bleepingcomputer.com/news/security/coinbase-discloses-breach-faces-up-to-400-million-in-losses/",
    "summary": "Coinbase, a cryptocurrency exchange with over 100 million customers, has disclosed that cybercriminals working with rogue support agents stole customer data and demanded a $20 million ransom not to publish the stolen information. [...]",
    "published": "2025-05-15T13:28:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Pen Testing for Compliance Only? It's Time to Change Your Approach",
    "link": "https://thehackernews.com/2025/05/pen-testing-for-compliance-only-its.html",
    "summary": "Imagine this: Your organization completed its annual penetration test in January, earning high marks for security compliance. In February, your development team deployed a routine software update. By April, attackers had already exploited a vulnerability introduced in that February update, gaining a",
    "published": "2025-05-15T11:25:00",
    "source": "HackerNews"
  }
]