[
  {
    "title": "Commvault Confirms Hackers Exploited CVE-2025-3928 as Zero-Day in Azure Breach",
    "link": "https://thehackernews.com/2025/05/commvault-confirms-hackers-exploited.html",
    "summary": "Enterprise data backup platform Commvault has revealed that an unknown nation-state threat actor breached its Microsoft Azure environment by exploiting CVE-2025-3928 but emphasized there is no evidence of unauthorized data access.\n\"This activity has affected a small number of customers we have in co",
    "published": "2025-05-01T08:11:00",
    "source": "HackerNews"
  },
  {
    "title": "SonicWall Confirms Active Exploitation of Flaws Affecting Multiple Appliance Models",
    "link": "https://thehackernews.com/2025/05/sonicwall-confirms-active-exploitation.html",
    "summary": "SonicWall has revealed that two now-patched security flaws impacting its SMA100 Secure Mobile Access (SMA) appliances have been exploited in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2023-44221 (CVSS score: 7.2) - Improper neutralization of special elements in the SMA100 SSL-",
    "published": "2025-05-01T06:22:00",
    "source": "HackerNews"
  },
  {
    "title": "Hackers abuse IPv6 networking feature to hijack software updates",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-abuse-ipv6-networking-feature-to-hijack-software-updates/",
    "summary": "A China-aligned APT threat actor named \"TheWizards\" abuses an IPv6 networking feature to launch adversary-in-the-middle (AitM) attacks that hijack software updates to install Windows malware. [...]",
    "published": "2025-05-01T00:33:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Alleged ‘Scattered Spider’ Member Extradited to U.S.",
    "link": "https://krebsonsecurity.com/2025/04/alleged-scattered-spider-member-extradited-to-u-s/",
    "summary": "A 23-year-old Scottish man thought to be a member of the prolific Scattered Spider cybercrime group was extradited last week from Spain to the United States, where he is facing charges of wire fraud, conspiracy and identity theft. U.S. prosecutors allege Tyler Robert Buchanan and co-conspirators hac",
    "published": "2025-04-30T21:54:59",
    "source": "Krebs"
  },
  {
    "title": "WordPress plugin disguised as a security tool injects backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/wordpress-plugin-disguised-as-a-security-tool-injects-backdoor/",
    "summary": "A new malware campaign targeting WordPress sites employs a malicious plugin disguised as a security tool to trick users into installing and trusting it. [...]",
    "published": "2025-04-30T21:05:46",
    "source": "BleepingComputer"
  }
]