[
  {
    "title": "Google Cloud donates A2A AI protocol to the Linux Foundation",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-cloud-donates-a2a-ai-protocol-to-the-linux-foundation/",
    "summary": "Google Cloud has donated its Agent2Agent (A2A) protocol to the Linux Foundation, which has now announced a new community-driven project called the Agent2Agent Project. [...]",
    "published": "2025-06-24T21:34:38",
    "source": "BleepingComputer"
  },
  {
    "title": "SonicWall warns of trojanized NetExtender stealing VPN logins",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-warns-of-trojanized-netextender-stealing-vpn-logins/",
    "summary": "SonicWall is warning customers that threat actors are distributing a trojanized version of its NetExtender SSL VPN client used to steal VPN credentials. [...]",
    "published": "2025-06-24T20:36:19",
    "source": "BleepingComputer"
  },
  {
    "title": "New U.S. Visa Rule Requires Applicants to Set Social Media Account Privacy to Public",
    "link": "https://thehackernews.com/2025/06/new-us-visa-rule-requires-applicants-to.html",
    "summary": "The United States Embassy in India has announced that applicants for F, M, and J nonimmigrant visas should make their social media accounts public.\nThe new guideline seeks to help officials verify the identity and eligibility of applicants under U.S. law. The U.S. Embassy said every visa application",
    "published": "2025-06-24T18:47:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 10 KB5061087 update released with 13 changes and fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5061087-update-released-with-13-changes-and-fixes/",
    "summary": "Microsoft has released the June 2025 non-security preview update for Windows 10, version 22H2, with fixes for bugs preventing the Start Menu from launching and breaking scanning features on USB multi-function printers. [...]",
    "published": "2025-06-24T18:07:43",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft fixes known issue that breaks Windows 11 updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-known-issue-that-breaks-windows-11-updates/",
    "summary": "Microsoft is rolling out a configuration update designed to address a known issue causing Windows Update to fail on some Windows 11 systems. [...]",
    "published": "2025-06-24T17:13:30",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 10 users can get extended security updates using Microsoft points",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-10-extended-security-updates-available-using-reward-points/",
    "summary": "Microsoft says Windows 10 home users who want to delay switching to Windows 11 can enroll in the Extended Security Updates (ESU) program at no additional cost using Microsoft Rewards points or enabling Windows Backup to sync their data to the cloud. [...]",
    "published": "2025-06-24T17:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Trezor’s support platform abused in crypto theft phishing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/trezors-support-platform-abused-in-crypto-theft-phishing-attacks/",
    "summary": "Trezor is alerting users about a phishing campaign that abuses its automated support system to send deceptive emails from its official platform. [...]",
    "published": "2025-06-24T16:54:16",
    "source": "BleepingComputer"
  },
  {
    "title": "New FileFix attack weaponizes Windows File Explorer for stealthy commands",
    "link": "https://www.bleepingcomputer.com/news/security/filefix-attack-weaponizes-windows-file-explorer-for-stealthy-powershell-commands/",
    "summary": "A cybersecurity researcher has developed FileFix, a variant of the ClickFix social engineering attack that tricks users into executing malicious commands via the File Explorer address bar in Windows. [...]",
    "published": "2025-06-24T15:00:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Find Way to Shut Down Cryptominer Campaigns Using Bad Shares and XMRogue",
    "link": "https://thehackernews.com/2025/06/researchers-find-way-to-shut-down.html",
    "summary": "Cybersecurity researchers have detailed two novel methods that can be used to disrupt cryptocurrency mining botnets.\nThe methods take advantage of the design of various common mining topologies in order to shut down the mining process, Akamai said in a new report published today.\n\"We developed two t",
    "published": "2025-06-24T14:17:00",
    "source": "HackerNews"
  },
  {
    "title": "How Today’s Pentest Models Compare and Why Continuous Wins",
    "link": "https://www.bleepingcomputer.com/news/security/how-todays-pentest-models-compare-and-why-continuous-wins/",
    "summary": "Legacy pentests give you a snapshot. Attackers see a live stream. Sprocket's Continuous Penetration Testing (CPT) mimics real-world attackers—daily, not annually—so you can fix what matters, faster. Learn why CPT is the future. [...]",
    "published": "2025-06-24T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "US House bans WhatsApp on staff devices over security concerns",
    "link": "https://www.bleepingcomputer.com/news/security/us-house-bans-whatsapp-on-staff-devices-over-security-concerns/",
    "summary": "The U.S. House of Representatives has banned the installation and use of WhatsApp on government-issued devices belonging to congressional staff, citing concerns over how the app encrypts and secures data. [...]",
    "published": "2025-06-24T13:43:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Target Over 70 Microsoft Exchange Servers to Steal Credentials via Keyloggers",
    "link": "https://thehackernews.com/2025/06/hackers-target-65-microsoft-exchange.html",
    "summary": "Unidentified threat actors have been observed targeting publicly exposed Microsoft Exchange servers to inject malicious code into the login pages that harvest their credentials.\nPositive Technologies, in a new analysis published last week, said it identified two different kinds of keylogger code wri",
    "published": "2025-06-24T13:26:00",
    "source": "HackerNews"
  },
  {
    "title": "Between Buzz and Reality: The CTEM Conversation We All Need",
    "link": "https://thehackernews.com/2025/06/between-buzz-and-reality-ctem.html",
    "summary": "I had the honor of hosting the first episode of the Xposure Podcast live from Xposure Summit 2025. And I couldn’t have asked for a better kickoff panel: three cybersecurity leaders who don’t just talk security, they live it.\nLet me introduce them.\nAlex Delay, CISO at IDB Bank, knows what it means to",
    "published": "2025-06-24T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Hackers Exploit Misconfigured Docker APIs to Mine Cryptocurrency via Tor Network",
    "link": "https://thehackernews.com/2025/06/hackers-exploit-misconfigured-docker.html",
    "summary": "Misconfigured Docker instances are the target of a campaign that employs the Tor anonymity network to stealthily mine cryptocurrency in susceptible environments.\n\"Attackers are exploiting misconfigured Docker APIs to gain access to containerized environments, then using Tor to mask their activities ",
    "published": "2025-06-24T09:57:00",
    "source": "HackerNews"
  }
]