[
  {
    "title": "Why top SOC teams are shifting to Network Detection and Response",
    "link": "https://thehackernews.com/2025/05/why-top-soc-teams-are-shifting-to.html",
    "summary": "Security Operations Center (SOC) teams are facing a fundamentally new challenge &mdash; traditional cybersecurity tools are failing to detect advanced adversaries who have become experts at evading endpoint-based defenses and signature-based detection systems. The reality of these &ldquo;invisible i",
    "published": "2025-05-01T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Claude AI Exploited to Operate 100+ Fake Political Personas in Global Influence Campaign",
    "link": "https://thehackernews.com/2025/05/claude-ai-exploited-to-operate-100-fake.html",
    "summary": "Artificial intelligence (AI) company Anthropic has revealed that unknown threat actors leveraged its Claude chatbot for an \"influence-as-a-service\" operation to engage with authentic accounts across Facebook and X.\nThe sophisticated activity, branded as financially-motivated, is said to have used it",
    "published": "2025-05-01T11:02:00",
    "source": "HackerNews"
  },
  {
    "title": "New Research Reveals: 95% of AppSec Fixes Don’t Reduce Risk",
    "link": "https://thehackernews.com/2025/05/new-research-reveals-95-of-appsec-fixes.html",
    "summary": "For over a decade, application security teams have faced a brutal irony: the more advanced the detection tools became, the less useful their results proved to be. As alerts from static analysis tools, scanners, and CVE databases surged, the promise of better security grew more distant. In its place,",
    "published": "2025-05-01T09:44:00",
    "source": "HackerNews"
  },
  {
    "title": "DarkWatchman, Sheriff Malware Hit Russia and Ukraine with Stealth and Nation-Grade Tactics",
    "link": "https://thehackernews.com/2025/05/darkwatchman-sheriff-malware-hit-russia.html",
    "summary": "Russian companies have been targeted as part of a large-scale phishing campaign that's designed to deliver a known malware called DarkWatchman.\nTargets of the attacks include entities in the media, tourism, finance and insurance, manufacturing, retail, energy, telecom, transport, and biotechnology s",
    "published": "2025-05-01T09:27:00",
    "source": "HackerNews"
  },
  {
    "title": "Commvault Confirms Hackers Exploited CVE-2025-3928 as Zero-Day in Azure Breach",
    "link": "https://thehackernews.com/2025/05/commvault-confirms-hackers-exploited.html",
    "summary": "Enterprise data backup platform Commvault has revealed that an unknown nation-state threat actor breached its Microsoft Azure environment by exploiting CVE-2025-3928 but emphasized there is no evidence of unauthorized data access.\n\"This activity has affected a small number of customers we have in co",
    "published": "2025-05-01T08:11:00",
    "source": "HackerNews"
  },
  {
    "title": "SonicWall Confirms Active Exploitation of Flaws Affecting Multiple Appliance Models",
    "link": "https://thehackernews.com/2025/05/sonicwall-confirms-active-exploitation.html",
    "summary": "SonicWall has revealed that two now-patched security flaws impacting its SMA100 Secure Mobile Access (SMA) appliances have been exploited in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2023-44221 (CVSS score: 7.2) - Improper neutralization of special elements in the SMA100 SSL-",
    "published": "2025-05-01T06:22:00",
    "source": "HackerNews"
  }
]