[
  {
    "title": "LockBit ransomware gang hacked, victim negotiations exposed",
    "link": "https://www.bleepingcomputer.com/news/security/lockbit-ransomware-gang-hacked-victim-negotiations-exposed/",
    "summary": "The LockBit ransomware gang has suffered a data breach after its dark web affiliate panels were defaced and replaced with a message linking to a MySQL database dump. [...]",
    "published": "2025-05-08T00:06:32",
    "source": "BleepingComputer"
  },
  {
    "title": "Pakistani Firm Shipped Fentanyl Analogs, Scams to US",
    "link": "https://krebsonsecurity.com/2025/05/pakistani-firm-shipped-fentanyl-analogs-scams-to-us/",
    "summary": "A Texas firm recently charged with conspiring to distribute synthetic opioids in the United States is at the center of a vast network of companies in the U.S. and Pakistan whose employees are accused of using online ads to scam westerners seeking help with trademarks, book writing, mobile app develo",
    "published": "2025-05-07T22:22:48",
    "source": "Krebs"
  },
  {
    "title": "PowerSchool hacker now extorting individual school districts",
    "link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-now-extorting-individual-school-districts/",
    "summary": "PowerSchool is warning that the hacker behind its December cyberattack is now individually extorting schools, threatening to release the previously stolen student and teacher data if a ransom is not paid. [...]",
    "published": "2025-05-07T18:25:39",
    "source": "BleepingComputer"
  },
  {
    "title": "CoGUI phishing platform sent 580 million emails to steal credentials",
    "link": "https://www.bleepingcomputer.com/news/security/cogui-phishing-platform-sent-580-million-emails-to-steal-credentials/",
    "summary": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data. [...]",
    "published": "2025-05-07T18:02:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers exploit OttoKit WordPress plugin flaw to add admin accounts",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-ottokit-wordpress-plugin-flaw-to-add-admin-accounts/",
    "summary": "Hackers are exploiting a critical unauthenticated privilege escalation vulnerability in the OttoKit WordPress plugin to create rogue admin accounts on targeted sites. [...]",
    "published": "2025-05-07T15:37:48",
    "source": "BleepingComputer"
  }
]