[
  {
    "title": "FedRAMP at Startup Speed: Lessons Learned",
    "link": "https://thehackernews.com/2025/06/fedramp-at-startup-speed-lessons-learned.html",
    "summary": "For organizations eyeing the federal market, FedRAMP can feel like a gated fortress. With strict compliance requirements and a notoriously long runway, many companies assume the path to authorization is reserved for the well-resourced enterprise. But that’s changing.\nIn this post, we break down how ",
    "published": "2025-06-18T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Water Curse Employs 76 GitHub Accounts to Deliver Multi-Stage Malware Campaign",
    "link": "https://thehackernews.com/2025/06/water-curse-hijacks-76-github-accounts.html",
    "summary": "Cybersecurity researchers have exposed a previously unknown threat actor known as Water Curse that relies on weaponized GitHub repositories to deliver multi-stage malware.\n\"The malware enables data exfiltration (including credentials, browser data, and session tokens), remote access, and long-term p",
    "published": "2025-06-18T10:47:00",
    "source": "HackerNews"
  },
  {
    "title": "BeyondTrust warns of pre-auth RCE in Remote Support software",
    "link": "https://www.bleepingcomputer.com/news/security/beyondtrust-warns-of-pre-auth-rce-in-remote-support-software/",
    "summary": "BeyondTrust has released security updates to fix a high-severity flaw in its Remote Support (RS) and Privileged Remote Access (PRA) solutions that can let unauthenticated attackers gain remote code execution on vulnerable servers. [...]",
    "published": "2025-06-18T10:10:03",
    "source": "BleepingComputer"
  },
  {
    "title": "New Linux udisks flaw lets attackers get root on major Linux distros",
    "link": "https://www.bleepingcomputer.com/news/linux/new-linux-udisks-flaw-lets-attackers-get-root-on-major-linux-distros/",
    "summary": "Attackers can exploit two newly discovered local privilege escalation (LPE) vulnerabilities to gain root privileges on systems running major Linux distributions. [...]",
    "published": "2025-06-18T08:45:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Asana warns MCP AI feature exposed customer data to other orgs",
    "link": "https://www.bleepingcomputer.com/news/security/asana-warns-mcp-ai-feature-exposed-customer-data-to-other-orgs/",
    "summary": "Work management platform Asana is warning users of its new Model Context Protocol (MCP) feature that a flaw in its implementation potentially led to data exposure from their instances to other users and vice versa. [...]",
    "published": "2025-06-18T07:16:19",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA Warns of Active Exploitation of Linux Kernel Privilege Escalation Vulnerability",
    "link": "https://thehackernews.com/2025/06/cisa-warns-of-active-exploitation-of.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday placed a security flaw impacting the Linux kernel in its Known Exploited Vulnerabilities (KEV) catalog, stating it has been actively exploited in the wild.\nThe vulnerability, CVE-2023-0386 (CVSS score: 7.8), is an improper o",
    "published": "2025-06-18T06:43:00",
    "source": "HackerNews"
  },
  {
    "title": "Ex-CIA Analyst Sentenced to 37 Months for Leaking Top Secret National Defense Documents",
    "link": "https://thehackernews.com/2025/06/ex-cia-analyst-sentenced-to-37-months.html",
    "summary": "A former U.S. Central Intelligence Agency (CIA) analyst has been sentenced to little more than three years in prison for unlawfully retaining and transmitting top secret National Defense Information (NDI) to people who were not entitled to receive them and for attempting to cover up the malicious ac",
    "published": "2025-06-18T06:43:00",
    "source": "HackerNews"
  },
  {
    "title": "Veeam Patches CVE-2025-23121: Critical RCE Bug Rated 9.9 CVSS in Backup & Replication",
    "link": "https://thehackernews.com/2025/06/veeam-patches-cve-2025-23121-critical.html",
    "summary": "Veeam has rolled out patches to contain a critical security flaw impacting its Backup &amp; Replication software that could result in remote code execution under certain conditions.\nThe security defect, tracked as CVE-2025-23121, carries a CVSS score of 9.9 out of a maximum of 10.0.\n\"A vulnerability",
    "published": "2025-06-18T05:49:00",
    "source": "HackerNews"
  },
  {
    "title": "Iran Slows Internet to Prevent Cyber Attacks Amid Escalating Regional Conflict",
    "link": "https://thehackernews.com/2025/06/iran-restricts-internet-access-to.html",
    "summary": "Iran has throttled internet access in the country in a purported attempt to hamper Israel's ability to conduct covert cyber operations, days after the latter launched an unprecedented attack on the country, escalating geopolitical tensions in the region.\nFatemeh Mohajerani, the spokesperson of the I",
    "published": "2025-06-18T05:35:00",
    "source": "HackerNews"
  }
]