[
  {
    "title": "‘Russian Market’ emerges as a go-to shop for stolen credentials",
    "link": "https://www.bleepingcomputer.com/news/security/russian-market-emerges-as-a-go-to-shop-for-stolen-credentials/",
    "summary": "The \"Russian Market\" cybercrime marketplace has emerged as one of the most popular platforms for buying and selling credentials stolen by information stealer malware. [...]",
    "published": "2025-06-02T14:28:33",
    "source": "BleepingComputer"
  },
  {
    "title": "Qualcomm Fixes 3 Zero-Days Used in Targeted Android Attacks via Adreno GPU",
    "link": "https://thehackernews.com/2025/06/qualcomm-fixes-3-zero-days-used-in.html",
    "summary": "Qualcomm has shipped security updates to address three zero-day vulnerabilities that it said have been exploited in limited, targeted attacks in the wild.\nThe flaws in question, which were responsibly disclosed to the company by the Google Android Security team, are listed below -\n\nCVE-2025-21479 an",
    "published": "2025-06-02T14:22:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft ships emergency patch to fix Windows 11 startup failures",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-ships-emergency-patch-to-fix-windows-11-installation-issues/",
    "summary": "Microsoft has released an out-of-band update to address a known issue causing some Windows 11 systems to enter recovery and fail to start after installing the KB5058405 May 2025 security update. [...]",
    "published": "2025-06-02T12:06:25",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: APT Intrusions, AI Malware, Zero-Click Exploits, Browser Hijacks and More",
    "link": "https://thehackernews.com/2025/06/weekly-recap-apt-intrusions-ai-malware.html",
    "summary": "If this had been a security drill, someone would’ve said it went too far. But it wasn’t a drill—it was real. The access? Everything looked normal. The tools? Easy to find. The detection? Came too late.\nThis is how attacks happen now—quiet, convincing, and fast. Defenders aren’t just chasing hackers ",
    "published": "2025-06-02T11:23:00",
    "source": "HackerNews"
  },
  {
    "title": "Qualcomm fixes three Adreno GPU zero-days exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/qualcomm-fixes-three-adreno-gpu-zero-days-exploited-in-attacks/",
    "summary": "Qualcomm has released security patches for three zero-day vulnerabilities in the Adreno Graphics Processing Unit (GPU) driver that impact dozens of chipsets and are actively exploited in targeted attacks. [...]",
    "published": "2025-06-02T11:11:14",
    "source": "BleepingComputer"
  },
  {
    "title": "The Secret Defense Strategy of Four Critical Industries Combating Advanced Cyber Threats",
    "link": "https://thehackernews.com/2025/06/the-secret-defense-strategy-of-four.html",
    "summary": "The evolution of cyber threats has forced organizations across all industries to rethink their security strategies. As attackers become more sophisticated — leveraging encryption, living-off-the-land techniques, and lateral movement to evade traditional defenses — security teams are finding more thr",
    "published": "2025-06-02T10:55:00",
    "source": "HackerNews"
  },
  {
    "title": "Fake Recruiter Emails Target CFOs Using Legit NetBird Tool Across 6 Global Regions",
    "link": "https://thehackernews.com/2025/06/fake-recruiter-emails-target-cfos-using.html",
    "summary": "Cybersecurity researchers have warned of a new spear-phishing campaign that uses a legitimate remote access tool called Netbird to target Chief Financial Officers (CFOs) and financial executives at banks, energy companies, insurers, and investment firms across Europe, Africa, Canada, the Middle East",
    "published": "2025-06-02T05:51:00",
    "source": "HackerNews"
  }
]