[
  {
    "title": "Alleged ‘Scattered Spider’ Member Extradited to U.S.",
    "link": "https://krebsonsecurity.com/2025/04/alleged-scattered-spider-member-extradited-to-u-s/",
    "summary": "A 23-year-old Scottish man thought to be a member of the prolific Scattered Spider cybercrime group was extradited last week from Spain to the United States, where he is facing charges of wire fraud, conspiracy and identity theft. U.S. prosecutors allege Tyler Robert Buchanan and co-conspirators hac",
    "published": "2025-04-30T21:54:59",
    "source": "Krebs"
  },
  {
    "title": "WordPress plugin disguised as a security tool injects backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/wordpress-plugin-disguised-as-a-security-tool-injects-backdoor/",
    "summary": "A new malware campaign targeting WordPress sites employs a malicious plugin disguised as a security tool to trick users into installing and trusting it. [...]",
    "published": "2025-04-30T21:05:46",
    "source": "BleepingComputer"
  },
  {
    "title": "WhatsApp unveils 'Private Processing' for cloud-based AI features",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-unveils-private-processing-for-cloud-based-ai-features/",
    "summary": "WhatsApp has announced the introduction of 'Private Processing,' a new technology that enables users to utilize advanced AI features by offloading tasks to privacy-preserving cloud servers. [...]",
    "published": "2025-04-30T19:01:26",
    "source": "BleepingComputer"
  },
  {
    "title": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma100-vpn-vulnerabilities-now-exploited-in-attacks/",
    "summary": "Cybersecurity company SonicWall has warned customers that several vulnerabilities impacting its Secure Mobile Access (SMA) appliances are now being actively exploited in attacks. [...]",
    "published": "2025-04-30T17:23:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Commvault says recent breach didn't impact customer backup data",
    "link": "https://www.bleepingcomputer.com/news/security/commvault-says-recent-breach-didnt-impact-customer-backup-data/",
    "summary": "Commvault, a leading provider of data protection solutions, says a nation-state threat actor who breached its Azure environment didn't gain access to customer backup data. [...]",
    "published": "2025-04-30T16:20:53",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI shares massive list of 42,000 LabHost phishing domains",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-shares-massive-list-of-42-000-labhost-phishing-domains/",
    "summary": "The FBI has shared 42,000 phishing domains tied to the LabHost cybercrime platform, one of the largest global phishing-as-a-service (PhaaS) platforms that was dismantled in April 2024. [...]",
    "published": "2025-04-30T16:01:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Demonstrate How MCP Prompt Injection Can Be Used for Both Attack and Defense",
    "link": "https://thehackernews.com/2025/04/experts-uncover-critical-mcp-and-a2a.html",
    "summary": "As the field of artificial intelligence (AI) continues to evolve at a rapid pace, new research has found how techniques that render the Model Context Protocol (MCP) susceptible to prompt injection attacks could be used to develop security tooling or identify malicious tools, according to a new repor",
    "published": "2025-04-30T15:59:00",
    "source": "HackerNews"
  },
  {
    "title": "UK retailer Co-op shuts down some IT systems after hack attempt",
    "link": "https://www.bleepingcomputer.com/news/security/uk-retailer-co-op-shuts-down-some-it-systems-after-hack-attempt/",
    "summary": "British supermarket chain Co-op Food has confirmed to BleepingComputer via a statement that it has suffered limited operational disruption as it responds to a cyberattack. [...]",
    "published": "2025-04-30T14:12:54",
    "source": "BleepingComputer"
  },
  {
    "title": "Ascension discloses new data breach after third-party hacking incident",
    "link": "https://www.bleepingcomputer.com/news/security/ascension-discloses-new-data-breach-after-third-party-hacking-incident/",
    "summary": "​Ascension, one of the largest private healthcare systems in the United States, is notifying patients that their personal and health information was stolen in a December 2024 data theft attack, which affected a former business partner. [...]",
    "published": "2025-04-30T13:21:31",
    "source": "BleepingComputer"
  },
  {
    "title": "[Free Webinar] Guide to Securing Your Entire Identity Lifecycle Against AI-Powered Threats",
    "link": "https://thehackernews.com/2025/04/free-webinar-guide-to-securing-your.html",
    "summary": "How Many Gaps Are Hiding in Your Identity System? It’s not just about logins anymore.\nToday’s attackers don’t need to “hack” in—they can trick their way in. Deepfakes, impersonation scams, and AI-powered social engineering are helping them bypass traditional defenses and slip through unnoticed. Once",
    "published": "2025-04-30T11:26:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hackers Abuse IPv6 SLAAC for AitM Attacks via Spellbinder Lateral Movement Tool",
    "link": "https://thehackernews.com/2025/04/chinese-hackers-abuse-ipv6-slaac-for.html",
    "summary": "A China-aligned advanced persistent threat (APT) group called TheWizards has been linked to a lateral movement tool called Spellbinder that can facilitate adversary-in-the-middle (AitM) attacks.\n\"Spellbinder enables adversary-in-the-middle (AitM) attacks, through IPv6 stateless address autoconfigura",
    "published": "2025-04-30T11:05:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-24h2-updates-fail-with-0x80240069-errors/",
    "summary": "Microsoft has confirmed that Windows 11 24H2 feature updates via Windows Server Update Services (WSUS) are being blocked after installing the April 2025 security updates. [...]",
    "published": "2025-04-30T10:45:32",
    "source": "BleepingComputer"
  },
  {
    "title": "Customer Account Takeovers: The Multi-Billion Dollar Problem You Don’t Know About",
    "link": "https://thehackernews.com/2025/04/customer-account-takeovers-multi.html",
    "summary": "Everyone has cybersecurity stories involving family members. Here’s a relatively common one. The conversation usually goes something like this:&nbsp;\n“The strangest thing happened to my streaming account. I got locked out of my account, so I had to change my password. When I logged back in, all my s",
    "published": "2025-04-30T10:24:00",
    "source": "HackerNews"
  }
]