[
  {
    "title": "ChatGPT prepares o3-pro model for $200 Pro subscribers",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-prepares-o3-pro-model-for-200-pro-subscribers/",
    "summary": "OpenAI is planning to ship an update to ChatGPT that will turn on the new o3 Pro model, which has more compute to think harder. [...]",
    "published": "2025-06-05T22:45:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Proxy Services Feast on Ukraine’s IP Address Exodus",
    "link": "https://krebsonsecurity.com/2025/06/proxy-services-feast-on-ukraines-ip-address-exodus/",
    "summary": "Ukraine has seen nearly one-fifth of its Internet space come under Russian control or sold to Internet address brokers since February 2022, a new study finds. The analysis indicates large chunks of Ukrainian Internet address space are now in the hands of proxy and anonymity services nested at some o",
    "published": "2025-06-05T22:44:33",
    "source": "Krebs"
  },
  {
    "title": "FBI: BADBOX 2.0 Android malware infects millions of consumer devices",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-badbox-20-android-malware-infects-millions-of-consumer-devices/",
    "summary": "The FBI is warning that the BADBOX 2.0 malware campaign has infected over 1 million home Internet-connected devices, converting consumer electronics into residential proxies that are used for malicious activity. [...]",
    "published": "2025-06-05T21:35:43",
    "source": "BleepingComputer"
  },
  {
    "title": "Old AT&T data leak repackaged to link SSNs, DOBs to 49M phone numbers",
    "link": "https://www.bleepingcomputer.com/news/security/old-atandt-data-leak-repackaged-to-link-ssns-dobs-to-49m-phone-numbers/",
    "summary": "A threat actor has re-released data from a 2021 AT&amp;T breach affecting 70 million customers, this time combining previously separate files to directly link Social Security numbers and birth dates to individual users. [...]",
    "published": "2025-06-05T17:21:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Hacker selling critical Roundcube webmail exploit as tech info disclosed",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-selling-critical-roundcube-webmail-exploit-as-tech-info-disclosed/",
    "summary": "Hackers are actively exploiting CVE-2025-49113, a critical vulnerability in the widely used Roundcube open-source webmail application that allows remote execution. [...]",
    "published": "2025-06-05T16:55:54",
    "source": "BleepingComputer"
  },
  {
    "title": "Popular Chrome Extensions Leak API Keys, User Data via HTTP and Hardcoded Credentials",
    "link": "https://thehackernews.com/2025/06/popular-chrome-extensions-leak-api-keys.html",
    "summary": "Cybersecurity researchers have flagged several popular Google Chrome extensions that have been found to transmit data in HTTP and hard-code secrets in their code, exposing users to privacy and security risks.\n\n\"Several widely used extensions [...] unintentionally transmit sensitive data over simple ",
    "published": "2025-06-05T15:53:00",
    "source": "HackerNews"
  },
  {
    "title": "Designing a Windows Service for Security",
    "link": "https://www.bleepingcomputer.com/news/security/designing-a-windows-service-for-security/",
    "summary": "Designing a security-focused Windows Service? Learn more from ThreatLocker about the core components for real-time monitoring, threat detection, and system hardening to defend against malware and ransomware. [...]",
    "published": "2025-06-05T14:20:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Detail Bitter APT’s Evolving Tactics as Its Geographic Scope Expands",
    "link": "https://thehackernews.com/2025/06/bitter-hacker-group-expands-cyber.html",
    "summary": "The threat actor known as Bitter has been assessed to be a state-backed hacking group that's tasked with gathering intelligence that aligns with the interests of the Indian government.\nThat's according to new findings jointly published by Proofpoint and Threatray in an exhaustive two-part analysis.\n",
    "published": "2025-06-05T13:53:00",
    "source": "HackerNews"
  },
  {
    "title": "Germany fines Vodafone $51 million for privacy, security breaches",
    "link": "https://www.bleepingcomputer.com/news/security/germany-fines-vodafone-51-million-for-privacy-security-breaches/",
    "summary": "The German data protection authority (BfDI) has fined Vodafone GmbH, the telecommunications company's German subsidiary, €45 million ($51.4 million) for privacy and security violations. [...]",
    "published": "2025-06-05T11:29:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Redefining Cyber Value: Why Business Impact Should Lead the Security Conversation",
    "link": "https://thehackernews.com/2025/06/redefining-cyber-value-why-business.html",
    "summary": "Security teams face growing demands with more tools, more data, and higher expectations than ever. Boards approve large security budgets, yet still ask the same question: what is the business getting in return? CISOs respond with reports on controls and vulnerability counts – but executives want to ",
    "published": "2025-06-05T11:25:00",
    "source": "HackerNews"
  }
]