[
  {
    "title": "Anubis Ransomware Encrypts and Wipes Files, Making Recovery Impossible Even After Payment",
    "link": "https://thehackernews.com/2025/06/anubis-ransomware-encrypts-and-wipes.html",
    "summary": "An emerging ransomware strain has been discovered incorporating capabilities to encrypt files as well as permanently erase them, a development that has been described as a \"rare dual-threat.\"\n\"The ransomware features a 'wipe mode,' which permanently erases files, rendering recovery impossible even i",
    "published": "2025-06-16T14:21:00",
    "source": "HackerNews"
  },
  {
    "title": "Zoomcar discloses security breach impacting 8.4 million users",
    "link": "https://www.bleepingcomputer.com/news/security/zoomcar-discloses-security-breach-impacting-84-million-users/",
    "summary": "Zoomcar Holdings (Zoomcar) has disclosed via an 8-K form filing with the U.S. Securities and Exchange Commission (SEC) a data breach incident impacting 8.4 million users. [...]",
    "published": "2025-06-16T14:13:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft shares temp fix for Outlook crashes when opening emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-workaround-for-classic-outlook-crashes/",
    "summary": "Microsoft has shared a workaround for a known issue that causes the classic Outlook email client to crash when opening or starting a new message. [...]",
    "published": "2025-06-16T12:23:55",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: iPhone Spyware, Microsoft 0-Day, TokenBreak Hack, AI Data Leaks and More",
    "link": "https://thehackernews.com/2025/06/weekly-recap-iphone-spyware-microsoft-0.html",
    "summary": "Some of the biggest security problems start quietly. No alerts. No warnings. Just small actions that seem normal but aren't. Attackers now know how to stay hidden by blending in, and that makes it hard to tell when something’s wrong.\nThis week’s stories aren’t just about what was attacked—but how ea",
    "published": "2025-06-16T11:29:00",
    "source": "HackerNews"
  },
  {
    "title": "Playbook: Transforming Your Cybersecurity Practice Into An MRR Machine",
    "link": "https://thehackernews.com/2025/06/playbook-transforming-your.html",
    "summary": "Introduction\nThe cybersecurity landscape is evolving rapidly, and so are the cyber needs of organizations worldwide. While businesses face mounting pressure from regulators, insurers, and rising threats, many still treat cybersecurity as an afterthought. As a result, providers may struggle to move b",
    "published": "2025-06-16T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Police seizes Archetyp Market drug marketplace, arrests admin",
    "link": "https://www.bleepingcomputer.com/news/security/police-seizes-archetyp-market-drug-marketplace-arrests-admin/",
    "summary": "Law enforcement authorities from six countries took down the Archetyp Market, an infamous darknet drug marketplace that has been operating since May 2020. [...]",
    "published": "2025-06-16T11:15:52",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft: June Windows Server security updates cause DHCP issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-june-windows-server-security-updates-cause-dhcp-issues/",
    "summary": "Microsoft acknowledged a new issue caused by the June 2025 security updates, causing the DHCP service to freeze on some Windows Server systems. [...]",
    "published": "2025-06-16T09:35:49",
    "source": "BleepingComputer"
  },
  {
    "title": "PyPI, npm, and AI Tools Exploited in Malware Surge Targeting DevOps and Cloud Environments",
    "link": "https://thehackernews.com/2025/06/malicious-pypi-package-masquerades-as.html",
    "summary": "Cybersecurity researchers from&nbsp;SafeDep and Veracode detailed a number of malware-laced npm packages that are designed to execute remote code and download additional payloads.\nThe packages in question are listed below -\n\neslint-config-airbnb-compat (676 Downloads)\nts-runtime-compat-check (1,588 ",
    "published": "2025-06-16T06:45:00",
    "source": "HackerNews"
  }
]