[
  {
    "title": "Germany takes down eXch cryptocurrency exchange, seizes servers",
    "link": "https://www.bleepingcomputer.com/news/security/germany-takes-down-exch-cryptocurrency-exchange-seizes-servers/",
    "summary": "The Federal police in Germany (BKA) seized the server infrastructure and shut down the 'eXch' cryptocurrency exchange platform for alleged money laundering cybercrime proceeds. [...]",
    "published": "2025-05-09T15:07:24",
    "source": "BleepingComputer"
  },
  {
    "title": "Initial Access Brokers Target Brazil Execs via NF-e Spam and Legit RMM Trials",
    "link": "https://thehackernews.com/2025/05/initial-access-brokers-target-brazil.html",
    "summary": "Cybersecurity researchers are warning of a new campaign that's targeting Portuguese-speaking users in Brazil with trial versions of commercial remote monitoring and management (RMM) software since January 2025.\n\"The spam message uses the Brazilian electronic invoice system, NF-e, as a lure to entice",
    "published": "2025-05-09T11:40:00",
    "source": "HackerNews"
  },
  {
    "title": "Deploying AI Agents? Learn to Secure Them Before Hackers Strike Your Business",
    "link": "https://thehackernews.com/2025/05/deploying-ai-agents-learn-to-secure.html",
    "summary": "AI agents are changing the way businesses work. They can answer questions, automate tasks, and create better user experiences. But with this power comes new risks — like data leaks, identity theft, and malicious misuse.\nIf your company is exploring or already using AI agents, you need to ask:&nbsp;A",
    "published": "2025-05-09T11:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Beyond Vulnerability Management – Can You CVE What I CVE?",
    "link": "https://thehackernews.com/2025/05/beyond-vulnerability-management-cves.html",
    "summary": "The Vulnerability Treadmill\nThe reactive nature of vulnerability management, combined with delays from policy and process, strains security teams. Capacity is limited and patching everything immediately is a struggle. Our Vulnerability Operation Center (VOC) dataset analysis identified 1,337,797 uni",
    "published": "2025-05-09T10:57:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious npm Packages Infect 3,200+ Cursor Users With Backdoor, Steal Credentials",
    "link": "https://thehackernews.com/2025/05/malicious-npm-packages-infect-3200.html",
    "summary": "Cybersecurity researchers have flagged three malicious npm packages that are designed to target the Apple macOS version of Cursor, a popular artificial intelligence (AI)-powered source code editor.\n\"Disguised as developer tools offering 'the cheapest Cursor API,' these packages steal user credential",
    "published": "2025-05-09T10:57:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Rolls Out On-Device AI Protections to Detect Scams in Chrome and Android",
    "link": "https://thehackernews.com/2025/05/google-rolls-out-on-device-ai.html",
    "summary": "Google on Thursday announced it's rolling out new artificial intelligence (AI)-powered countermeasures to combat scams across Chrome, Search, and Android.\nThe tech giant said it will begin using Gemini Nano, its on-device large language model (LLM), to improve Safe Browsing in Chrome 137 on desktops",
    "published": "2025-05-09T07:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hackers Exploit SAP RCE Flaw CVE-2025-31324, Deploy Golang-Based SuperShell",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-sap-rce-flaw.html",
    "summary": "A China-linked unnamed threat actor dubbed Chaya_004 has been observed exploiting a recently disclosed security flaw in SAP NetWeaver.\nForescout Vedere Labs, in a report published Thursday, said it uncovered a malicious infrastructure likely associated with the hacking group weaponizing CVE-2025-313",
    "published": "2025-05-09T04:29:00",
    "source": "HackerNews"
  }
]