[
  {
    "title": "FBI seeks help to unmask Salt Typhoon hackers behind telecom breaches",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-seeks-help-to-unmask-salt-typhoon-hackers-behind-telecom-breaches/",
    "summary": "The FBI has asked the public for information on Chinese Salt Typhoon hackers behind widespread breaches of telecommunications providers in the United States and worldwide. [...]",
    "published": "2025-04-25T09:34:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Identify Rack::Static Vulnerability Enabling Data Breaches in Ruby Servers",
    "link": "https://thehackernews.com/2025/04/researchers-identify-rackstatic.html",
    "summary": "Cybersecurity researchers have disclosed three security flaws in the Rack Ruby web server interface that, if successfully exploited, could enable attackers to gain unauthorized access to files, inject malicious data, and tamper with logs under certain conditions.\nThe vulnerabilities, flagged by cybe",
    "published": "2025-04-25T08:57:00",
    "source": "HackerNews"
  },
  {
    "title": "DslogdRAT Malware Deployed via Ivanti ICS Zero-Day CVE-2025-0282 in Japan Attacks",
    "link": "https://thehackernews.com/2025/04/dslogdrat-malware-deployed-via-ivanti.html",
    "summary": "Cybersecurity researchers are warning about a new malware called DslogdRAT that's installed following the exploitation of a now-patched security flaw in Ivanti Connect Secure (ICS).\nThe malware, along with a web shell, were \"installed by exploiting a zero-day vulnerability at that time, CVE-2025-028",
    "published": "2025-04-25T08:43:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft announces fix for CPU spikes when typing in Outlook",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-announces-fix-for-cpu-spikes-when-typing-in-outlook/",
    "summary": "Microsoft says it will soon fix a known issue causing CPU spikes when typing messages in recent versions of its classic Outlook email client. [...]",
    "published": "2025-04-25T08:10:47",
    "source": "BleepingComputer"
  }
]