[
  {
    "title": "UK launches vulnerability research program for external experts",
    "link": "https://www.bleepingcomputer.com/news/security/uk-launches-vulnerability-research-program-for-external-experts/",
    "summary": "UK's National Cyber Security Centre (NCSC) has announced a new Vulnerability Research Initiative (VRI) that aims to strengthen relations with external cybersecurity experts. [...]",
    "published": "2025-07-14T20:21:22",
    "source": "BleepingComputer"
  },
  {
    "title": "Interlock ransomware adopts FileFix method to deliver malware",
    "link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-adopts-filefix-method-to-deliver-malware/",
    "summary": "Hackers have adopted the new technique called 'FileFix' in Interlock ransomware attacks to drop a remote access trojan (RAT) on targeted systems. [...]",
    "published": "2025-07-14T18:36:30",
    "source": "BleepingComputer"
  },
  {
    "title": "The Unusual Suspect: Git Repos",
    "link": "https://thehackernews.com/2025/07/the-unusual-suspect-git-repos.html",
    "summary": "While phishing and ransomware dominate headlines, another critical risk quietly persists across most enterprises: exposed Git repositories leaking sensitive data. A risk that silently creates shadow access into core systems\nGit is the backbone of modern software development, hosting millions of repo",
    "published": "2025-07-14T17:06:00",
    "source": "HackerNews"
  },
  {
    "title": "New PHP-Based Interlock RAT Variant Uses FileFix Delivery Mechanism to Target Multiple Industries",
    "link": "https://thehackernews.com/2025/07/new-php-based-interlock-rat-variant.html",
    "summary": "Threat actors behind the Interlock ransomware group have unleashed a new PHP variant of its bespoke remote access trojan (RAT) as part of a widespread campaign using a variant of ClickFix called FileFix.\n\"Since May 2025, activity related to the Interlock RAT has been observed in connection with the ",
    "published": "2025-07-14T16:52:00",
    "source": "HackerNews"
  },
  {
    "title": "Gigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot",
    "link": "https://www.bleepingcomputer.com/news/security/gigabyte-motherboards-vulnerable-to-uefi-malware-bypassing-secure-boot/",
    "summary": "Dozens of Gigabyte motherboard models run on UEFI firmware vulnerable to security issues that allow planting bootkit malware that is invisible to the operating system and can survive reinstalls. [...]",
    "published": "2025-07-14T16:30:32",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: Scattered Spider Arrests, Car Exploits, macOS Malware, Fortinet RCE and More",
    "link": "https://thehackernews.com/2025/07/weekly-recap-scattered-spider-arrests.html",
    "summary": "In cybersecurity, precision matters—and there’s little room for error. A small mistake, missed setting, or quiet misconfiguration can quickly lead to much bigger problems. The signs we’re seeing this week highlight deeper issues behind what might look like routine incidents: outdated tools, slow res",
    "published": "2025-07-14T12:52:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious VSCode extension in Cursor IDE led to $500K crypto theft",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-vscode-extension-in-cursor-ide-led-to-500k-crypto-theft/",
    "summary": "A fake extension for the Cursor AI IDE code editor infected devices with remote access tools and infostealers, which, in one case, led to the theft of $500,000 in cryptocurrency from a Russian crypto developer. [...]",
    "published": "2025-07-14T12:26:34",
    "source": "BleepingComputer"
  }
]