[
  {
    "title": "Trend Micro fixes critical vulnerabilities in multiple products",
    "link": "https://www.bleepingcomputer.com/news/security/trend-micro-fixes-six-critical-flaws-on-apex-central-endpoint-encryption-policyserver/",
    "summary": "Trend Micro has released security updates to address multiple critical-severity remote code execution and authentication bypass vulnerabilities that impact its Apex Central and Endpoint Encryption (TMEE) PolicyServer products. [...]",
    "published": "2025-06-12T19:31:54",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Cloud and Cloudflare hit by widespread service outages",
    "link": "https://www.bleepingcomputer.com/news/technology/google-cloud-and-cloudflare-hit-by-widespread-service-outages/",
    "summary": "Google Cloud and Cloudflare are investigating ongoing outages impacting access to sites and various services across multiple regions. [...]",
    "published": "2025-06-12T19:04:22",
    "source": "BleepingComputer"
  },
  {
    "title": "WordPress Sites Turned Weapon: How VexTrio and Affiliates Run a Global Scam Network",
    "link": "https://thehackernews.com/2025/06/wordpress-sites-turned-weapon-how.html",
    "summary": "The threat actors behind the VexTrio Viper Traffic Distribution Service (TDS) have been linked to other TDS services like Help TDS and Disposable TDS, indicating that the sophisticated cybercriminal operation is a sprawling enterprise of its own that's designed to distribute malicious content.\n\"VexT",
    "published": "2025-06-12T17:47:00",
    "source": "HackerNews"
  },
  {
    "title": "Graphite spyware used in Apple iOS zero-click attacks on journalists",
    "link": "https://www.bleepingcomputer.com/news/security/graphite-spyware-used-in-apple-ios-zero-click-attacks-on-journalists/",
    "summary": "Forensic investigation has confirmed the use of Paragon's Graphite spyware platform in zero-click attacks that targeted Apple iOS devices of at least two journalists in Europe. [...]",
    "published": "2025-06-12T17:42:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Password-spraying attacks target 80,000 Microsoft Entra ID accounts",
    "link": "https://www.bleepingcomputer.com/news/security/password-spraying-attacks-target-80-000-microsoft-entra-id-accounts/",
    "summary": "Hackers have been using the TeamFiltration pentesting framework to target more than 80,000 Microsoft Entra ID accounts at hundreds of organizations worldwide. [...]",
    "published": "2025-06-12T14:40:25",
    "source": "BleepingComputer"
  },
  {
    "title": "New TokenBreak Attack Bypasses AI Moderation with Single-Character Text Changes",
    "link": "https://thehackernews.com/2025/06/new-tokenbreak-attack-bypasses-ai.html",
    "summary": "Cybersecurity researchers have discovered a novel attack technique called TokenBreak that can be used to bypass a large language model's (LLM) safety and content moderation guardrails with just a single character change.\n\"The TokenBreak attack targets a text classification model's tokenization strat",
    "published": "2025-06-12T13:52:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Edge now offers secure password deployment for businesses",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-edge-now-offers-secure-password-deployment-for-businesses/",
    "summary": "Microsoft announced that a new Edge feature allowing employees to share passwords more securely in enterprise environments has reached general availability. [...]",
    "published": "2025-06-12T13:20:31",
    "source": "BleepingComputer"
  },
  {
    "title": "AI Agents Run on Secret Accounts — Learn How to Secure Them in This Webinar",
    "link": "https://thehackernews.com/2025/06/ai-agents-run-on-secret-accounts-learn.html",
    "summary": "AI is changing everything — from how we code, to how we sell, to how we secure. But while most conversations focus on what AI can do, this one focuses on what AI can break — if you’re not paying attention.\nBehind every AI agent, chatbot, or automation script lies a growing number of non-human identi",
    "published": "2025-06-12T13:06:00",
    "source": "HackerNews"
  },
  {
    "title": "GitLab patches high severity account takeover, missing auth issues",
    "link": "https://www.bleepingcomputer.com/news/security/gitlab-patches-high-severity-account-takeover-missing-auth-issues/",
    "summary": "GitLab has released security updates to address multiple vulnerabilities in the company's DevSecOps platform, including ones enabling attackers to take over accounts and inject malicious jobs in future pipelines. [...]",
    "published": "2025-06-12T12:26:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Zero-Click AI Vulnerability Exposes Microsoft 365 Copilot Data Without User Interaction",
    "link": "https://thehackernews.com/2025/06/zero-click-ai-vulnerability-exposes.html",
    "summary": "A novel attack technique named EchoLeak has been characterized as a \"zero-click\" artificial intelligence (AI) vulnerability that allows bad actors to exfiltrate sensitive data from Microsoft 365 Copilot's context sans any user interaction.\nThe critical-rated vulnerability has been assigned the CVE i",
    "published": "2025-06-12T11:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Non-Human Identities: How to Address the Expanding Security Risk",
    "link": "https://thehackernews.com/2025/06/non-human-identities-how-to-address.html",
    "summary": "Human identities management and control is pretty well done with its set of dedicated tools, frameworks, and best practices. This is a very different world when it comes to Non-human identities also referred to as machine identities. GitGuardian’s end-to-end NHI security platform is here to close th",
    "published": "2025-06-12T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-24h2-emergency-update-fixes-easy-anti-cheat-bsod-issue/",
    "summary": "Microsoft has released an emergency Windows 11 24H2 update to address an incompatibility issue triggering restarts with blue screen of death (BSOD) errors on systems with Easy Anti-Cheat. [...]",
    "published": "2025-06-12T10:43:04",
    "source": "BleepingComputer"
  },
  {
    "title": "Fog ransomware attack uses unusual mix of legitimate and open-source tools",
    "link": "https://www.bleepingcomputer.com/news/security/fog-ransomware-attack-uses-unusual-mix-of-legitimate-and-open-source-tools/",
    "summary": "Fog ransomware hackers are using an uncommon toolset, which includes open-source pentesting utilities and a legitimate employee monitoring software called Syteca. [...]",
    "published": "2025-06-12T09:45:14",
    "source": "BleepingComputer"
  }
]