[
  {
    "title": "CISA Adds Erlang SSH and Roundcube Flaws to Known Exploited Vulnerabilities Catalog",
    "link": "https://thehackernews.com/2025/06/cisa-adds-erlang-ssh-and-roundcube.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added two critical security flaws impacting Erlang/Open Telecom Platform (OTP) SSH and Roundcube to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question ",
    "published": "2025-06-10T05:37:00",
    "source": "HackerNews"
  },
  {
    "title": "Stolen Ticketmaster data from Snowflake attacks briefly for sale again",
    "link": "https://www.bleepingcomputer.com/news/security/stolen-ticketmaster-data-from-snowflake-attacks-briefly-for-sale-again/",
    "summary": "The Arkana Security extortion gang briefly listed over the weekend what appeared to be newly stolen Ticketmaster data but is instead the data stolen during the 2024 Snowflake data theft attacks. [...]",
    "published": "2025-06-09T22:31:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 84,000 Roundcube instances vulnerable to actively exploited flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-84-000-roundcube-instances-vulnerable-to-actively-exploited-flaw/",
    "summary": "Over 84,000 instances of the Roundcube webmail software are vulnerable to CVE-2025-49113, a critical remote code execution (RCE) vulnerability with a publicly available exploit. [...]",
    "published": "2025-06-09T20:14:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Google patched bug leaking phone numbers tied to accounts",
    "link": "https://www.bleepingcomputer.com/news/security/google-patched-bug-leaking-phone-numbers-tied-to-accounts/",
    "summary": "A vulnerability allowed researchers to brute-force any Google account's recovery phone number simply by knowing a their profile name and an easily retrieved partial phone number, creating a massive risk for phishing and SIM-swapping attacks. [...]",
    "published": "2025-06-09T19:36:39",
    "source": "BleepingComputer"
  }
]