[
  {
    "title": "Patch Tuesday, June 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/06/patch-tuesday-june-2025-edition/",
    "summary": "Microsoft today released security updates to fix at least 67 vulnerabilities in its Windows operating systems and software. Redmond warns that one of the flaws is already under active attack, and that software blueprints showing how to exploit a pervasive Windows bug patched this month are now publi",
    "published": "2025-06-11T00:10:53",
    "source": "Krebs"
  },
  {
    "title": "DanaBot malware operators exposed via C2 bug added in 2022",
    "link": "https://www.bleepingcomputer.com/news/security/danabot-malware-operators-exposed-via-c2-bug-added-in-2022/",
    "summary": "A vulnerability in the DanaBot malware operation introduced in June 2022 update led to the identification, indictment, and dismantling of their operations in a recent law enforcement action. [...]",
    "published": "2025-06-10T21:46:49",
    "source": "BleepingComputer"
  },
  {
    "title": "ConnectWise rotating code signing certificates over security concerns",
    "link": "https://www.bleepingcomputer.com/news/security/connectwise-rotating-code-signing-certificates-over-security-concerns/",
    "summary": "ConnectWise is warning customers that it is rotating the digital code signing certificates used to sign ScreenConnect, ConnectWise Automate, and ConnectWise RMM executables over security concerns. [...]",
    "published": "2025-06-10T21:17:53",
    "source": "BleepingComputer"
  },
  {
    "title": "New Secure Boot flaw lets attackers install bootkit malware, patch now",
    "link": "https://www.bleepingcomputer.com/news/security/new-secure-boot-flaw-lets-attackers-install-bootkit-malware-patch-now/",
    "summary": "Security researchers have disclosed a new Secure Boot bypass tracked as CVE-2025-3052 that can be used to turn off security on PCs and servers and install bootkit malware. [...]",
    "published": "2025-06-10T20:02:19",
    "source": "BleepingComputer"
  },
  {
    "title": "Adobe Releases Patch Fixing 254 Vulnerabilities, Closing High-Severity Security Gaps",
    "link": "https://thehackernews.com/2025/06/adobe-releases-patch-fixing-254.html",
    "summary": "Adobe on Tuesday pushed security updates to address a total of 254 security flaws impacting its software products, a majority of which affect Experience Manager (AEM).\nOf the 254 flaws, 225 reside in AEM, impacting AEM Cloud Service (CS) as well as all versions prior to and including 6.5.22. The iss",
    "published": "2025-06-10T18:29:00",
    "source": "HackerNews"
  },
  {
    "title": "Researchers Uncover 20+ Configuration Risks, Including Five CVEs, in Salesforce Industry Cloud",
    "link": "https://thehackernews.com/2025/06/researchers-uncover-20-configuration.html",
    "summary": "Cybersecurity researchers have uncovered over 20 configuration-related risks affecting Salesforce Industry Cloud (aka Salesforce Industries), exposing sensitive data to unauthorized internal and external parties.\nThe weaknesses affect various components like FlexCards, Data Mappers, Integration Proc",
    "published": "2025-06-10T18:04:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 10 KB5060533 cumulative update released with 7 changes, fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5060533-cumulative-update-released-with-7-changes-fixes/",
    "summary": "Microsoft has released the KB5060533 cumulative update for Windows 10 22H2 and Windows 10 21H2, with seven fixes or changes, including bringing seconds back to the time shown in the Calendar flyout. [...]",
    "published": "2025-06-10T18:03:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-june-2025-patch-tuesday-fixes-exploited-zero-day-66-flaws/",
    "summary": "Today is Microsoft's June 2025 Patch Tuesday, which includes security updates for 66 flaws, including one actively exploited vulnerability and another that was publicly disclosed. [...]",
    "published": "2025-06-10T17:37:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 KB5060842 and KB5060999 cumulative updates released",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5060842-and-kb5060999-cumulative-updates-released/",
    "summary": "Microsoft has released Windows 11 KB5060842 and KB5060999 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues, including 66 flaws. [...]",
    "published": "2025-06-10T17:32:44",
    "source": "BleepingComputer"
  }
]