[
  {
    "title": "Over 1,000 SOHO Devices Hacked in China-linked LapDogs Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2025/06/over-1000-soho-devices-hacked-in-china.html",
    "summary": "Threat hunters have discovered a network of more than 1,000 compromised small office and home office (SOHO) devices that have been used to facilitate a prolonged cyber espionage infrastructure campaign for China-nexus hacking groups.\nThe Operational Relay Box (ORB) network has been codenamed LapDogs",
    "published": "2025-06-27T15:58:00",
    "source": "HackerNews"
  },
  {
    "title": "Russia’s throttling of Cloudflare makes sites inaccessible",
    "link": "https://www.bleepingcomputer.com/news/technology/russias-throttling-of-cloudflare-makes-sites-inaccessible/",
    "summary": "Starting June 9, 2025, Russian internet service providers (ISPs) have begun throttling access to websites and services protected by Cloudflare, an American internet giant. [...]",
    "published": "2025-06-27T15:47:15",
    "source": "BleepingComputer"
  },
  {
    "title": "Citrix Bleed 2 flaw now believed to be exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-bleed-2-flaw-now-believed-to-be-exploited-in-attacks/",
    "summary": "A critical NetScaler ADC and Gateway vulnerability dubbed \"Citrix Bleed 2\" (CVE-2025-5777) is now likely exploited in attacks, according to cybersecurity firm ReliaQuest, seeing an increase in suspicious sessions on Citrix devices. [...]",
    "published": "2025-06-27T14:18:09",
    "source": "BleepingComputer"
  },
  {
    "title": "PUBLOAD and Pubshell Malware Used in Mustang Panda's Tibet-Specific Attack",
    "link": "https://thehackernews.com/2025/06/pubload-and-pubshell-malware-used-in.html",
    "summary": "A China-linked threat actor known as Mustang Panda has been attributed to a new cyber espionage campaign directed against the Tibetan community.\nThe spear-phishing attacks leveraged topics related to Tibet, such as the 9th World Parliamentarians' Convention on Tibet (WPCT), China's education policy ",
    "published": "2025-06-27T13:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Business Case for Agentic AI SOC Analysts",
    "link": "https://thehackernews.com/2025/06/business-case-for-agentic-ai-soc.html",
    "summary": "Security operations centers (SOCs) are under pressure from both sides: threats are growing more complex and frequent, while security budgets are no longer keeping pace. Today’s security leaders are expected to reduce risk and deliver results without relying on larger teams or increased spending.\nAt ",
    "published": "2025-06-27T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Group Silver Fox Uses Fake Websites to Deliver Sainbox RAT and Hidden Rootkit",
    "link": "https://thehackernews.com/2025/06/chinese-group-silver-fox-uses-fake.html",
    "summary": "A new campaign has been observed leveraging fake websites advertising popular software such as WPS Office, Sogou, and DeepSeek to deliver Sainbox RAT and the open-source Hidden rootkit.\nThe activity has been attributed with medium confidence to a Chinese hacking group called Silver Fox (aka Void Ara",
    "published": "2025-06-27T10:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Retail giant Ahold Delhaize says data breach affects 2.2 million people",
    "link": "https://www.bleepingcomputer.com/news/security/retail-giant-ahold-delhaize-says-data-breach-affects-22-million-people/",
    "summary": "Ahold Delhaize, one of the world's largest food retail chains, is notifying over 2.2 million individuals that their personal, financial, and health information was stolen in a November ransomware attack that impacted its U.S. systems. [...]",
    "published": "2025-06-27T09:12:43",
    "source": "BleepingComputer"
  },
  {
    "title": "MOVEit Transfer Faces Increased Threats as Scanning Surges and CVE Flaws Are Targeted",
    "link": "https://thehackernews.com/2025/06/moveit-transfer-faces-increased-threats.html",
    "summary": "Threat intelligence firm GreyNoise is warning of a \"notable surge\" in scanning activity targeting Progress MOVEit Transfer systems starting May 27, 2025—suggesting that attackers may be preparing for another mass exploitation campaign or probing for unpatched systems.MOVEit Transfer is a popular man",
    "published": "2025-06-27T07:43:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 11 KB5060829 update released with 38 new changes, fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5060829-update-released-with-38-new-changes-fixes/",
    "summary": "​​Microsoft has released the KB5060829 preview cumulative update for Windows 11 24H2, which includes 38 changes, including improvements to the taskbar and a new PC-to-PC migration experience. [...]",
    "published": "2025-06-27T07:28:59",
    "source": "BleepingComputer"
  },
  {
    "title": "OneClik Malware Targets Energy Sector Using Microsoft ClickOnce and Golang Backdoors",
    "link": "https://thehackernews.com/2025/06/oneclik-malware-targets-energy-sector.html",
    "summary": "Cybersecurity researchers have detailed a new campaign dubbed OneClik that leverages Microsoft's ClickOnce software deployment technology and bespoke Golang backdoors to compromise organizations within the energy, oil, and gas sectors.\n\"The campaign exhibits characteristics aligned with Chinese-affi",
    "published": "2025-06-27T06:31:00",
    "source": "HackerNews"
  },
  {
    "title": "Whole Foods supplier UNFI restores core systems after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/whole-foods-supplier-unfi-restores-core-systems-after-cyberattack/",
    "summary": "American grocery wholesale giant United Natural Foods (UNFI) reports that it has restored its core systems and brought online the electronic ordering and invoicing systems affected by a cyberattack. [...]",
    "published": "2025-06-27T06:21:49",
    "source": "BleepingComputer"
  }
]