[
  {
    "title": "SEO Poisoning Campaign Targets 8,500+ SMB Users with Malware Disguised as AI Tools",
    "link": "https://thehackernews.com/2025/07/seo-poisoning-campaign-targets-8500.html",
    "summary": "Cybersecurity researchers have disclosed a malicious campaign that leverages search engine optimization (SEO) poisoning techniques to deliver a known malware loader called Oyster (aka Broomstick or CleanUpLoader).\nThe malvertising activity, per Arctic Wolf, promotes fake websites hosting trojanized ",
    "published": "2025-07-07T17:26:00",
    "source": "HackerNews"
  },
  {
    "title": "Qantas is being extorted in recent data-theft cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/qantas-is-being-extorted-in-recent-data-theft-cyberattack/",
    "summary": "Qantas has confirmed that it is now being extorted by threat actors following a cyberattack that potentially exposed the data for 6 million customers. [...]",
    "published": "2025-07-07T17:02:02",
    "source": "BleepingComputer"
  },
  {
    "title": "'Batavia' Windows spyware campaign targets dozens of Russian orgs",
    "link": "https://www.bleepingcomputer.com/news/security/batavia-windows-spyware-campaign-targets-dozens-of-russian-orgs/",
    "summary": "A previously undocumented spyware called 'Batavia' has been targeting large industrial enterprises in Russia in a phishing email campaign that uses contract-related lures. [...]",
    "published": "2025-07-07T16:48:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers abuse leaked Shellter red team tool to deploy infostealers",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-abuse-leaked-shellter-red-team-tool-to-deploy-infostealers/",
    "summary": "Shellter Project, the vendor of a commercial AV/EDR evasion loader for penetration testing, confirmed that hackers used its Shellter Elite product in attacks after a customer leaked a copy of the software. [...]",
    "published": "2025-07-07T14:49:27",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: Chrome 0-Day, Ivanti Exploits, MacOS Stealers, Crypto Heists and More",
    "link": "https://thehackernews.com/2025/07/weekly-recap-chrome-0-day-ivanti.html",
    "summary": "Everything feels secure—until one small thing slips through. Even strong systems can break if a simple check is missed or a trusted tool is misused. Most threats don’t start with alarms—they sneak in through the little things we overlook. A tiny bug, a reused password, a quiet connection—that’s all ",
    "published": "2025-07-07T11:26:00",
    "source": "HackerNews"
  },
  {
    "title": "Manufacturing Security: Why Default Passwords Must Go",
    "link": "https://thehackernews.com/2025/07/manufacturing-security-why-default.html",
    "summary": "If you didn't hear about&nbsp;Iranian hackers breaching US water facilities, it's because they only managed to control a single pressure station serving 7,000 people. What made this attack noteworthy wasn't its scale, but how easily the hackers gained access &mdash; by simply using the manufacturer'",
    "published": "2025-07-07T11:00:00",
    "source": "HackerNews"
  }
]