[
  {
    "title": "New Malware Campaign Uses Cloudflare Tunnels to Deliver RATs via Phishing Chains",
    "link": "https://thehackernews.com/2025/06/new-malware-campaign-uses-cloudflare.html",
    "summary": "A new campaign is making use of Cloudflare Tunnel subdomains to host malicious payloads and deliver them via malicious attachments embedded in phishing emails.\nThe ongoing campaign has been codenamed SERPENTINE#CLOUD by Securonix.\nIt leverages \"the Cloudflare Tunnel infrastructure and Python-based l",
    "published": "2025-06-18T15:41:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft 365 to block file access via legacy auth protocols by default",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-to-block-file-access-via-legacy-auth-protocols-by-default/",
    "summary": "Microsoft has announced that it will soon update security defaults for all Microsoft 365 tenants to block access to SharePoint, OneDrive, and Office files via legacy authentication protocols. [...]",
    "published": "2025-06-18T15:14:28",
    "source": "BleepingComputer"
  },
  {
    "title": "'Stargazers' use fake Minecraft mods to steal player passwords",
    "link": "https://www.bleepingcomputer.com/news/security/stargazers-use-fake-minecraft-mods-to-steal-player-passwords/",
    "summary": "A large-scale malware campaign specifically targets Minecraft players with malicious mods and cheats that infect Windows devices with infostealers that steal credentials, authentication tokens, and cryptocurrency wallets. [...]",
    "published": "2025-06-18T15:09:05",
    "source": "BleepingComputer"
  },
  {
    "title": "1,500+ Minecraft Players Infected by Java Malware Masquerading as Game Mods on GitHub",
    "link": "https://thehackernews.com/2025/06/1500-minecraft-players-infected-by-java.html",
    "summary": "A new multi-stage malware campaign is targeting Minecraft users with a Java-based malware that employs a distribution-as-service (DaaS) offering called Stargazers Ghost Network.\n\"The campaigns resulted in a multi-stage attack chain targeting Minecraft users specifically,\" Check Point researchers Jar",
    "published": "2025-06-18T14:18:00",
    "source": "HackerNews"
  },
  {
    "title": "ChainLink Phishing: How Trusted Domains Become Threat Vectors",
    "link": "https://www.bleepingcomputer.com/news/security/chainlink-phishing-how-trusted-domains-become-threat-vectors/",
    "summary": "Phishing has evolved—and trust is the new attack vector. ChainLink Phishing uses real platforms like Google Drive & Dropbox to sneak past filters and steal credentials in the browser. Watch Keep Aware's on-demand webinar to see how these attacks work—and how to stop them. [...]",
    "published": "2025-06-18T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA warns of attackers exploiting Linux flaw with PoC exploit",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-attackers-exploiting-linux-flaw-with-poc-exploit/",
    "summary": "CISA has warned U.S. federal agencies about attackers targeting a high-severity vulnerability in the Linux kernel's OverlayFS subsystem that allows them to gain root privileges. [...]",
    "published": "2025-06-18T13:54:48",
    "source": "BleepingComputer"
  },
  {
    "title": "Healthcare SaaS firm says data breach impacts 5.4 million patients",
    "link": "https://www.bleepingcomputer.com/news/security/episource-says-data-breach-impacts-54-million-patients/",
    "summary": "Episource warns of a data breach after hackers stole health information of over 5 million people in the United States in a January cyberattack. [...]",
    "published": "2025-06-18T13:44:12",
    "source": "BleepingComputer"
  },
  {
    "title": "FedRAMP at Startup Speed: Lessons Learned",
    "link": "https://thehackernews.com/2025/06/fedramp-at-startup-speed-lessons-learned.html",
    "summary": "For organizations eyeing the federal market, FedRAMP can feel like a gated fortress. With strict compliance requirements and a notoriously long runway, many companies assume the path to authorization is reserved for the well-resourced enterprise. But that’s changing.\nIn this post, we break down how ",
    "published": "2025-06-18T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Water Curse Employs 76 GitHub Accounts to Deliver Multi-Stage Malware Campaign",
    "link": "https://thehackernews.com/2025/06/water-curse-hijacks-76-github-accounts.html",
    "summary": "Cybersecurity researchers have exposed a previously unknown threat actor known as Water Curse that relies on weaponized GitHub repositories to deliver multi-stage malware.\n\"The malware enables data exfiltration (including credentials, browser data, and session tokens), remote access, and long-term p",
    "published": "2025-06-18T10:47:00",
    "source": "HackerNews"
  },
  {
    "title": "BeyondTrust warns of pre-auth RCE in Remote Support software",
    "link": "https://www.bleepingcomputer.com/news/security/beyondtrust-warns-of-pre-auth-rce-in-remote-support-software/",
    "summary": "BeyondTrust has released security updates to fix a high-severity flaw in its Remote Support (RS) and Privileged Remote Access (PRA) solutions that can let unauthenticated attackers gain remote code execution on vulnerable servers. [...]",
    "published": "2025-06-18T10:10:03",
    "source": "BleepingComputer"
  },
  {
    "title": "New Linux udisks flaw lets attackers get root on major Linux distros",
    "link": "https://www.bleepingcomputer.com/news/linux/new-linux-udisks-flaw-lets-attackers-get-root-on-major-linux-distros/",
    "summary": "Attackers can exploit two newly discovered local privilege escalation (LPE) vulnerabilities to gain root privileges on systems running major Linux distributions. [...]",
    "published": "2025-06-18T08:45:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Asana warns MCP AI feature exposed customer data to other orgs",
    "link": "https://www.bleepingcomputer.com/news/security/asana-warns-mcp-ai-feature-exposed-customer-data-to-other-orgs/",
    "summary": "Work management platform Asana is warning users of its new Model Context Protocol (MCP) feature that a flaw in its implementation potentially led to data exposure from their instances to other users and vice versa. [...]",
    "published": "2025-06-18T07:16:19",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA Warns of Active Exploitation of Linux Kernel Privilege Escalation Vulnerability",
    "link": "https://thehackernews.com/2025/06/cisa-warns-of-active-exploitation-of.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday placed a security flaw impacting the Linux kernel in its Known Exploited Vulnerabilities (KEV) catalog, stating it has been actively exploited in the wild.\nThe vulnerability, CVE-2023-0386 (CVSS score: 7.8), is an improper o",
    "published": "2025-06-18T06:43:00",
    "source": "HackerNews"
  },
  {
    "title": "Ex-CIA Analyst Sentenced to 37 Months for Leaking Top Secret National Defense Documents",
    "link": "https://thehackernews.com/2025/06/ex-cia-analyst-sentenced-to-37-months.html",
    "summary": "A former U.S. Central Intelligence Agency (CIA) analyst has been sentenced to little more than three years in prison for unlawfully retaining and transmitting top secret National Defense Information (NDI) to people who were not entitled to receive them and for attempting to cover up the malicious ac",
    "published": "2025-06-18T06:43:00",
    "source": "HackerNews"
  }
]