[
  {
    "title": "SafeLine WAF: Open Source Web Application Firewall with Zero-Day Detection and Bot Protection",
    "link": "https://thehackernews.com/2025/05/safeline-waf-open-source-web.html",
    "summary": "From zero-day exploits to large-scale bot attacks — the demand for a powerful, self-hosted, and user-friendly web application security solution has never been greater.\nSafeLine is currently the most starred open-source Web Application Firewall (WAF) on GitHub, with over 16.4K stars and a rapidly gro",
    "published": "2025-05-23T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "TikTok videos now push infostealer malware in ClickFix attacks",
    "link": "https://www.bleepingcomputer.com/news/security/tiktok-videos-now-push-infostealer-malware-in-clickfix-attacks/",
    "summary": "Cybercriminals are using TikTok videos to trick users into infecting themselves with Vidar and StealC information-stealing malware in ClickFix attacks. [...]",
    "published": "2025-05-23T09:50:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 Notepad gets AI-powered text writing capabilities",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-notepad-gets-ai-powered-text-writing-capabilities/",
    "summary": "Microsoft is testing a new AI-powered text generation feature in Notepad that can let Windows Insiders create content based on custom prompts. [...]",
    "published": "2025-05-23T08:26:55",
    "source": "BleepingComputer"
  },
  {
    "title": "U.S. Dismantles DanaBot Malware Network, Charges 16 in $50M Global Cybercrime Operation",
    "link": "https://thehackernews.com/2025/05/us-dismantles-danabot-malware-network.html",
    "summary": "The U.S. Department of Justice (DoJ) on Thursday announced the disruption of the online infrastructure associated with DanaBot (aka DanaTools) and unsealed charges against 16 individuals for their alleged involvement in the development and deployment of the malware, which it said was controlled by a",
    "published": "2025-05-23T07:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Police takes down 300 servers in ransomware supply-chain crackdown",
    "link": "https://www.bleepingcomputer.com/news/security/police-takes-down-300-servers-in-ransomware-supply-chain-crackdown/",
    "summary": "In the latest phase of Operation Endgame, an international law enforcement operation, national authorities from seven countries seized 300 servers and 650 domains used to launch ransomware attacks. [...]",
    "published": "2025-05-23T06:58:13",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA Warns of Suspected Broader SaaS Attacks Exploiting App Secrets and Cloud Misconfigs",
    "link": "https://thehackernews.com/2025/05/cisa-warns-of-suspected-broader-saas.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday revealed that Commvault is monitoring cyber threat activity targeting applications hosted in their Microsoft Azure cloud environment.\n\"Threat actors may have accessed client secrets for Commvault's (Metallic) Microsoft 365 ",
    "published": "2025-05-23T05:16:00",
    "source": "HackerNews"
  },
  {
    "title": "GitLab Duo Vulnerability Enabled Attackers to Hijack AI Responses with Hidden Prompts",
    "link": "https://thehackernews.com/2025/05/gitlab-duo-vulnerability-enabled.html",
    "summary": "Cybersecurity researchers have discovered an indirect prompt injection flaw in GitLab's artificial intelligence (AI) assistant Duo that could have allowed attackers to steal source code and inject untrusted HTML into its responses, which could then be used to direct victims to malicious websites.\nGi",
    "published": "2025-05-23T04:34:00",
    "source": "HackerNews"
  },
  {
    "title": "Claude 4 benchmarks show improvements, but context is still 200K",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/claude-4-benchmarks-show-improvements-but-context-is-still-200k/",
    "summary": "Today, OpenAI rival Anthropic announced Claude 4 models, which are significantly better than Claude 3 in benchmarks, but we're left disappointed with the same 200,000 context window limit. [...]",
    "published": "2025-05-22T23:17:10",
    "source": "BleepingComputer"
  }
]