[
  {
    "title": "VanHelsing ransomware builder leaked on hacking forum",
    "link": "https://www.bleepingcomputer.com/news/security/vanhelsing-ransomware-builder-leaked-on-hacking-forum/",
    "summary": "The VanHelsing ransomware-as-a-service operation published the source code for its affiliate panel, data leak blog, and Windows encryptor builder after an old developer tried to sell it on the RAMP cybercrime forum. [...]",
    "published": "2025-05-20T19:06:25",
    "source": "BleepingComputer"
  },
  {
    "title": "SK Telecom says malware breach lasted 3 years, impacted 27 million numbers",
    "link": "https://www.bleepingcomputer.com/news/security/sk-telecom-says-malware-breach-lasted-3-years-impacted-27-million-numbers/",
    "summary": "SK Telecom says that a recently disclosed cybersecurity incident in April, first occurred all the way back in 2022, ultimately exposing the USIM data of 27 million subscribers. [...]",
    "published": "2025-05-20T17:07:40",
    "source": "BleepingComputer"
  },
  {
    "title": "Hazy Hawk gang exploits DNS misconfigs to hijack trusted domains",
    "link": "https://www.bleepingcomputer.com/news/security/hazy-hawk-gang-exploits-dns-misconfigs-to-hijack-trusted-domains/",
    "summary": "A threat actor named 'Hazy Hawk' has been using DNS CNAME hijacking to hijack abandoned cloud endpoints of domains belonging to trusted organizations and incorporate them in large-scale scam delivery and traffic distribution systems (TDS). [...]",
    "published": "2025-05-20T15:57:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Hazy Hawk Exploits DNS Records to Hijack CDC, Corporate Domains for Malware Delivery",
    "link": "https://thehackernews.com/2025/05/hazy-hawk-exploits-dns-records-to.html",
    "summary": "A threat actor known as Hazy Hawk has been observed hijacking abandoned cloud resources of high-profile organizations, including Amazon S3 buckets and Microsoft Azure endpoints, by leveraging misconfigurations in the Domain Name System (DNS) records.\nThe hijacked domains are then used to host URLs t",
    "published": "2025-05-20T15:53:00",
    "source": "HackerNews"
  },
  {
    "title": "100+ Fake Chrome Extensions Found Hijacking Sessions, Stealing Credentials, Injecting Ads",
    "link": "https://thehackernews.com/2025/05/100-fake-chrome-extensions-found.html",
    "summary": "An unknown threat actor has been attributed to creating several malicious Chrome Browser extensions since February 2024 that masquerade as seemingly benign utilities but incorporate covert functionality to exfiltrate data, receive commands, and execute arbitrary code.\n\"The actor creates websites tha",
    "published": "2025-05-20T15:01:00",
    "source": "HackerNews"
  },
  {
    "title": "RVTools hit in supply chain attack to deliver Bumblebee malware",
    "link": "https://www.bleepingcomputer.com/news/security/rvtools-hit-in-supply-chain-attack-to-deliver-bumblebee-malware/",
    "summary": "The official website for the RVTools VMware management tool was taken offline in what appears to be a supply chain attack that distributed a trojanized installer to drop the Bumblebee malware loader on users' machines. [...]",
    "published": "2025-05-20T14:39:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Service desks are under attack: What can you do about it?",
    "link": "https://www.bleepingcomputer.com/news/security/service-desks-are-under-attack-what-can-you-do-about-it/",
    "summary": "Service desks are on the front lines of defense—and attackers know it. Attackers are using social engineering attacks to trick agents into changing passwords, disabling MFA, and granting access. Learn more from Specops Software on how to secure your service desk. [...]",
    "published": "2025-05-20T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "AWS Default IAM Roles Found to Enable Lateral Movement and Cross-Service Exploitation",
    "link": "https://thehackernews.com/2025/05/aws-default-iam-roles-found-to-enable.html",
    "summary": "Cybersecurity researchers have discovered risky default identity and access management (IAM) roles impacting Amazon Web Services that could open the door for attackers to escalate privileges, manipulate other AWS services, and, in some cases, even fully compromise AWS accounts.\n\"These roles, often c",
    "published": "2025-05-20T12:42:00",
    "source": "HackerNews"
  },
  {
    "title": "The Crowded Battle: Key Insights from the 2025 State of Pentesting Report",
    "link": "https://thehackernews.com/2025/05/the-crowded-battle-key-insights-from.html",
    "summary": "In the newly released 2025 State of Pentesting Report, Pentera surveyed 500 CISOs from global enterprises (200 from within the USA) to understand the strategies, tactics, and tools they use to cope with the thousands of security alerts, the persisting breaches and the growing cyber risks they have t",
    "published": "2025-05-20T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "South Asian Ministries Hit by SideWinder APT Using Old Office Flaws and Custom Malware",
    "link": "https://thehackernews.com/2025/05/south-asian-ministries-hit-by.html",
    "summary": "High-level government institutions in Sri Lanka, Bangladesh, and Pakistan have emerged as the target of a new campaign orchestrated by a threat actor known as SideWinder.\n\"The attackers used spear phishing emails paired with geofenced payloads to ensure that only victims in specific countries receiv",
    "published": "2025-05-20T10:57:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hackers Deploy MarsSnake Backdoor in Multi-Year Attack on Saudi Organization",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-deploy-marssnake.html",
    "summary": "Threat hunters have exposed the tactics of a China-aligned threat actor called UnsolicitedBooker that targeted an unnamed international organization in Saudi Arabia with a previously undocumented backdoor dubbed MarsSnake.\nESET, which first discovered the hacking group's intrusions targeting the ent",
    "published": "2025-05-20T09:32:00",
    "source": "HackerNews"
  },
  {
    "title": "Go-Based Malware Deploys XMRig Miner on Linux Hosts via Redis Configuration Abuse",
    "link": "https://thehackernews.com/2025/05/go-based-malware-deploys-xmrig-miner-on.html",
    "summary": "Cybersecurity researchers are calling attention to a new Linux cryptojacking campaign that's targeting publicly accessible Redis servers.\nThe malicious activity has been codenamed RedisRaider by Datadog Security Labs.\n\"RedisRaider aggressively scans randomized portions of the IPv4 space and uses leg",
    "published": "2025-05-20T08:25:00",
    "source": "HackerNews"
  }
]