[
  {
    "title": "Critical NVIDIA Container Toolkit Flaw Allows Privilege Escalation on AI Cloud Services",
    "link": "https://thehackernews.com/2025/07/critical-nvidia-container-toolkit-flaw.html",
    "summary": "Cybersecurity researchers have disclosed a critical container escape vulnerability in the NVIDIA Container Toolkit that could pose a severe threat to managed AI cloud services.\nThe vulnerability, tracked as CVE-2025-23266, carries a CVSS score of 9.0 out of 10.0. It has been codenamed NVIDIAScape by",
    "published": "2025-07-18T11:32:00",
    "source": "HackerNews"
  },
  {
    "title": "CERT-UA Discovers LAMEHUG Malware Linked to APT28, Using LLM for Phishing Campaign",
    "link": "https://thehackernews.com/2025/07/cert-ua-discovers-lamehug-malware.html",
    "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has disclosed details of a phishing campaign that's designed to deliver a malware codenamed LAMEHUG.\n\"An obvious feature of LAMEHUG is the use of LLM (large language model), used to generate commands based on their textual representation (des",
    "published": "2025-07-18T11:32:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Sues 25 Chinese Entities Over BADBOX 2.0 Botnet Affecting 10M Android Devices",
    "link": "https://thehackernews.com/2025/07/google-sues-25-chinese-entities-over.html",
    "summary": "Google on Thursday revealed it's pursuing legal action in New York federal court against 25 unnamed individuals or entities in China for allegedly operating BADBOX 2.0 botnet and residential proxy infrastructure.\n\"The BADBOX 2.0 botnet compromised over 10 million uncertified devices running Android'",
    "published": "2025-07-18T11:03:00",
    "source": "HackerNews"
  },
  {
    "title": "From Backup to Cyber Resilience: Why IT Leaders Must Rethink Backup in the Age of Ransomware",
    "link": "https://thehackernews.com/2025/07/how-cyber-resilience-helps-it-defend-against-ransomwa.html",
    "summary": "With IT outages and disruptions escalating, IT teams are shifting their focus beyond simply backing up data to maintaining operations during an incident. One of the key drivers behind this shift is the growing threat of ransomware, which continues to evolve in both frequency and complexity. Ransomwa",
    "published": "2025-07-18T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "OpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-gpt-5-is-coming-well-see-if-it-creates-a-shockwave/",
    "summary": "OpenAI's next foundational and state-of-the-art model, GPT-5, is still on its way after a delay. OpenAI won't tell us the release date for now. [...]",
    "published": "2025-07-18T09:47:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Poor Passwords Tattle on AI Hiring Bot Maker Paradox.ai",
    "link": "https://krebsonsecurity.com/2025/07/poor-passwords-tattle-on-ai-hiring-bot-maker-paradox-ai/",
    "summary": "Security researchers recently revealed that the personal information of millions of people who applied for jobs at McDonald's was exposed after they guessed the password (\"123456\") for the fast food chain's account at Paradox.ai, a company that makes artificial intelligence based hiring chatbots use",
    "published": "2025-07-18T01:23:20",
    "source": "Krebs"
  }
]