[
  {
    "title": "VeriSource now says February data breach impacts 4 million people",
    "link": "https://www.bleepingcomputer.com/news/security/verisource-now-says-february-data-breach-impacts-4-million-people/",
    "summary": "Employee benefits administration firm VeriSource Services is warning that a data breach exposed the personal information of four million people.  [...]",
    "published": "2025-04-28T17:54:47",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-1-200-sap-netweaver-servers-vulnerable-to-actively-exploited-flaw/",
    "summary": "Over 1,200 internet-exposed SAP NetWeaver instances are vulnerable to an actively exploited maximum severity unauthenticated file upload vulnerability that allows attackers to hijack servers. [...]",
    "published": "2025-04-28T16:46:43",
    "source": "BleepingComputer"
  },
  {
    "title": "Kali Linux warns of update failures after losing repo signing key",
    "link": "https://www.bleepingcomputer.com/news/linux/kali-linux-warns-of-update-failures-after-losing-repo-signing-key/",
    "summary": "​Offensive Security warned Kali Linux users to manually install a new Kali repository signing key to avoid experiencing update failures. [...]",
    "published": "2025-04-28T16:37:58",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft fixes Outlook on the web search issues, failures",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-on-the-web-search-issues-failures/",
    "summary": "Microsoft is working on fully mitigating issues causing Outlook on the web and SharePoint Online users to experience delays or failures when searching. [...]",
    "published": "2025-04-28T15:17:52",
    "source": "BleepingComputer"
  },
  {
    "title": "Cloudflare mitigates record number of DDoS attacks in 2025",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-mitigates-record-number-of-ddos-attacks-in-2025/",
    "summary": "Internet services giant Cloudflare says it mitigated a record number of DDoS attacks in 2024, recording a massive 358% year-over-year jump and a 198% quarter-over-quarter increase. [...]",
    "published": "2025-04-28T14:04:10",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: Critical SAP Exploit, AI-Powered Phishing, Major Breaches, New CVEs & More",
    "link": "https://thehackernews.com/2025/04/weekly-recap-critical-sap-exploit-ai.html",
    "summary": "What happens when cybercriminals no longer need deep skills to breach your defenses? Today’s attackers are armed with powerful tools that do the heavy lifting — from AI-powered phishing kits to large botnets ready to strike. And they’re not just after big corporations. Anyone can be a target when fa",
    "published": "2025-04-28T12:18:00",
    "source": "HackerNews"
  },
  {
    "title": "How Breaches Start: Breaking Down 5 Real Vulns",
    "link": "https://thehackernews.com/2025/04/how-breaches-start-breaking-down-5-real.html",
    "summary": "Not every security vulnerability is high risk on its own - but in the hands of an advanced attacker, even small weaknesses can escalate into major breaches. These five real vulnerabilities, uncovered by Intruder’s bug-hunting team, reveal how attackers turn overlooked flaws into serious security inc",
    "published": "2025-04-28T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Earth Kurma Targets Southeast Asia With Rootkits and Cloud-Based Data Theft Tools",
    "link": "https://thehackernews.com/2025/04/earth-kurma-targets-southeast-asia-with.html",
    "summary": "Government and telecommunications sectors in Southeast Asia have become the target of a \"sophisticated\" campaign undertaken by a new advanced persistent threat (APT) group called Earth Kurma since June 2024.\nThe attacks, per Trend Micro, have leveraged custom malware, rootkits, and cloud storage ser",
    "published": "2025-04-28T09:07:00",
    "source": "HackerNews"
  },
  {
    "title": "WooCommerce Users Targeted by Fake Patch Phishing Campaign Deploying Site Backdoors",
    "link": "https://thehackernews.com/2025/04/woocommerce-users-targeted-by-fake.html",
    "summary": "Cybersecurity researchers are warning about a large-scale phishing campaign targeting WooCommerce users with a fake security alert urging them to download a \"critical patch\" but deploy a backdoor instead.\nWordPress security company Patchstack described the activity as sophisticated and a variant of ",
    "published": "2025-04-28T08:06:00",
    "source": "HackerNews"
  }
]