[
  {
    "title": "5 Ways Identity-based Attacks Are Breaching Retail",
    "link": "https://thehackernews.com/2025/07/5-ways-identity-based-attacks-are.html",
    "summary": "From overprivileged admin roles to long-forgotten vendor tokens, these attackers are slipping through the cracks of trust and access. Here’s how five retail breaches unfolded, and what they reveal about...\nIn recent months, major retailers like Adidas, The North Face, Dior, Victoria's Secret, Cartie",
    "published": "2025-07-08T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "RondoDox Botnet Exploits Flaws in TBK DVRs and Four-Faith Routers to Launch DDoS Attacks",
    "link": "https://thehackernews.com/2025/07/rondodox-botnet-exploits-flaws-in-tbk.html",
    "summary": "Cybersecurity researchers are calling attention to a malware campaign that's targeting security flaws in TBK digital video recorders (DVRs) and Four-Faith routers to rope the devices into a new botnet called RondoDox.\nThe vulnerabilities in question include CVE-2024-3721, a medium-severity command i",
    "published": "2025-07-08T11:08:00",
    "source": "HackerNews"
  },
  {
    "title": "BaitTrap: Over 17,000 Fake News Websites Caught Fueling Investment Fraud Globally",
    "link": "https://thehackernews.com/2025/07/baittrap-over-17000-fake-news-websites.html",
    "summary": "A newly released report by cybersecurity firm CTM360 reveals a large-scale scam operation utilizing fake news websites&mdash;known as Baiting News Sites (BNS)&mdash;to deceive users into online investment fraud across 50 countries.\nThese BNS pages are made to look like real news outlets: CNN, BBC, C",
    "published": "2025-07-08T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Researchers Uncover Batavia Windows Spyware Stealing Documents from Russian Firms",
    "link": "https://thehackernews.com/2025/07/researchers-uncover-batavia-windows.html",
    "summary": "Russian organizations have been targeted as part of an ongoing campaign that delivers a previously undocumented Windows spyware called Batavia.\nThe activity, per cybersecurity vendor Kaspersky, has been active since July 2024.\n\"The targeted attack begins with bait emails containing malicious links, ",
    "published": "2025-07-08T08:22:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds Four Critical Vulnerabilities to KEV Catalog Due to Active Exploitation",
    "link": "https://thehackernews.com/2025/07/cisa-adds-four-critical-vulnerabilities.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe list of flaws is as follows -\n\nCVE-2014-3931 (CVSS score: 9.8) - A buffer overflow vulner",
    "published": "2025-07-08T05:08:00",
    "source": "HackerNews"
  },
  {
    "title": "Alleged Chinese hacker tied to Silk Typhoon arrested for cyberespionage",
    "link": "https://www.bleepingcomputer.com/news/security/alleged-chinese-hacker-tied-to-silk-typhoon-arrested-for-cyberespionage/",
    "summary": "A Chinese national was arrested in Milan, Italy, last week for allegedly being linked to the state-sponsored Silk Typhoon hacking group, which responsible for cyberattacks against American organizations and government agencies. [...]",
    "published": "2025-07-08T01:39:01",
    "source": "BleepingComputer"
  }
]