[
  {
    "title": "Moldovan Police Arrest Suspect in €4.5M Ransomware Attack on Dutch Research Agency",
    "link": "https://thehackernews.com/2025/05/moldovan-police-arrest-suspect-in-45m.html",
    "summary": "Moldovan law enforcement authorities have arrested a 45-year-old foreign man suspected of involvement in a series of ransomware attacks targeting Dutch companies in 2021.\n\"He is wanted internationally for committing several cybercrimes (ransomware attacks, blackmail, and money laundering) against co",
    "published": "2025-05-13T06:33:00",
    "source": "HackerNews"
  },
  {
    "title": "Türkiye Hackers Exploited Output Messenger Zero-Day to Drop Golang Backdoors on Kurdish Servers",
    "link": "https://thehackernews.com/2025/05/turkiye-hackers-exploited-output.html",
    "summary": "A Türkiye-affiliated threat actor exploited a zero-day security flaw in an Indian enterprise communication platform called Output Messenger as part of a cyber espionage attack campaign since April 2024.\n\"These exploits have resulted in a collection of related user data from targets in Iraq,\" the Mic",
    "published": "2025-05-13T05:08:00",
    "source": "HackerNews"
  },
  {
    "title": "ASUS DriverHub flaw let malicious sites run commands with admin rights",
    "link": "https://www.bleepingcomputer.com/news/security/asus-driverhub-flaw-let-malicious-sites-run-commands-with-admin-rights/",
    "summary": "The ASUS DriverHub driver management utility was vulnerable to a critical remote code execution flaw that allowed malicious sites to execute commands on devices with the software installed. [...]",
    "published": "2025-05-12T21:26:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 upgrade block lifted after Safe Exam Browser fix",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-upgrade-block-lifted-after-safe-exam-browser-fix/",
    "summary": "Microsoft has removed an upgrade block that prevented some Safe Exam Browser users from installing the Windows 11 2024 Update due to incompatibility issues. [...]",
    "published": "2025-05-12T20:42:32",
    "source": "BleepingComputer"
  }
]