[
  {
    "title": "Google links massive cloud outage to API management issue",
    "link": "https://www.bleepingcomputer.com/news/google/google-links-massive-cloud-outage-to-api-management-issue/",
    "summary": "Google says an API management issue is behind Thursday's massive Google Cloud outage, which disrupted or brought down its services and many other online platforms. [...]",
    "published": "2025-06-13T17:39:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Discord flaw lets hackers reuse expired invites in malware campaign",
    "link": "https://www.bleepingcomputer.com/news/security/discord-flaw-lets-hackers-reuse-expired-invites-in-malware-campaign/",
    "summary": "Hackers are hijacking expired or deleted Discord invite links to redirect users to malicious sites that deliver remote access trojans and information-stealing malware. [...]",
    "published": "2025-06-13T16:10:51",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 269,000 Websites Infected with JSFireTruck JavaScript Malware in One Month",
    "link": "https://thehackernews.com/2025/06/over-269000-websites-infected-with.html",
    "summary": "Cybersecurity researchers are calling attention to a \"large-scale campaign\" that has been observed compromising legitimate websites with malicious JavaScript injections.\nAccording to Palo Alto Networks Unit 42, these malicious injects are obfuscated using JSFuck, which refers to an \"esoteric and edu",
    "published": "2025-06-13T14:12:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft: KB5060533 update triggers boot errors on Surface Hub v1 devices",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-kb5060533-update-triggers-boot-errors-on-surface-hub-v1-devices/",
    "summary": "Microsoft is investigating a known issue that triggers Secure Boot errors and prevents Surface Hub v1 devices from starting up. [...]",
    "published": "2025-06-13T13:17:29",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft confirms auth issues affecting Microsoft 365 users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-auth-issues-affecting-microsoft-365-users/",
    "summary": "Microsoft is investigating an ongoing incident that is causing users to experience errors with some Microsoft 365 authentication features. [...]",
    "published": "2025-06-13T12:37:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Victoria’s Secret restores critical systems after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/victorias-secret-restores-critical-systems-after-cyberattack/",
    "summary": "Victoria's Secret has restored all critical systems impacted by a May 24 security incident that forced it to shut down corporate systems and the e-commerce website. [...]",
    "published": "2025-06-13T11:56:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Ransomware Gangs Exploit Unpatched SimpleHelp Flaws to Target Victims with Double Extortion",
    "link": "https://thehackernews.com/2025/06/ransomware-gangs-exploit-unpatched.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday disclosed that ransomware actors are targeting unpatched SimpleHelp Remote Monitoring and Management (RMM) instances to compromise customers of an unnamed utility billing software provider.\n\"This incident reflects a broader",
    "published": "2025-06-13T11:02:00",
    "source": "HackerNews"
  },
  {
    "title": "CTEM is the New SOC: Shifting from Monitoring Alerts to Measuring Risk",
    "link": "https://thehackernews.com/2025/06/ctem-is-new-soc-shifting-from.html",
    "summary": "Introduction: Security at a Tipping Point\nSecurity Operations Centers (SOCs) were built for a different era, one defined by perimeter-based thinking, known threats, and manageable alert volumes. But today’s threat landscape doesn’t play by those rules. The sheer volume of telemetry, overlapping tool",
    "published": "2025-06-13T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Cloudflare: Outage not caused by security incident, data is safe",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-outage-not-caused-by-security-incident-data-is-safe/",
    "summary": "Cloudflare has confirmed that the massive service outage yesterday was not caused by a security incident and no data has been lost. [...]",
    "published": "2025-06-13T10:09:24",
    "source": "BleepingComputer"
  },
  {
    "title": "Apple Zero-Click Flaw in Messages Exploited to Spy on Journalists Using Paragon Spyware",
    "link": "https://thehackernews.com/2025/06/apple-zero-click-flaw-in-messages.html",
    "summary": "Apple has disclosed that a now-patched security flaw present in its Messages app was actively exploited in the wild to target civil society members in sophisticated cyber attacks.\nThe vulnerability, tracked as CVE-2025-43200, was addressed on February 10, 2025, as part of iOS 18.3.1, iPadOS 18.3.1, ",
    "published": "2025-06-13T07:03:00",
    "source": "HackerNews"
  }
]