[
  {
    "title": "Dozens of malicious packages on NPM collect host and network data",
    "link": "https://www.bleepingcomputer.com/news/security/dozens-of-malicious-packages-on-npm-collect-host-and-network-data/",
    "summary": "60 packages have been discovered in the NPM index that attempt to collect sensitive host and network data and send it to a Discord webhook controlled by the threat actor. [...]",
    "published": "2025-05-23T17:37:41",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Use TikTok Videos to Distribute Vidar and StealC Malware via ClickFix Technique",
    "link": "https://thehackernews.com/2025/05/hackers-use-tiktok-videos-to-distribute.html",
    "summary": "The malware known as Latrodectus has become the latest to embrace the widely-used social engineering technique called ClickFix as a distribution vector.\n\"The ClickFix technique is particularly risky because it allows the malware to execute in memory rather than being written to disk,\" Expel said in ",
    "published": "2025-05-23T17:24:00",
    "source": "HackerNews"
  },
  {
    "title": "Hacker steals $223 million in Cetus Protocol cryptocurrency heist",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-steals-223-million-in-cetus-protocol-cryptocurrency-heist/",
    "summary": "The decentralized exchange Cetus Protocol announced that hackers have stolen $223 million in cryptocurrency and is offering a deal to stop all legal action if the funds are returned. [...]",
    "published": "2025-05-23T15:46:22",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI warns of Luna Moth extortion attacks targeting law firms",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-warns-of-luna-moth-extortion-attacks-targeting-law-firms/",
    "summary": "The FBI warned that an extortion gang known as the Silent Ransom Group has been targeting U.S. law firms over the last two years in callback phishing and social engineering attacks. [...]",
    "published": "2025-05-23T15:26:44",
    "source": "BleepingComputer"
  },
  {
    "title": "ViciousTrap Uses Cisco Flaw to Build Global Honeypot from 5,300 Compromised Devices",
    "link": "https://thehackernews.com/2025/05/vicioustrap-uses-cisco-flaw-to-build.html",
    "summary": "Cybersecurity researchers have disclosed that a threat actor codenamed ViciousTrap has compromised nearly 5,300 unique network edge devices across 84 countries and turned them into a honeypot-like network.\nThe threat actor has been observed exploiting a critical security flaw impacting Cisco Small B",
    "published": "2025-05-23T12:49:00",
    "source": "HackerNews"
  },
  {
    "title": "300 Servers and €3.5M Seized as Europol Strikes Ransomware Networks Worldwide",
    "link": "https://thehackernews.com/2025/05/300-servers-and-35m-seized-as-europol.html",
    "summary": "As part of the latest \"season\" of Operation Endgame, a coalition of law enforcement agencies have taken down about 300 servers worldwide, neutralized 650 domains, and issued arrest warrants against 20 targets.\nOperation Endgame, first launched in May 2024, is an ongoing law enforcement operation tar",
    "published": "2025-05-23T10:45:00",
    "source": "HackerNews"
  },
  {
    "title": "SafeLine WAF: Open Source Web Application Firewall with Zero-Day Detection and Bot Protection",
    "link": "https://thehackernews.com/2025/05/safeline-waf-open-source-web.html",
    "summary": "From zero-day exploits to large-scale bot attacks — the demand for a powerful, self-hosted, and user-friendly web application security solution has never been greater.\nSafeLine is currently the most starred open-source Web Application Firewall (WAF) on GitHub, with over 16.4K stars and a rapidly gro",
    "published": "2025-05-23T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "TikTok videos now push infostealer malware in ClickFix attacks",
    "link": "https://www.bleepingcomputer.com/news/security/tiktok-videos-now-push-infostealer-malware-in-clickfix-attacks/",
    "summary": "Cybercriminals are using TikTok videos to trick users into infecting themselves with Vidar and StealC information-stealing malware in ClickFix attacks. [...]",
    "published": "2025-05-23T09:50:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 Notepad gets AI-powered text writing capabilities",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-notepad-gets-ai-powered-text-writing-capabilities/",
    "summary": "Microsoft is testing a new AI-powered text generation feature in Notepad that can let Windows Insiders create content based on custom prompts. [...]",
    "published": "2025-05-23T08:26:55",
    "source": "BleepingComputer"
  },
  {
    "title": "U.S. Dismantles DanaBot Malware Network, Charges 16 in $50M Global Cybercrime Operation",
    "link": "https://thehackernews.com/2025/05/us-dismantles-danabot-malware-network.html",
    "summary": "The U.S. Department of Justice (DoJ) on Thursday announced the disruption of the online infrastructure associated with DanaBot (aka DanaTools) and unsealed charges against 16 individuals for their alleged involvement in the development and deployment of the malware, which it said was controlled by a",
    "published": "2025-05-23T07:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Police takes down 300 servers in ransomware supply-chain crackdown",
    "link": "https://www.bleepingcomputer.com/news/security/police-takes-down-300-servers-in-ransomware-supply-chain-crackdown/",
    "summary": "In the latest phase of Operation Endgame, an international law enforcement operation, national authorities from seven countries seized 300 servers and 650 domains used to launch ransomware attacks. [...]",
    "published": "2025-05-23T06:58:13",
    "source": "BleepingComputer"
  }
]