[
  {
    "title": "Chinese APT41 Exploits Google Calendar for Malware Command-and-Control Operations",
    "link": "https://thehackernews.com/2025/05/chinese-apt41-exploits-google-calendar.html",
    "summary": "Google on Wednesday disclosed that the Chinese state-sponsored threat actor known as APT41 leveraged a malware called TOUGHPROGRESS that uses Google Calendar for command-and-control (C2).\nThe tech giant, which discovered the activity in late October 2024, said the malware was hosted on a compromised",
    "published": "2025-05-29T05:59:00",
    "source": "HackerNews"
  },
  {
    "title": "Over 100,000 WordPress Sites at Risk from Critical CVSS 10.0 Vulnerability in Wishlist Plugin",
    "link": "https://thehackernews.com/2025/05/over-100000-wordpress-sites-at-risk.html",
    "summary": "Cybersecurity researchers have disclosed a critical unpatched security flaw impacting TI WooCommerce Wishlist plugin for WordPress that could be exploited by unauthenticated attackers to upload arbitrary files.\nTI WooCommerce Wishlist, which has over 100,000 active installations, is a tool to allow ",
    "published": "2025-05-29T05:34:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 10 KB5058481 update brings seconds back to calendar flyout",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058481-update-brings-seconds-back-to-calendar-flyout/",
    "summary": "Microsoft has released the optional KB5058481 preview cumulative update for Windows 10 22H2 with seven changes, including restoring seconds to the time display in the calendar flyout for those who previously lost it. [...]",
    "published": "2025-05-28T22:57:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 11 KB5058499 update rolls out new Share and Click to Do features",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5058499-update-rolls-out-new-share-and-click-to-do-features/",
    "summary": "​​Microsoft has released the KB5058499 preview cumulative update for Windows 11 24H2 with forty-eight new features or changes, with many gradually rolling out, such as the new Windows Share feature and tje Click to Do Preview. [...]",
    "published": "2025-05-28T22:19:54",
    "source": "BleepingComputer"
  },
  {
    "title": "APT41 malware abuses Google Calendar for stealthy C2 communication",
    "link": "https://www.bleepingcomputer.com/news/security/apt41-malware-abuses-google-calendar-for-stealthy-c2-communication/",
    "summary": "The Chinese APT41 hacking group uses a new malware named 'ToughProgress' that abuses Google Calendar for command-and-control (C2) operations, hiding malicious activity behind a trusted cloud service. [...]",
    "published": "2025-05-28T22:04:04",
    "source": "BleepingComputer"
  },
  {
    "title": "New PumaBot botnet brute forces SSH credentials to breach devices",
    "link": "https://www.bleepingcomputer.com/news/security/new-pumabot-botnet-brute-forces-ssh-credentials-to-breach-devices/",
    "summary": "A newly discovered Go-based Linux botnet malware named PumaBot is brute-forcing SSH credentials on embedded IoT devices to deploy malicious payloads. [...]",
    "published": "2025-05-28T19:59:38",
    "source": "BleepingComputer"
  }
]