[
  {
    "title": "New Android TapTrap attack fools users with invisible UI trick",
    "link": "https://www.bleepingcomputer.com/news/security/new-android-taptrap-attack-fools-users-with-invisible-ui-trick/",
    "summary": "A novel tapjacking technique can exploit user interface animations to bypass Android's permission system and allow access to sensitive data or trick users into performing destructive actions, such as wiping the device. [...]",
    "published": "2025-07-08T19:39:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 10 KB5062554 cumulative update released with 13 changes, fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5062554-cumulative-update-released-with-13-changes-fixes/",
    "summary": "Microsoft has released the KB5062554 cumulative update for Windows 10 22H2 and Windows 10 21H2, with thirteen new fixes or changes. [...]",
    "published": "2025-07-08T17:44:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Use Leaked Shellter Tool License to Spread Lumma Stealer and SectopRAT Malware",
    "link": "https://thehackernews.com/2025/07/hackers-use-leaked-shellter-tool.html",
    "summary": "In yet another instance of threat actors repurposing legitimate tools for malicious purposes, it has been discovered that hackers are exploiting a popular red teaming tool called Shellter to distribute stealer malware.\nThe company behind the software said a company that had recently purchased Shellt",
    "published": "2025-07-08T17:35:00",
    "source": "HackerNews"
  },
  {
    "title": "Windows 11 KB5062553 & KB5062552  cumulative updates released",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5062553-and-kb5062552-cumulative-updates-released/",
    "summary": "Microsoft has released Windows 11 KB5062553 and KB5062552 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues. [...]",
    "published": "2025-07-08T17:32:37",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-july-2025-patch-tuesday-fixes-one-zero-day-137-flaws/",
    "summary": "Today is Microsoft's July 2025 Patch Tuesday, which includes security updates for 137 flaws, including one publicly disclosed zero-day vulnerability in Microsoft SQL Server. [...]",
    "published": "2025-07-08T17:30:56",
    "source": "BleepingComputer"
  },
  {
    "title": "Anatsa Android Banking Trojan Hits 90,000 Users with Fake PDF App on Google Play",
    "link": "https://thehackernews.com/2025/07/anatsa-android-banking-trojan-hits.html",
    "summary": "Cybersecurity researchers have discovered an Android banking malware campaign that has leveraged a trojan named Anatsa to target users in North America using malicious apps published on Google's official app marketplace.\nThe malware, disguised as a \"PDF Update\" to a document viewer app, has been cau",
    "published": "2025-07-08T16:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Android malware Anatsa infiltrates Google Play to target US banks",
    "link": "https://www.bleepingcomputer.com/news/security/android-malware-anatsa-infiltrates-google-play-to-target-us-banks/",
    "summary": "The Anatsa banking trojan has sneaked into Google Play once more via an app posing as a PDF viewer that counted more than 50,000 downloads. [...]",
    "published": "2025-07-08T15:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Overcoming Technical Barriers in Desktop and Application Virtualization",
    "link": "https://www.bleepingcomputer.com/news/security/overcoming-technical-barriers-in-desktop-and-application-virtualization/",
    "summary": "Exposed RDP ports are an open door for attackers. TruGrid SecureRDP enforces Zero Trust and MFA, blocks lateral movement, and secures remote access—no open firewall ports required. Learn more and get a free trial. [...]",
    "published": "2025-07-08T14:09:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Malicious Chrome extensions with 1.7M installs found on Web Store",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-chrome-extensions-with-17m-installs-found-on-web-store/",
    "summary": "Almost a dozen malicious extensions with 1.7 million downloads in Google's Chrome Web Store could track users, steal browser activity, and redirect to potentially unsafe web addresses. [...]",
    "published": "2025-07-08T14:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Malicious Pull Request Targets 6,000+ Developers via Vulnerable Ethcode VS Code Extension",
    "link": "https://thehackernews.com/2025/07/malicious-pull-request-infects-6000.html",
    "summary": "Cybersecurity researchers have flagged a supply chain attack targeting a Microsoft Visual Studio Code (VS Code) extension called Ethcode that has been installed a little over 6,000 times.\nThe compromise, per ReversingLabs, occurred via a GitHub pull request that was opened by a user named Airez299 o",
    "published": "2025-07-08T13:01:00",
    "source": "HackerNews"
  },
  {
    "title": "5 Ways Identity-based Attacks Are Breaching Retail",
    "link": "https://thehackernews.com/2025/07/5-ways-identity-based-attacks-are.html",
    "summary": "From overprivileged admin roles to long-forgotten vendor tokens, these attackers are slipping through the cracks of trust and access. Here’s how five retail breaches unfolded, and what they reveal about...\nIn recent months, major retailers like Adidas, The North Face, Dior, Victoria's Secret, Cartie",
    "published": "2025-07-08T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "RondoDox Botnet Exploits Flaws in TBK DVRs and Four-Faith Routers to Launch DDoS Attacks",
    "link": "https://thehackernews.com/2025/07/rondodox-botnet-exploits-flaws-in-tbk.html",
    "summary": "Cybersecurity researchers are calling attention to a malware campaign that's targeting security flaws in TBK digital video recorders (DVRs) and Four-Faith routers to rope the devices into a new botnet called RondoDox.\nThe vulnerabilities in question include CVE-2024-3721, a medium-severity command i",
    "published": "2025-07-08T11:08:00",
    "source": "HackerNews"
  },
  {
    "title": "BaitTrap: Over 17,000 Fake News Websites Caught Fueling Investment Fraud Globally",
    "link": "https://thehackernews.com/2025/07/baittrap-over-17000-fake-news-websites.html",
    "summary": "A newly released report by cybersecurity firm CTM360 reveals a large-scale scam operation utilizing fake news websites—known as Baiting News Sites (BNS)—to deceive users into online investment fraud across 50 countries.\nThese BNS pages are made to look like real news outlets: CNN, BBC, CNBC, or regi",
    "published": "2025-07-08T10:30:00",
    "source": "HackerNews"
  }
]