[
  {
    "title": "Paddle settles for $5 million over facilitating tech support scams",
    "link": "https://www.bleepingcomputer.com/news/security/paddle-settles-for-5-million-over-facilitating-tech-support-scams/",
    "summary": "Paddle.com and its U.S. subsidiary will pay $5 million to settle Federal Trade Commission (FTC) allegations that the company facilitated deceptive tech-support schemes that harmed many U.S. consumers, including older adults. [...]",
    "published": "2025-06-17T21:14:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome Zero-Day CVE-2025-2783 Exploited by TaxOff to Deploy Trinper Backdoor",
    "link": "https://thehackernews.com/2025/06/google-chrome-zero-day-cve-2025-2783.html",
    "summary": "A now-patched security flaw in Google Chrome was exploited as a zero-day by a threat actor known as TaxOff to deploy a backdoor codenamed Trinper.\nThe attack, observed in mid-March 2025 by Positive Technologies, involved the use of a sandbox escape vulnerability tracked as CVE-2025-2783 (CVSS score:",
    "published": "2025-06-17T19:16:00",
    "source": "HackerNews"
  },
  {
    "title": "Scania confirms insurance claim data breach in extortion attempt",
    "link": "https://www.bleepingcomputer.com/news/security/scania-confirms-insurance-claim-data-breach-in-extortion-attempt/",
    "summary": "Automotive giant Scania confirmed it suffered a cybersecurity incident where threat actors used compromised credentials to breach its systems and steal insurance claim documents. [...]",
    "published": "2025-06-17T19:04:39",
    "source": "BleepingComputer"
  },
  {
    "title": "LangSmith Bug Could Expose OpenAI Keys and User Data via Malicious Agents",
    "link": "https://thehackernews.com/2025/06/langchain-langsmith-bug-let-hackers.html",
    "summary": "Cybersecurity researchers have disclosed a now-patched security flaw in LangChain's LangSmith platform that could be exploited to capture sensitive data, including API keys and user prompts.\nThe vulnerability, which carries a CVSS score of 8.8 out of a maximum of 10.0, has been codenamed AgentSmith ",
    "published": "2025-06-17T17:33:00",
    "source": "HackerNews"
  },
  {
    "title": "Instagram 'BMO' ads use AI deepfakes to scam banking customers",
    "link": "https://www.bleepingcomputer.com/news/security/instagram-bmo-ads-use-ai-deepfakes-to-scam-banking-customers/",
    "summary": "Instagram ads impersonating financial institutions like Bank of Montreal (BMO) and EQ Bank (Equitable Bank) are being used to target Canadian consumers with phishing scams and investment fraud.\n\nSome ads use AI-powered deepfake videos in an attempt to collect your personal information, while others ",
    "published": "2025-06-17T16:52:09",
    "source": "BleepingComputer"
  },
  {
    "title": "New Veeam RCE flaw lets domain users hack backup servers",
    "link": "https://www.bleepingcomputer.com/news/security/new-veeam-rce-flaw-lets-domain-users-hack-backup-servers/",
    "summary": "​Veeam has released security updates today to fix several Veeam Backup & Replication (VBR) flaws, including a critical remote code execution (RCE) vulnerability. [...]",
    "published": "2025-06-17T15:42:48",
    "source": "BleepingComputer"
  },
  {
    "title": "Sitecore CMS exploit chain starts with hardcoded 'b' password",
    "link": "https://www.bleepingcomputer.com/news/security/sitecore-cms-exploit-chain-starts-with-hardcoded-b-password/",
    "summary": "A chain of Sitecore Experience Platform (XP) vulnerabilities allows attackers to perform remote code execution (RCE) without authentication to breach and hijack servers. [...]",
    "published": "2025-06-17T15:10:35",
    "source": "BleepingComputer"
  },
  {
    "title": "UK fines 23andMe for ‘profoundly damaging’ breach exposing genetics data",
    "link": "https://www.bleepingcomputer.com/news/security/uk-fines-23andme-for-profoundly-damaging-breach-exposing-genetics-data/",
    "summary": "The UK Information Commissioner's Office (ICO) has fined genetic testing provider 23andMe £2.31 million ($3.12 million) over 'serious security failings' that led to a 'profoundly damaging' data breach in 2023. [...]",
    "published": "2025-06-17T14:59:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft fixes Surface Hub boot issues with emergency update",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-surface-hub-boot-issues-with-emergency-update/",
    "summary": "Microsoft has released an emergency update to fix a known issue causing startup failures for some Surface Hub v1 devices running Windows 10. [...]",
    "published": "2025-06-17T14:06:10",
    "source": "BleepingComputer"
  },
  {
    "title": "How to automate IT ticket handling with AI and Tines",
    "link": "https://www.bleepingcomputer.com/news/security/how-to-automate-it-ticket-handling-with-ai-and-tines/",
    "summary": "Tired of drowning in IT tickets? This AI-powered workflow built on Tines auto-triages common issues like known bugs & password resets—saving time for your team and speeding up resolution. Learn more about Tines and get a free account now. [...]",
    "published": "2025-06-17T14:01:11",
    "source": "BleepingComputer"
  },
  {
    "title": "Hacker steals 1 million Cock.li user records in webmail data breach",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-steals-1-million-cockli-user-records-in-webmail-data-breach/",
    "summary": "Email hosting provider Cock.li has confirmed it suffered a data breach after threat actors exploited flaws in its now-retired Roundcube webmail platform to steal over a million user records. [...]",
    "published": "2025-06-17T13:50:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Silver Fox APT Targets Taiwan with Complex Gh0stCringe and HoldingHands RAT Malware",
    "link": "https://thehackernews.com/2025/06/silver-fox-apt-targets-taiwan-with.html",
    "summary": "Cybersecurity researchers are warning of a new phishing campaign that's targeting users in Taiwan with malware families such as HoldingHands RAT and Gh0stCringe.\nThe activity is part of a broader campaign that delivered the Winos 4.0 malware framework earlier this January by sending phishing message",
    "published": "2025-06-17T13:28:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Warns of Scattered Spider Attacks Targeting IT Support Teams at U.S. Insurance Firms",
    "link": "https://thehackernews.com/2025/06/google-warns-of-scattered-spider.html",
    "summary": "The notorious cybercrime group known as Scattered Spider (aka UNC3944) that recently targeted various U.K. and U.S. retailers has begun to target major insurance companies, according to Google Threat Intelligence Group (GTIG).\n\"Google Threat Intelligence Group is now aware of multiple intrusions in ",
    "published": "2025-06-17T12:53:00",
    "source": "HackerNews"
  },
  {
    "title": "Are Forgotten AD Service Accounts Leaving You at Risk?",
    "link": "https://thehackernews.com/2025/06/are-forgotten-ad-service-accounts.html",
    "summary": "For many organizations, Active Directory (AD) service accounts are quiet afterthoughts, persisting in the background long after their original purpose has been forgotten. To make matters worse, these orphaned service accounts (created for legacy applications, scheduled tasks, automation scripts, or ",
    "published": "2025-06-17T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Hard-Coded 'b' Password in Sitecore XP Sparks Major RCE Risk in Enterprise Deployments",
    "link": "https://thehackernews.com/2025/06/hard-coded-b-password-in-sitecore-xp.html",
    "summary": "Cybersecurity researchers have disclosed three security flaws in the popular Sitecore Experience Platform (XP) that could be chained to achieve pre-authenticated remote code execution.\nSitecore Experience Platform is an enterprise-oriented software that provides users with tools for content manageme",
    "published": "2025-06-17T10:33:00",
    "source": "HackerNews"
  },
  {
    "title": "Backups Are Under Attack: How to Protect Your Backups",
    "link": "https://thehackernews.com/2025/06/how-to-protect-your-backups-from-ransomware-attacks.html",
    "summary": "Ransomware has become a highly coordinated and pervasive threat, and traditional defenses are increasingly struggling to neutralize it. Today’s ransomware attacks initially target your last line of defense — your backup infrastructure. Before locking up your production environment, cybercriminals go",
    "published": "2025-06-17T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "New Flodrix Botnet Variant Exploits Langflow AI Server RCE Bug to Launch DDoS Attacks",
    "link": "https://thehackernews.com/2025/06/new-flodrix-botnet-variant-exploits.html",
    "summary": "Cybersecurity researchers have called attention to a new campaign that's actively exploiting a recently disclosed critical security flaw in Langflow to deliver the Flodrix botnet malware.\n\"Attackers use the vulnerability to execute downloader scripts on compromised Langflow servers, which in turn fe",
    "published": "2025-06-17T09:32:00",
    "source": "HackerNews"
  }
]