[
  {
    "title": "xAI prepares Grok 4 Code as it plans to take on Claude and Gemini",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/xai-prepares-grok-4-code-as-it-plans-to-take-on-claude-and-gemini/",
    "summary": "xAI is preparing the rollout of Grok 4, which replaces Grok 3 as the new state-of-the-art model. [...]",
    "published": "2025-07-03T19:00:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Police dismantles investment fraud ring stealing €10 million",
    "link": "https://www.bleepingcomputer.com/news/legal/police-dismantles-investment-fraud-ring-stealing-10-million/",
    "summary": "The Spanish police have dismantled a large-scale investment fraud operation based in the country, which has caused cumulative damages exceeding €10 million ($11.8M). [...]",
    "published": "2025-07-03T17:53:21",
    "source": "BleepingComputer"
  },
  {
    "title": "Grafana releases critical security update for Image Renderer plugin",
    "link": "https://www.bleepingcomputer.com/news/security/grafana-releases-critical-security-update-for-image-renderer-plugin/",
    "summary": "Grafana Labs has addressed four Chromium vulnerabilities in critical security updates for the Grafana Image Renderer plugin and Synthetic Monitoring Agent. [...]",
    "published": "2025-07-03T16:16:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Big Tech’s Mixed Response to U.S. Treasury Sanctions",
    "link": "https://krebsonsecurity.com/2025/07/big-techs-mixed-response-to-u-s-treasury-sanctions/",
    "summary": "In May 2025, the U.S. government sanctioned a Chinese national for operating a cloud provider linked to the majority of virtual currency investment scam websites reported to the FBI. But more than a month later, the accused continues to openly operate accounts at a slew of American tech companies, i",
    "published": "2025-07-03T16:06:05",
    "source": "Krebs"
  },
  {
    "title": "Massive Android Fraud Operations Uncovered: IconAds, Kaleidoscope, SMS Malware, NFC Scams",
    "link": "https://thehackernews.com/2025/07/mobile-security-alert-352-iconads-fraud.html",
    "summary": "A mobile ad fraud operation dubbed IconAds that consisted of 352 Android apps has been disrupted, according to a new report from HUMAN.\nThe identified apps were designed to load out-of-context ads on a user's screen and hide their icons from the device home screen launcher, making it harder for vict",
    "published": "2025-07-03T16:02:00",
    "source": "HackerNews"
  },
  {
    "title": "IdeaLab confirms data stolen in ransomware attack last year",
    "link": "https://www.bleepingcomputer.com/news/security/idealab-confirms-data-stolen-in-ransomware-attack-last-year/",
    "summary": "IdeaLab is notifying individuals impacted by a data breach incident last October when hackers accessed sensitive information. [...]",
    "published": "2025-07-03T15:14:56",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft investigates ongoing SharePoint Online access issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-ongoing-sharepoint-online-access-issues/",
    "summary": "​Microsoft is investigating an ongoing incident causing intermittent issues for users attempting to access SharePoint Online sites. [...]",
    "published": "2025-07-03T14:53:43",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft: Exchange Server Subscription Edition now available",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-server-subscription-edition-now-available/",
    "summary": "Microsoft has announced that the Exchange Server Subscription Edition (SE) is now available to all customers of its enterprise email service. [...]",
    "published": "2025-07-03T12:03:23",
    "source": "BleepingComputer"
  },
  {
    "title": "Hunters International ransomware shuts down, releases free decryptors",
    "link": "https://www.bleepingcomputer.com/news/security/hunters-international-ransomware-shuts-down-after-world-leaks-rebrand/",
    "summary": "​The Hunters International Ransomware-as-a-Service (RaaS) operation announced today that it has officially closed down its operations and will offer free decryptors to help victims recover their data without paying a ransom. [...]",
    "published": "2025-07-03T10:53:21",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 40 Malicious Firefox Extensions Target Cryptocurrency Wallets, Stealing User Assets",
    "link": "https://thehackernews.com/2025/07/over-40-malicious-firefox-extensions.html",
    "summary": "Cybersecurity researchers have uncovered over 40 malicious browser extensions for Mozilla Firefox that are designed to steal cryptocurrency wallet secrets, putting users' digital assets at risk.\n\"These extensions impersonate legitimate wallet tools from widely-used platforms such as Coinbase, MetaMa",
    "published": "2025-07-03T10:53:00",
    "source": "HackerNews"
  }
]