[
  {
    "title": "Hunters International ransomware shuts down after World Leaks rebrand",
    "link": "https://www.bleepingcomputer.com/news/security/hunters-international-ransomware-shuts-down-after-world-leaks-rebrand/",
    "summary": "​The Hunters International Ransomware-as-a-Service (RaaS) operation announced today that it has officially closed down its operations and will offer free decryptors to help victims recover their data without paying a ransom. [...]",
    "published": "2025-07-03T10:53:21",
    "source": "BleepingComputer"
  },
  {
    "title": "The Hidden Weaknesses in AI SOC Tools that No One Talks About",
    "link": "https://thehackernews.com/2025/07/the-hidden-weaknesses-in-ai-soc-tools.html",
    "summary": "If you’re evaluating AI-powered SOC platforms, you’ve likely seen bold claims: faster triage, smarter remediation, and less noise. But under the hood, not all AI is created equal. Many solutions rely on pre-trained AI models that are hardwired for a handful of specific use cases. While that might wo",
    "published": "2025-07-03T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft asks users to ignore Windows Firewall config errors",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-asks-users-to-ignore-windows-firewall-config-errors/",
    "summary": "Microsoft asked customers this week to disregard incorrect Windows Firewall errors that appear after rebooting their systems following the installation of the June 2025 preview update. [...]",
    "published": "2025-07-03T10:02:03",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese Hackers Exploit Ivanti CSA Zero-Days in Attacks on French Government, Telecoms",
    "link": "https://thehackernews.com/2025/07/chinese-hackers-exploit-ivanti-csa-zero.html",
    "summary": "The French cybersecurity agency on Tuesday revealed that a number of entities spanning governmental, telecommunications, media, finance, and transport sectors in the country were impacted by a malicious campaign undertaken by a Chinese hacking group by weaponizing several zero-day vulnerabilities in",
    "published": "2025-07-03T09:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Critical Cisco Vulnerability in Unified CM Grants Root Access via Static Credentials",
    "link": "https://thehackernews.com/2025/07/critical-cisco-vulnerability-in-unified.html",
    "summary": "Cisco has released security updates to address a maximum-severity security flaw in Unified Communications Manager (Unified CM) and Unified Communications Manager Session Management Edition (Unified CM SME) that could permit an attacker to login to a susceptible device as the root user, allowing them",
    "published": "2025-07-03T04:24:00",
    "source": "HackerNews"
  }
]