[
  {
    "title": "CISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-tags-citrix-bleed-2-as-exploited-gives-agencies-a-day-to-patch/",
    "summary": "The U.S. Cybersecurity & Infrastructure Security Agency has confirmed active exploitation of the CitrixBleed 2 vulnerability (CVE-2025-5777) in Citrix NetScaler ADC and Gateway and is giving federal agencies one day to apply fixes. [...]",
    "published": "2025-07-11T14:45:57",
    "source": "BleepingComputer"
  },
  {
    "title": "PerfektBlue Bluetooth Vulnerabilities Expose Millions of Vehicles to Remote Code Execution",
    "link": "https://thehackernews.com/2025/07/perfektblue-bluetooth-vulnerabilities.html",
    "summary": "Cybersecurity researchers have discovered a set of four security flaws in OpenSynergy's BlueSDK Bluetooth stack that, if successfully exploited, could allow remote code execution on millions of transport vehicles from different vendors.\nThe vulnerabilities, dubbed PerfektBlue, can be fashioned toget",
    "published": "2025-07-11T12:10:00",
    "source": "HackerNews"
  },
  {
    "title": "Securing Data in the AI Era",
    "link": "https://thehackernews.com/2025/07/securing-data-in-ai-era.html",
    "summary": "The 2025 Data Risk Report: Enterprises face potentially serious data loss risks from AI-fueled tools. Adopting a unified, AI-driven approach to data security can help.\nAs businesses increasingly rely on cloud-driven platforms and AI-powered tools to accelerate digital transformation, the stakes for ",
    "published": "2025-07-11T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Critical Wing FTP Server Vulnerability (CVE-2025-47812) Actively Being Exploited in the Wild",
    "link": "https://thehackernews.com/2025/07/critical-wing-ftp-server-vulnerability.html",
    "summary": "A recently disclosed maximum-severity security flaw impacting the Wing FTP Server has come under active exploitation in the wild, according to Huntress.\nThe vulnerability, tracked as CVE-2025-47812 (CVSS score: 10.0), is a case of improper handling of null ('\\0') bytes in the server's web interface,",
    "published": "2025-07-11T10:58:00",
    "source": "HackerNews"
  },
  {
    "title": "Iranian-Backed Pay2Key Ransomware Resurfaces with 80% Profit Share for Cybercriminals",
    "link": "https://thehackernews.com/2025/07/iranian-backed-pay2key-ransomware.html",
    "summary": "An Iranian-backed ransomware-as-a-service (RaaS) named Pay2Key has resurfaced in the wake of the Israel-Iran-U.S. conflict last month, offering bigger payouts to cybercriminals who launch attacks against Israel and the U.S.\nThe financially motivated scheme, now operating under the moniker Pay2Key.I2",
    "published": "2025-07-11T10:46:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds Citrix NetScaler CVE-2025-5777 to KEV Catalog as Active Exploits Target Enterprises",
    "link": "https://thehackernews.com/2025/07/cisa-adds-citrix-netscaler-cve-2025.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a critical security flaw impacting Citrix NetScaler ADC and Gateway to its Known Exploited Vulnerabilities (KEV) catalog, officially confirming the vulnerability has been weaponized in the wild.\nThe shortcoming in que",
    "published": "2025-07-11T04:25:00",
    "source": "HackerNews"
  }
]