[
  {
    "title": "OpenAI's image model gets built-in style feature on ChatGPT",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-image-model-gets-built-in-style-feature-on-chatgpt/",
    "summary": "OpenAI's image gen model, which is available via ChatGPT for free, now lets you easily create AI images even if you're not familiar with trends or prompt engineering. [...]",
    "published": "2025-07-15T20:12:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Abacus dark web drug market goes offline in suspected exit scam",
    "link": "https://www.bleepingcomputer.com/news/security/abacus-dark-web-drug-market-goes-offline-in-suspected-exit-scam/",
    "summary": "Abacus Market, the largest Western darknet marketplace supporting Bitcoin payments, has shut down its public infrastructure in a move suspected to be an exit scam. [...]",
    "published": "2025-07-15T19:58:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows KB5064489 emergency update fixes Azure VM launch issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-kb5064489-emergency-update-fixes-azure-vm-launch-issues/",
    "summary": "Microsoft has released an emergency update to fix a bug that prevents Azure virtual machines from launching when the Trusted Launch setting is disabled and Virtualization-Based Security (VBS) is enabled. [...]",
    "published": "2025-07-15T18:47:07",
    "source": "BleepingComputer"
  },
  {
    "title": "North Korean XORIndex malware hidden in 67 malicious npm packages",
    "link": "https://www.bleepingcomputer.com/news/security/north-korean-xorindex-malware-hidden-in-67-malicious-npm-packages/",
    "summary": "North Korean threat actors planted 67 malicious packages in the Node Package Manager (npm) online repository to deliver a new malware loader called XORIndex to developer systems. [...]",
    "published": "2025-07-15T17:47:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Police disrupt “Diskstation” ransomware gang attacking NAS devices",
    "link": "https://www.bleepingcomputer.com/news/security/police-disrupt-diskstation-ransomware-gang-attacking-nas-devices/",
    "summary": "An international law enforcement action dismantled a Romanian ransomware gang known as 'Diskstation,' which encrypted the systems of several companies in the Lombardy region, paralyzing their businesses. [...]",
    "published": "2025-07-15T16:53:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Hyper-Volumetric DDoS Attacks Reach Record 7.3 Tbps, Targeting Key Global Sectors",
    "link": "https://thehackernews.com/2025/07/hyper-volumetric-ddos-attacks-reach.html",
    "summary": "Cloudflare on Tuesday said it mitigated 7.3 million distributed denial-of-service (DDoS) attacks in the second quarter of 2025, a significant drop from 20.5 million DDoS attacks it fended off the previous quarter.\n\"Overall, in Q2 2025, hyper-volumetric DDoS attacks skyrocketed,\" Omer Yoachimik and J",
    "published": "2025-07-15T16:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Newly Emerged GLOBAL GROUP RaaS Expands Operations with AI-Driven Negotiation Tools",
    "link": "https://thehackernews.com/2025/07/newly-emerged-global-group-raas-expands.html",
    "summary": "Cybersecurity researchers have shed light on a new ransomware-as-a-service (RaaS) operation called GLOBAL GROUP that has targeted a wide range of sectors in Australia, Brazil, Europe, and the United States since its emergence in early June 2025.\nGLOBAL GROUP was \"promoted on the Ramp4u forum by the ",
    "published": "2025-07-15T15:21:00",
    "source": "HackerNews"
  }
]