[
  {
    "title": "Researchers Uncover Batavia Windows Spyware Stealing Documents from Russian Firms",
    "link": "https://thehackernews.com/2025/07/researchers-uncover-batavia-windows.html",
    "summary": "Russian organizations have been targeted as part of an ongoing campaign that delivers a previously undocumented Windows spyware called Batavia.\nThe activity, per cybersecurity vendor Kaspersky, has been active since July 2024.\n\"The targeted attack begins with bait emails containing malicious links, ",
    "published": "2025-07-08T08:22:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds Four Critical Vulnerabilities to KEV Catalog Due to Active Exploitation",
    "link": "https://thehackernews.com/2025/07/cisa-adds-four-critical-vulnerabilities.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe list of flaws is as follows -\n\nCVE-2014-3931 (CVSS score: 9.8) - A buffer overflow vulner",
    "published": "2025-07-08T05:08:00",
    "source": "HackerNews"
  },
  {
    "title": "Alleged Chinese hacker tied to Silk Typhoon arrested for cyberespionage",
    "link": "https://www.bleepingcomputer.com/news/security/alleged-chinese-hacker-tied-to-silk-typhoon-arrested-for-cyberespionage/",
    "summary": "A Chinese national was arrested in Milan, Italy, last week for allegedly being linked to the state-sponsored Silk Typhoon hacking group, which responsible for cyberattacks against American organizations and government agencies. [...]",
    "published": "2025-07-08T01:39:01",
    "source": "BleepingComputer"
  },
  {
    "title": "Public exploits released for Citrix Bleed 2 NetScaler flaw, patch now",
    "link": "https://www.bleepingcomputer.com/news/security/public-exploits-released-for-citrixbleed-2-netscaler-flaw-patch-now/",
    "summary": "Researchers have released proof-of-concept (PoC) exploits for a critical Citrix NetScaler vulnerability, tracked as CVE-2025-5777 and dubbed CitrixBleed2, warning that the flaw is easily exploitable and can successfully steal user session tokens. [...]",
    "published": "2025-07-07T22:57:37",
    "source": "BleepingComputer"
  }
]