[
  {
    "title": "Signal now blocks Microsoft Recall screenshots on Windows 11",
    "link": "https://www.bleepingcomputer.com/news/security/signal-now-blocks-microsoft-recall-screenshots-on-windows-11/",
    "summary": "​Signal has updated its Windows app to protect users' privacy by blocking Microsoft's AI-powered Recall feature from taking screenshots of their conversations. [...]",
    "published": "2025-05-22T10:32:23",
    "source": "BleepingComputer"
  },
  {
    "title": "Identity Security Has an Automation Problem—And It's Bigger Than You Think",
    "link": "https://thehackernews.com/2025/05/identity-security-has-automation.html",
    "summary": "For many organizations, identity security appears to be under control. On paper, everything checks out. But new research from Cerby, based on insights from over 500 IT and security leaders, reveals a different reality: too much still depends on people—not systems—to function. In fact, fewer than 4% ",
    "published": "2025-05-22T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Unpatched critical bugs in Versa Concerto lead to auth bypass, RCE",
    "link": "https://www.bleepingcomputer.com/news/security/unpatched-critical-bugs-in-versa-concerto-lead-to-auth-bypass-rce/",
    "summary": "Critical vulnerabilities in Versa Concerto that are still unpatched could allow remote attackers to bypass authentication and execute arbitrary code on affected systems. [...]",
    "published": "2025-05-22T09:18:18",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI and Europol Disrupt Lumma Stealer Malware Network Linked to 10 Million Infections",
    "link": "https://thehackernews.com/2025/05/fbi-and-europol-disrupt-lumma-stealer.html",
    "summary": "A sprawling operation undertaken by global law enforcement agencies and a consortium of private sector firms has disrupted the online infrastructure associated with a commodity information stealer known as Lumma (aka LummaC or LummaC2), seizing 2,300 domains that acted as the command-and-control (C2",
    "published": "2025-05-22T08:24:00",
    "source": "HackerNews"
  }
]