[
  {
    "title": "Hackers turn ScreenConnect into malware using Authenticode stuffing",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-turn-screenconnect-into-malware-using-authenticode-stuffing/",
    "summary": "Threat actors are abusing the ConnectWise ScreenConnect installer to build signed remote access malware by modifying hidden settings within the client's  Authenticode signature. [...]",
    "published": "2025-06-25T21:51:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers abuse Microsoft ClickOnce and AWS services for stealthy attacks",
    "link": "https://www.bleepingcomputer.com/news/security/oneclik-attacks-use-microsoft-clickonce-and-aws-to-target-energy-sector/",
    "summary": "A sophisticated malicious campaign that researchers call OneClik has been leveraging Microsoft's ClickOnce software deployment tool and custom Golang backdoors to compromise organizations within the energy, oil, and gas sectors. [...]",
    "published": "2025-06-25T20:34:38",
    "source": "BleepingComputer"
  },
  {
    "title": "New wave of ‘fake interviews’ use 35 npm packages to spread malware",
    "link": "https://www.bleepingcomputer.com/news/security/new-wave-of-fake-interviews-use-35-npm-packages-to-spread-malware/",
    "summary": "A new wave of North Korea's 'Contagious Interview' campaign is targeting job seekers with malicious npm packages that infect dev's devices with infostealers and backdoors. [...]",
    "published": "2025-06-25T19:24:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Google releases Gemini CLI with free Gemini 2.5 Pro",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-releases-gemini-cli-with-free-gemini-25-pro/",
    "summary": "Google has released Gemini 2.5 Pro-powered Gemini CLI, which allows you to use Gemini inside your terminal, including Windows Terminal. [...]",
    "published": "2025-06-25T17:53:28",
    "source": "BleepingComputer"
  },
  {
    "title": "Citrix warns of NetScaler vulnerability exploited in DoS attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-warns-of-netscaler-vulnerability-exploited-in-dos-attacks/",
    "summary": "Citrix is warning that a vulnerability in NetScaler appliances tracked as CVE-2025-6543 is being actively exploited in the wild, causing devices to enter a denial of service condition. [...]",
    "published": "2025-06-25T17:35:55",
    "source": "BleepingComputer"
  },
  {
    "title": "nOAuth Vulnerability Still Affects 9% of Microsoft Entra SaaS Apps Two Years After Discovery",
    "link": "https://thehackernews.com/2025/06/noauth-vulnerability-still-affects-9-of.html",
    "summary": "New research has uncovered continued risk from a known security weakness in Microsoft's Entra ID, potentially enabling malicious actors to achieve account takeovers in susceptible software-as-a-service (SaaS) applications.\nIdentity security company Semperis, in an analysis of 104 SaaS applications, ",
    "published": "2025-06-25T16:56:00",
    "source": "HackerNews"
  },
  {
    "title": "WinRAR patches bug letting malware launch from extracted archives",
    "link": "https://www.bleepingcomputer.com/news/security/winrar-patches-bug-letting-malware-launch-from-extracted-archives/",
    "summary": "WinRAR has addressed a directory traversal vulnerability tracked as CVE-2025-6218 that, under certain circumstances, allows malware to be executed after extracting a malicious archive. [...]",
    "published": "2025-06-25T16:55:14",
    "source": "BleepingComputer"
  },
  {
    "title": "New 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions",
    "link": "https://www.bleepingcomputer.com/news/security/new-citrixbleed-2-netscaler-flaw-let-hackers-hijack-sessions/",
    "summary": "A recent vulnerability in Citrix NetScaler ADC and Gateway is dubbed \"CitrixBleed 2,\" after its similarity to an older exploited flaw that allowed unauthenticated attackers to hijack authentication session cookies from vulnerable devices. [...]",
    "published": "2025-06-25T16:10:37",
    "source": "BleepingComputer"
  },
  {
    "title": "Citrix Releases Emergency Patches for Actively Exploited CVE-2025-6543 in NetScaler ADC",
    "link": "https://thehackernews.com/2025/06/citrix-releases-emergency-patches-for.html",
    "summary": "Citrix has released security updates to address a critical flaw affecting NetScaler ADC that it said has been exploited in the wild.\nThe vulnerability, tracked as CVE-2025-6543, carries a CVSS score of 9.2 out of a maximum of 10.0.\nIt has been described as a case of memory overflow that could result",
    "published": "2025-06-25T14:51:00",
    "source": "HackerNews"
  },
  {
    "title": "BreachForums hacking forum operators reportedly arrested in France",
    "link": "https://www.bleepingcomputer.com/news/security/breachforums-hacking-forum-operators-reportedly-arrested-in-france/",
    "summary": "The French police have reportedly arrested five operators of the BreachForum cybercrime forum, a website used by cybercriminals to leak and sell stolen data that exposed the sensitive information of millions. [...]",
    "published": "2025-06-25T14:25:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Citrix Bleed 2 Flaw Enables Token Theft; SAP GUI Flaws Risk Sensitive Data Exposure",
    "link": "https://thehackernews.com/2025/06/citrix-bleed-2-flaw-enables-token-theft.html",
    "summary": "Cybersecurity researchers have detailed two now-patched security flaws in SAP Graphical User Interface (GUI) for Windows and Java that, if successfully exploited, could have enabled attackers to access sensitive information under certain conditions.\nThe vulnerabilities, tracked as CVE-2025-0055 and ",
    "published": "2025-06-25T13:37:00",
    "source": "HackerNews"
  },
  {
    "title": "Pro-Iranian Hacktivist Group Leaks Personal Records from the 2024 Saudi Games",
    "link": "https://thehackernews.com/2025/06/pro-iranian-hacktivist-group-leaks.html",
    "summary": "Thousands of personal records allegedly linked to athletes and visitors of the Saudi Games have been published online by a pro-Iranian hacktivist group called Cyber Fattah.\nCybersecurity company Resecurity said the breach was announced on Telegram on June 22, 2025, in the form of SQL database dumps,",
    "published": "2025-06-25T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Beware the Hidden Risk in Your Entra Environment",
    "link": "https://thehackernews.com/2025/06/beware-hidden-risk-in-your-entra.html",
    "summary": "If you invite guest users into your Entra ID tenant, you may be opening yourself up to a surprising risk.&nbsp;\nA gap in access control in Microsoft Entra’s subscription handling is allowing guest users to create and transfer subscriptions into the tenant they are invited into, while maintaining ful",
    "published": "2025-06-25T10:30:00",
    "source": "HackerNews"
  }
]