[
  {
    "title": "Europol Disrupts NoName057(16) Hacktivist Group Linked to DDoS Attacks Against Ukraine",
    "link": "https://thehackernews.com/2025/07/europol-disrupts-noname05716-hacktivist.html",
    "summary": "An international operation coordinated by Europol has disrupted the infrastructure of a pro-Russian hacktivist group known as NoName057(16) that has been linked to a string of distributed denial-of-service (DDoS) attacks against Ukraine and its allies.\nThe actions have led to the dismantling of a ma",
    "published": "2025-07-17T11:30:00",
    "source": "HackerNews"
  },
  {
    "title": "CTEM vs ASM vs Vulnerability Management: What Security Leaders Need to Know in 2025",
    "link": "https://thehackernews.com/2025/07/ctem-vs-asm-vs-vulnerability-management.html",
    "summary": "The modern-day threat landscape requires enterprise security teams to think and act beyond traditional cybersecurity measures that are purely passive and reactive, and in most cases, ineffective against emerging threats and sophisticated threat actors. Prioritizing cybersecurity means implementing m",
    "published": "2025-07-17T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hackers Target Taiwan's Semiconductor Sector with Cobalt Strike, Custom Backdoors",
    "link": "https://thehackernews.com/2025/07/chinese-hackers-target-taiwans.html",
    "summary": "The Taiwanese semiconductor industry has become the target of spear-phishing campaigns undertaken by three Chinese state-sponsored threat actors.\n\"Targets of these campaigns ranged from organizations involved in the manufacturing, design, and testing of semiconductors and integrated circuits, wider ",
    "published": "2025-07-17T07:56:00",
    "source": "HackerNews"
  },
  {
    "title": "Cisco Warns of Critical ISE Flaw Allowing Unauthenticated Attackers to Execute Root Code",
    "link": "https://thehackernews.com/2025/07/cisco-warns-of-critical-ise-flaw.html",
    "summary": "Cisco has disclosed a new maximum-severity security vulnerability impacting Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could permit an attacker to execute arbitrary code on the underlying operating system with elevated privileges.\nTracked as CVE-2025-20337",
    "published": "2025-07-17T05:37:00",
    "source": "HackerNews"
  }
]