[
  {
    "title": "Pro-Russia hacktivists bombard Dutch public orgs with DDoS attacks",
    "link": "https://www.bleepingcomputer.com/news/security/pro-russia-hacktivists-bombard-dutch-public-orgs-with-ddos-attacks/",
    "summary": "Russia-aligned hacktivists persistently target key public and private organizations in the Netherlands with distributed denial of service (DDoS) attacks, causing access problems and service disruptions. [...]",
    "published": "2025-05-01T20:04:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Ukrainian extradited to US for Nefilim ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/ukrainian-extradited-to-us-for-nefilim-ransomware-attacks/",
    "summary": "A Ukrainian national has been extradited from Spain to the United States to face charges over allegedly conducting Nefilim ransomware attacks against companies. [...]",
    "published": "2025-05-01T19:44:03",
    "source": "BleepingComputer"
  },
  {
    "title": "Harrods the next UK retailer targeted in a cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/harrods-the-next-uk-retailer-targeted-in-a-cyberattack/",
    "summary": "London's iconic department store, Harrods, has confirmed it was targeted in a cyberattack, becoming the third major UK retailer to report cyberattacks in a week following incidents at M&amp;S and the Co-op. [...]",
    "published": "2025-05-01T18:33:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Malicious PyPI packages abuse Gmail, websockets to hijack systems",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-pypi-packages-abuse-gmail-websockets-to-hijack-systems/",
    "summary": "Seven malicious PyPi packages were found using Gmail's SMTP servers and WebSockets for data exfiltration and remote command execution. [...]",
    "published": "2025-05-01T16:25:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Fake Security Plugin on WordPress Enables Remote Admin Access for Attackers",
    "link": "https://thehackernews.com/2025/05/fake-security-plugin-on-wordpress.html",
    "summary": "Cybersecurity researchers have shed light on a new campaign targeting WordPress sites that disguises the malware as a security plugin.\nThe plugin, which goes by the name \"WP-antymalwary-bot.php,\" comes with a variety of features to maintain access, hide itself from the admin dashboard, and execute r",
    "published": "2025-05-01T15:47:00",
    "source": "HackerNews"
  },
  {
    "title": "Why top SOC teams are shifting to Network Detection and Response",
    "link": "https://thehackernews.com/2025/05/why-top-soc-teams-are-shifting-to.html",
    "summary": "Security Operations Center (SOC) teams are facing a fundamentally new challenge &mdash; traditional cybersecurity tools are failing to detect advanced adversaries who have become experts at evading endpoint-based defenses and signature-based detection systems. The reality of these &ldquo;invisible i",
    "published": "2025-05-01T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Claude AI Exploited to Operate 100+ Fake Political Personas in Global Influence Campaign",
    "link": "https://thehackernews.com/2025/05/claude-ai-exploited-to-operate-100-fake.html",
    "summary": "Artificial intelligence (AI) company Anthropic has revealed that unknown threat actors leveraged its Claude chatbot for an \"influence-as-a-service\" operation to engage with authentic accounts across Facebook and X.\nThe sophisticated activity, branded as financially-motivated, is said to have used it",
    "published": "2025-05-01T11:02:00",
    "source": "HackerNews"
  },
  {
    "title": "New Research Reveals: 95% of AppSec Fixes Don’t Reduce Risk",
    "link": "https://thehackernews.com/2025/05/new-research-reveals-95-of-appsec-fixes.html",
    "summary": "For over a decade, application security teams have faced a brutal irony: the more advanced the detection tools became, the less useful their results proved to be. As alerts from static analysis tools, scanners, and CVE databases surged, the promise of better security grew more distant. In its place,",
    "published": "2025-05-01T09:44:00",
    "source": "HackerNews"
  }
]