[
  {
    "title": "Texas Dept. of Transportation breached, 300k crash records stolen",
    "link": "https://www.bleepingcomputer.com/news/security/texas-dept-of-transportation-breached-300k-crash-records-stolen/",
    "summary": "The Texas Department of Transportation (TxDOT) is warning that it suffered a data breach after a threat actor downloaded 300,000 crash records from its database. [...]",
    "published": "2025-06-10T16:25:16",
    "source": "BleepingComputer"
  },
  {
    "title": "FIN6 hackers pose as job seekers to backdoor recruiters’ devices",
    "link": "https://www.bleepingcomputer.com/news/security/fin6-hackers-pose-as-job-seekers-to-backdoor-recruiters-devices/",
    "summary": "In a twist on typical hiring-related social engineering attacks, the FIN6 hacking group impersonates job seekers to target recruiters, using convincing resumes and phishing sites to deliver malware. [...]",
    "published": "2025-06-10T15:57:13",
    "source": "BleepingComputer"
  },
  {
    "title": "Ivanti Workspace Control hardcoded key flaws expose SQL credentials",
    "link": "https://www.bleepingcomputer.com/news/security/ivanti-workspace-control-hardcoded-key-flaws-expose-sql-credentials/",
    "summary": "Ivanti has released security updates to fix three high-severity hardcoded key vulnerabilities in the company's Workspace Control (IWC) solution. [...]",
    "published": "2025-06-10T15:22:44",
    "source": "BleepingComputer"
  },
  {
    "title": "Massive Heroku outage impacts web platforms worldwide",
    "link": "https://www.bleepingcomputer.com/news/technology/massive-heroku-outage-impacts-web-platforms-worldwide/",
    "summary": "Heroku is suffering a widespread outage that has lasted over six hours, preventing developers from logging into the platform and breaking website functionality. [...]",
    "published": "2025-06-10T14:51:47",
    "source": "BleepingComputer"
  },
  {
    "title": "Rust-based Myth Stealer Malware Spread via Fake Gaming Sites Targets Chrome, Firefox Users",
    "link": "https://thehackernews.com/2025/06/rust-based-myth-stealer-malware-spread.html",
    "summary": "Cybersecurity researchers have shed light on a previously undocumented Rust-based information stealer called Myth Stealer that's being propagated via fraudulent gaming websites.\n\"Upon execution, the malware displays a fake window to appear legitimate while simultaneously decrypting and executing mal",
    "published": "2025-06-10T14:20:00",
    "source": "HackerNews"
  },
  {
    "title": "AI is a data-breach time bomb, reveals new report",
    "link": "https://www.bleepingcomputer.com/news/security/ai-is-a-data-breach-time-bomb-reveals-new-report/",
    "summary": "AI acts like Pac-Man—devouring sensitive data across clouds, apps, and copilots. Varonis analyzed 1,000 orgs and found 99% have exposed data AI can access, exposing them to data risks. [...]",
    "published": "2025-06-10T14:02:20",
    "source": "BleepingComputer"
  },
  {
    "title": "OpenAI working to fix ChatGPT outage affecting users worldwide",
    "link": "https://www.bleepingcomputer.com/news/technology/openai-working-to-fix-chatgpt-outage-affecting-users-worldwide/",
    "summary": "OpenAI is working to fix an ongoing outage impacting ChatGPT users worldwide and preventing them from accessing the chatbot on the web or via mobile and desktop apps. [...]",
    "published": "2025-06-10T13:22:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Five plead guilty to laundering $36 million stolen in investment scams",
    "link": "https://www.bleepingcomputer.com/news/security/five-plead-guilty-to-laundering-36-million-stolen-in-investment-scams/",
    "summary": "Five men from China, the United States, and Turkey pleaded guilty to their involvement in an international crime ring and laundering nearly $37 million stolen from U.S. victims in cryptocurrency investment scams carried out from Cambodia. [...]",
    "published": "2025-06-10T11:59:30",
    "source": "BleepingComputer"
  },
  {
    "title": "The Hidden Threat in Your Stack: Why Non-Human Identity Management is the Next Cybersecurity Frontier",
    "link": "https://thehackernews.com/2025/06/the-hidden-threat-in-your-stack-why-non.html",
    "summary": "Modern enterprise networks are highly complex environments that rely on hundreds of apps and infrastructure services. These systems need to interact securely and efficiently without constant human oversight, which is where non-human identities (NHIs) come in. NHIs — including application secrets, AP",
    "published": "2025-06-10T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Researcher Found Flaw to Discover Phone Numbers Linked to Any Google Account",
    "link": "https://thehackernews.com/2025/06/researcher-found-flaw-to-discover-phone.html",
    "summary": "Google has stepped in to address a security flaw that could have made it possible to brute-force an account's recovery phone number, potentially exposing them to privacy and security risks.\nThe issue, according to Singaporean security researcher \"brutecat,\" leverages an issue in the company's accoun",
    "published": "2025-06-10T10:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Rare Werewolf APT Uses Legitimate Software in Attacks on Hundreds of Russian Enterprises",
    "link": "https://thehackernews.com/2025/06/rare-werewolf-apt-uses-legitimate.html",
    "summary": "The threat actor known as Rare Werewolf (formerly Rare Wolf) has been linked to a series of cyber attacks targeting Russia and the Commonwealth of Independent States (CIS) countries.\n\"A distinctive feature of this threat is that the attackers favor using legitimate third-party software over developi",
    "published": "2025-06-10T07:48:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds Erlang SSH and Roundcube Flaws to Known Exploited Vulnerabilities Catalog",
    "link": "https://thehackernews.com/2025/06/cisa-adds-erlang-ssh-and-roundcube.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added two critical security flaws impacting Erlang/Open Telecom Platform (OTP) SSH and Roundcube to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question ",
    "published": "2025-06-10T05:37:00",
    "source": "HackerNews"
  }
]