[
  {
    "title": "U.S. warns of Iranian cyber threats on critical infrastructure",
    "link": "https://www.bleepingcomputer.com/news/security/us-warns-of-iranian-cyber-threats-on-critical-infrastructure/",
    "summary": "U.S. cyber agencies, the FBI, and NSA issued an urgent warning today about potential cyberattacks from Iranian-affiliated hackers targeting U.S. critical infrastructure. [...]",
    "published": "2025-06-30T22:24:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Germany asks Google, Apple to remove DeepSeek AI from app stores",
    "link": "https://www.bleepingcomputer.com/news/security/germany-asks-google-apple-remove-deepseek-ai-from-app-stores/",
    "summary": "The Berlin Commissioner for Data Protection has formally requested Google and Apple to remove the DeepSeek AI application from the application stores due to GDPR violations. [...]",
    "published": "2025-06-30T18:03:31",
    "source": "BleepingComputer"
  },
  {
    "title": "Senator Chides FBI for Weak Advice on Mobile Security",
    "link": "https://krebsonsecurity.com/2025/06/senator-chides-fbi-for-weak-advice-on-mobile-security/",
    "summary": "Agents with the Federal Bureau of Investigation (FBI) briefed Capitol Hill staff recently on hardening the security of their mobile devices, after a contacts list stolen from the personal phone of the White House Chief of Staff Susie Wiles was reportedly used to fuel a series of text messages and ph",
    "published": "2025-06-30T17:33:59",
    "source": "Krebs"
  },
  {
    "title": "U.S. Agencies Warn of Rising Iranian Cyberattacks on Defense, OT Networks, and Critical Infrastructure",
    "link": "https://thehackernews.com/2025/06/us-agencies-warn-of-rising-iranian.html",
    "summary": "U.S. cybersecurity and intelligence agencies have issued a joint advisory warning of potential cyber-attacks from Iranian state-sponsored or affiliated threat actors.&nbsp;\n\"Over the past several months, there has been increasing activity from hacktivists and Iranian government-affiliated actors, wh",
    "published": "2025-06-30T16:29:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Defender for Office 365 now blocks email bombing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-defender-for-office-365-now-blocks-email-bombing-attacks/",
    "summary": "Microsoft says its Defender for Office 365 cloud-based email security suite will now automatically detect and block email bombing attacks. [...]",
    "published": "2025-06-30T16:04:20",
    "source": "BleepingComputer"
  },
  {
    "title": "Switzerland says government data stolen in ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/switzerland-says-government-data-stolen-in-ransomware-attack/",
    "summary": "The government in Switzerland is informing that sensitive information from various federal offices has been impacted by a ransomware attack at the third-party organization Radix. [...]",
    "published": "2025-06-30T15:39:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Europol Dismantles $540 Million Cryptocurrency Fraud Network, Arrests Five Suspects",
    "link": "https://thehackernews.com/2025/06/europol-dismantles-540-million.html",
    "summary": "Europol on Monday announced the takedown of a cryptocurrency investment fraud ring that laundered €460 million ($540 million) from more than 5,000 victims across the world.\nThe operation, the agency said, was carried out by the Spanish Guardia Civil, along with support from law enforcement authoriti",
    "published": "2025-06-30T15:17:00",
    "source": "HackerNews"
  },
  {
    "title": "Hikvision Canada ordered to cease operations over security risks",
    "link": "https://www.bleepingcomputer.com/news/security/hikvision-canada-ordered-to-cease-operations-over-security-risks/",
    "summary": "The Canadian government has ordered Hikvision's subsidiary in the country to cease all operations following a review that determined them to pose a national security risk. [...]",
    "published": "2025-06-30T14:11:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft warns of Windows update delays due to wrong timestamp",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-Windows-security-update-delays-due-to-incorrect-metadata-timestamp/",
    "summary": "Microsoft has confirmed a new known issue causing delivery delays for June 2025 Windows security updates due to an incorrect metadata timestamp. [...]",
    "published": "2025-06-30T13:48:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Blind Eagle Uses Proton66 Hosting for Phishing, RAT Deployment on Colombian Banks",
    "link": "https://thehackernews.com/2025/06/blind-eagle-uses-proton66-hosting-for.html",
    "summary": "The threat actor known as Blind Eagle has been attributed with high confidence to the use of the Russian bulletproof hosting service Proton66.\nTrustwave SpiderLabs, in a report published last week, said it was able to make this connection by pivoting from Proton66-linked digital assets, leading to t",
    "published": "2025-06-30T13:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Europol helps disrupt $540 million crypto investment fraud ring",
    "link": "https://www.bleepingcomputer.com/news/security/europol-helps-disrupt-540-million-crypto-investment-fraud-ring/",
    "summary": "Spanish authorities have arrested five individuals in Madrid and the Canary Islands, suspected of laundering $540 million (€460 million) from illegal cryptocurrency investment schemes and defrauding more than 5,000 victims. [...]",
    "published": "2025-06-30T13:20:58",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI: Cybercriminals steal health data posing as fraud investigators",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-warns-cybercriminals-steal-health-data-posing-as-fraud-investigators/",
    "summary": "The Federal Bureau of Investigation (FBI) has warned Americans of cybercriminals impersonating health fraud investigators to steal their sensitive information. [...]",
    "published": "2025-06-30T12:42:01",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 1,200 Citrix servers unpatched against critical auth bypass flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-1-200-citrix-servers-unpatched-against-critical-auth-bypass-flaw/",
    "summary": "Over 1,200 Citrix NetScaler ADC and NetScaler Gateway appliances exposed online are unpatched against a critical vulnerability believed to be actively exploited, allowing threat actors to bypass authentication by hijacking user sessions. [...]",
    "published": "2025-06-30T11:47:38",
    "source": "BleepingComputer"
  }
]