[
  {
    "title": "Co-op confirms data of 6.5 million members stolen in cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/co-op-confirms-data-of-65-million-members-stolen-in-cyberattack/",
    "summary": "UK retailer Co-op has confirmed that personal data of 6.5 million members was stolen in the massive cyberattack in April that shut down systems and caused food shortages in its grocery stores. [...]",
    "published": "2025-07-16T22:29:27",
    "source": "BleepingComputer"
  },
  {
    "title": "U.S. Army soldier pleads guilty to extorting 10 tech, telecom firms",
    "link": "https://www.bleepingcomputer.com/news/security/us-army-soldier-pleads-guilty-to-extorting-10-tech-telecom-firms/",
    "summary": "A 21-year old former U.S. Army soldier pleaded guilty to charges of hacking and extorting at least ten telecommunications and technology companies in the country. [...]",
    "published": "2025-07-16T21:00:28",
    "source": "BleepingComputer"
  },
  {
    "title": "Louis Vuitton says regional data breaches tied to same cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/louis-vuitton-says-regional-data-breaches-tied-to-same-cyberattack/",
    "summary": "Luxury fashion giant Louis Vuitton confirmed that breaches impacting customers in the UK, South Korea, and Turkey stem from the same security incident, which is believed to be linked to the ShinyHunters extortion group. [...]",
    "published": "2025-07-16T19:26:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Leverage Microsoft Teams to Spread Matanbuchus 3.0 Malware to Targeted Firms",
    "link": "https://thehackernews.com/2025/07/hackers-leverage-microsoft-teams-to.html",
    "summary": "Cybersecurity researchers have flagged a new variant of a known malware loader called Matanbuchus that packs in significant features to enhance its stealth and evade detection.\nMatanbuchus is the name given to a malware-as-a-service (MaaS) offering that can act as a conduit for next-stage payloads, ",
    "published": "2025-07-16T17:48:00",
    "source": "HackerNews"
  },
  {
    "title": "Cloudflare says 1.1.1.1 outage not caused by attack or BGP hijack",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-says-1111-outage-not-caused-by-attack-or-bgp-hijack/",
    "summary": "To quash speculation of a cyberattack or BGP hijack incident causing the recent 1.1.1.1 Resolver service outage, Cloudflare explains in a post mortem that the incident was caused by an internal misconfiguration. [...]",
    "published": "2025-07-16T16:49:29",
    "source": "BleepingComputer"
  }
]