[
  {
    "title": "FTC approves $126 million in Fortnite refunds over ‘dark patterns’",
    "link": "https://www.bleepingcomputer.com/news/legal/ftc-approves-126-million-in-fortnite-refunds-over-dark-patterns/",
    "summary": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwanted purchases. [...]",
    "published": "2025-06-26T20:27:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Brother printer bug in 689 models exposes default admin passwords",
    "link": "https://www.bleepingcomputer.com/news/security/brother-printer-bug-in-689-models-exposes-default-admin-passwords/",
    "summary": "A total of 689 printer models from Brother, along with 53 other models from Fujifilm, Toshiba, and Konica Minolta, come with a default administrator password that remote attackers can generate. Even worse, there is no way to fix the flaw via firmware in existing printers. [...]",
    "published": "2025-06-26T18:10:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Open VSX Registry Flaw Exposes Millions of Developers to Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/06/critical-open-vsx-registry-flaw-exposes.html",
    "summary": "Cybersecurity researchers have disclosed a critical vulnerability in the Open VSX Registry (\"open-vsx[.]org\") that, if successfully exploited, could have enabled attackers to take control of the entire Visual Studio Code extensions marketplace, posing a severe supply chain risk.\n\"This vulnerability ",
    "published": "2025-06-26T16:46:00",
    "source": "HackerNews"
  },
  {
    "title": "Ex-student charged over hacking university for cheap parking, data breaches",
    "link": "https://www.bleepingcomputer.com/news/security/ex-student-charged-over-hacking-university-for-cheap-parking-data-breaches/",
    "summary": "New South Wales police in Australia have arrested a 27-year-old former Western Sydney University (WSU) student for allegedly hacking into the University's systems on multiple occasions, starting with a scheme to obtain cheaper parking. [...]",
    "published": "2025-06-26T16:24:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Cisco warns of max severity RCE flaws in Identity Services Engine",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-max-severity-rce-flaws-in-identity-services-engine/",
    "summary": "Cisco has published a bulletin to warn about two critical, unauthenticated remote code execution (RCE) vulnerabilities affecting Cisco Identity Services Engine (ISE) and the Passive Identity Connector (ISE-PIC). [...]",
    "published": "2025-06-26T15:20:56",
    "source": "BleepingComputer"
  },
  {
    "title": "Man pleads guilty to hacking networks to pitch security services",
    "link": "https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-networks-to-pitch-security-services/",
    "summary": "A Kansas City man has pleaded guilty to hacking multiple organizations to advertise his cybersecurity services, the U.S. Department of Justice announced on Wednesday. [...]",
    "published": "2025-06-26T14:03:40",
    "source": "BleepingComputer"
  },
  {
    "title": "3 key takeaways from the Scattered Spider attacks on insurance firms",
    "link": "https://www.bleepingcomputer.com/news/security/3-key-takeaways-from-the-scattered-spider-attacks-on-insurance-firms/",
    "summary": "Scattered Spider recently pivoted from targeting worldwide retailers to U.S. based insurance firms, with no signs of slowing down. Learn about Scattered Spider TTPs and how to defend your organization against MFA bypass, help desk scams, and more. [...]",
    "published": "2025-06-26T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical RCE Flaws in Cisco ISE and ISE-PIC Allow Unauthenticated Attackers to Gain Root Access",
    "link": "https://thehackernews.com/2025/06/critical-rce-flaws-in-cisco-ise-and-ise.html",
    "summary": "Cisco has released updates to address two maximum-severity security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) that could permit an unauthenticated attacker to execute arbitrary commands as the root user.\nThe vulnerabilities, assigned the CVE identifiers CVE",
    "published": "2025-06-26T13:24:00",
    "source": "HackerNews"
  },
  {
    "title": "New FileFix Method Emerges as a Threat Following 517% Rise in ClickFix Attacks",
    "link": "https://thehackernews.com/2025/06/new-filefix-method-emerges-as-threat.html",
    "summary": "The ClickFix social engineering tactic as an initial access vector using fake CAPTCHA verifications increased by 517% between the second half of 2024 and the first half of this year, according to data from ESET.\n\"The list of threats that ClickFix attacks lead to is growing by the day, including info",
    "published": "2025-06-26T13:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft 365 'Direct Send' abused to send phishing as internal users",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-365-direct-send-abused-to-send-phishing-as-internal-users/",
    "summary": "An ongoing phishing campaign abuses a little‑known feature in Microsoft 365 called \"Direct Send\" to evade detection by email security and steal credentials. [...]",
    "published": "2025-06-26T13:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "The Hidden Risks of SaaS: Why Built-In Protections Aren't Enough for Modern Data Resilience",
    "link": "https://thehackernews.com/2025/06/the-hidden-risks-of-saas-why-built-in.html",
    "summary": "SaaS Adoption is Skyrocketing, Resilience Hasn’t Kept Pace\nSaaS platforms have revolutionized how businesses operate. They simplify collaboration, accelerate deployment, and reduce the overhead of managing infrastructure. But with their rise comes a subtle, dangerous assumption: that the convenience",
    "published": "2025-06-26T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft fixes Outlook bug causing crashes when opening emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-bug-causing-crashes-when-opening-emails/",
    "summary": "Microsoft has fixed a known issue that will cause the classic Outlook email client to crash when opening emails or starting a new message. [...]",
    "published": "2025-06-26T10:26:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft confirms Family Safety blocks Google Chrome from launching",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-family-safety-blocks-google-chrome-from-launching/",
    "summary": "Microsoft has confirmed that its Family Safety parental control service is blocking users from launching Google Chrome and other web browsers on Windows systems. [...]",
    "published": "2025-06-26T09:50:18",
    "source": "BleepingComputer"
  }
]