[
  {
    "title": "Iranian APT35 Hackers Targeting Israeli Tech Experts with AI-Powered Phishing Attacks",
    "link": "https://thehackernews.com/2025/06/iranian-apt35-hackers-targeting-israeli.html",
    "summary": "An Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (IRGC) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security experts, and computer science professors in Israel.\n\"In some of those campaigns, Israeli technology an",
    "published": "2025-06-26T08:45:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA: AMI MegaRAC bug enabling server hijacks exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-ami-megarac-bug-that-lets-hackers-brick-servers-now-actively-exploited/",
    "summary": "CISA says a maximum severity vulnerability in AMI's MegaRAC Baseboard Management Controller (BMC) software, which enables attackers to hijack and brick servers, is currently under active exploitation. [...]",
    "published": "2025-06-26T08:38:05",
    "source": "BleepingComputer"
  },
  {
    "title": "Cyber Criminals Exploit Open-Source Tools to Compromise Financial Institutions Across Africa",
    "link": "https://thehackernews.com/2025/06/cyber-criminals-exploit-open-source.html",
    "summary": "Cybersecurity researchers are calling attention to a series of cyber attacks targeting financial organizations across Africa since at least July 2023 using a mix of open-source and publicly available tools to maintain access.\nPalo Alto Networks Unit 42 is tracking the activity under the moniker CL-C",
    "published": "2025-06-26T07:19:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds 3 Flaws to KEV Catalog, Impacting AMI MegaRAC, D-Link, Fortinet",
    "link": "https://thehackernews.com/2025/06/cisa-adds-3-flaws-to-kev-catalog.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added three security flaws, each impacting AMI MegaRAC, D-Link DIR-859 router, and Fortinet FortiOS, to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe list of vulnerabiliti",
    "published": "2025-06-26T06:02:00",
    "source": "HackerNews"
  },
  {
    "title": "WhatsApp Adds AI-Powered Message Summaries for Faster Chat Previews",
    "link": "https://thehackernews.com/2025/06/whatsapp-adds-ai-powered-message.html",
    "summary": "Popular messaging platform WhatsApp has added a new artificial intelligence (AI)-powered feature that leverages its in-house solution Meta AI to summarize unread messages in chats.\nThe feature, called Message Summaries, is currently rolling out in the English language to users in the United States, ",
    "published": "2025-06-26T04:36:00",
    "source": "HackerNews"
  },
  {
    "title": "Hacker 'IntelBroker' charged in US for global data theft breaches",
    "link": "https://www.bleepingcomputer.com/news/security/british-hacker-intelbroker-charged-with-25m-in-cybercrime-damages/",
    "summary": "A British national known online as \"IntelBroker\" has been charged by the U.S. for stealing and selling sensitive data from dozens of victims, causing an estimated $25 million in damages. [...]",
    "published": "2025-06-25T23:54:22",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers turn ScreenConnect into malware using Authenticode stuffing",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-turn-screenconnect-into-malware-using-authenticode-stuffing/",
    "summary": "Threat actors are abusing the ConnectWise ScreenConnect installer to build signed remote access malware by modifying hidden settings within the client's  Authenticode signature. [...]",
    "published": "2025-06-25T21:51:46",
    "source": "BleepingComputer"
  }
]