[
  {
    "title": "No, the 16 billion credentials leak is not a new data breach",
    "link": "https://www.bleepingcomputer.com/news/security/no-the-16-billion-credentials-leak-is-not-a-new-data-breach/",
    "summary": "News broke today of a \"mother of all breaches,\" sparking wide media coverage filled with warnings and fear-mongering. However, it appears to be a compilation of previously leaked credentials stolen by infostealers, exposed in data breaches, and via credential stuffing attacks. [...]",
    "published": "2025-06-19T21:51:41",
    "source": "BleepingComputer"
  },
  {
    "title": "Godfather Android malware now uses virtualization to hijack banking apps",
    "link": "https://www.bleepingcomputer.com/news/security/godfather-android-malware-now-uses-virtualization-to-hijack-banking-apps/",
    "summary": "A new version of the Android malware \"Godfather\" creates isolated virtual environments on mobile devices to steal account data and transactions from legitimate banking apps. [...]",
    "published": "2025-06-19T19:54:28",
    "source": "BleepingComputer"
  },
  {
    "title": "New Android Malware Surge Hits Devices via Overlays, Virtualization Fraud and NFC Theft",
    "link": "https://thehackernews.com/2025/06/new-android-malware-surge-hits-devices.html",
    "summary": "Cybersecurity researchers have exposed the inner workings of an Android malware called AntiDot that has compromised over 3,775 devices as part of 273 unique campaigns.\n\"Operated by the financially motivated threat actor LARVA-398, AntiDot is actively sold as a Malware-as-a-Service (MaaS) on undergro",
    "published": "2025-06-19T17:23:00",
    "source": "HackerNews"
  },
  {
    "title": "Webinar: Stolen credentials are the new front door to your network",
    "link": "https://www.bleepingcomputer.com/news/security/webinar-stolen-credentials-are-the-new-front-door-to-your-network/",
    "summary": "Cybercriminals no longer need zero-days to breach your systems—these days, they just log in. Join BleepingComputer, SC Media, and Specops Software's Darren Siegel on July 9 at 2:00 PM ET for a live webinar on how attackers are using stolen credentials to infiltrate networks and how you can stop them",
    "published": "2025-06-19T16:33:21",
    "source": "BleepingComputer"
  },
  {
    "title": "OpenAI’s Sam Altman discusses GPT-5 release date",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-sam-altman-discusses-gpt-5-release-date/",
    "summary": "ChatGPT's next big upgrade, or the new foundational model \"GPT-5,\" is still being prepared for a release in the summer, but OpenAI won't share the specifics. [...]",
    "published": "2025-06-19T15:43:06",
    "source": "BleepingComputer"
  }
]