[
  {
    "title": "Windows KB5064489 emergency update fixes Azure VM launch issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-kb5064489-emergency-update-fixes-azure-vm-launch-issues/",
    "summary": "Microsoft has released an emergency update to fix a bug that prevents Azure virtual machines from launching when the Trusted Launch setting is disabled and Virtualization-Based Security (VBS) is enabled. [...]",
    "published": "2025-07-15T18:47:07",
    "source": "BleepingComputer"
  },
  {
    "title": "North Korean XORIndex malware hidden in 67 malicious npm packages",
    "link": "https://www.bleepingcomputer.com/news/security/north-korean-xorindex-malware-hidden-in-67-malicious-npm-packages/",
    "summary": "North Korean threat actors planted 67 malicious packages in the Node Package Manager (npm) online repository to deliver a new malware loader called XORIndex to developer systems. [...]",
    "published": "2025-07-15T17:47:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Police disrupt “Diskstation” ransomware gang attacking NAS devices",
    "link": "https://www.bleepingcomputer.com/news/security/police-disrupt-diskstation-ransomware-gang-attacking-nas-devices/",
    "summary": "An international law enforcement action dismantled a Romanian ransomware gang known as 'Diskstation,' which encrypted the systems of several companies in the Lombardy region, paralyzing their businesses. [...]",
    "published": "2025-07-15T16:53:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Hyper-Volumetric DDoS Attacks Reach Record 7.3 Tbps, Targeting Key Global Sectors",
    "link": "https://thehackernews.com/2025/07/hyper-volumetric-ddos-attacks-reach.html",
    "summary": "Cloudflare on Tuesday said it mitigated 7.3 million distributed denial-of-service (DDoS) attacks in the second quarter of 2025, a significant drop from 20.5 million DDoS attacks it fended off the previous quarter.\n\"Overall, in Q2 2025, hyper-volumetric DDoS attacks skyrocketed,\" Omer Yoachimik and J",
    "published": "2025-07-15T16:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Newly Emerged GLOBAL GROUP RaaS Expands Operations with AI-Driven Negotiation Tools",
    "link": "https://thehackernews.com/2025/07/newly-emerged-global-group-raas-expands.html",
    "summary": "Cybersecurity researchers have shed light on a new ransomware-as-a-service (RaaS) operation called GLOBAL GROUP that has targeted a wide range of sectors in Australia, Brazil, Europe, and the United States since its emergence in early June 2025.\nGLOBAL GROUP was \"promoted on the Ramp4u forum by the ",
    "published": "2025-07-15T15:21:00",
    "source": "HackerNews"
  },
  {
    "title": "Android malware Konfety uses malformed APKs to evade detection",
    "link": "https://www.bleepingcomputer.com/news/security/android-malware-konfety-uses-malformed-apks-to-evade-detection/",
    "summary": "A new variant of the Konfety Android malware emerged with a malformed ZIP structure along with other obfuscation methods that allow it to evade analysis and detection. [...]",
    "published": "2025-07-15T13:10:36",
    "source": "BleepingComputer"
  },
  {
    "title": "OpenAI's ChatGPT-powered browser is codenamed 'Aura'",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-chatgpt-powered-browser-is-codenamed-aura/",
    "summary": "OpenAI is following Perplexity and is working on its own AI-powered browser codenamed \"Aura.\" [...]",
    "published": "2025-07-15T11:30:21",
    "source": "BleepingComputer"
  },
  {
    "title": "State-Backed HazyBeacon Malware Uses AWS Lambda to Steal Data from SE Asian Governments",
    "link": "https://thehackernews.com/2025/07/state-backed-hazybeacon-malware-uses.html",
    "summary": "Governmental organizations in Southeast Asia are the target of a new campaign that aims to collect sensitive information by means of a previously undocumented Windows backdoor dubbed HazyBeacon.\nThe activity is being tracked by Palo Alto Networks Unit 42 under the moniker CL-STA-1020, where \"CL\" sta",
    "published": "2025-07-15T11:08:00",
    "source": "HackerNews"
  },
  {
    "title": "Securing Agentic AI: How to Protect the Invisible Identity Access",
    "link": "https://thehackernews.com/2025/07/securing-agentic-ai-how-to-protect.html",
    "summary": "AI agents promise to automate everything from financial reconciliations to incident response. Yet every time an AI agent spins up a workflow, it has to authenticate somewhere; often with a high-privilege API key, OAuth token, or service account that defenders can’t easily see. These “invisible” non-",
    "published": "2025-07-15T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "AsyncRAT's Open-Source Code Sparks Surge in Dangerous Malware Variants Across the Globe",
    "link": "https://thehackernews.com/2025/07/asyncrats-open-source-code-sparks-surge.html",
    "summary": "Cybersecurity researchers have charted the evolution of a widely used remote access trojan called AsyncRAT, which was first released on GitHub in January 2019 and has since served as the foundation for several other variants.\n\"AsyncRAT has cemented its place as a cornerstone of modern malware and as",
    "published": "2025-07-15T10:53:00",
    "source": "HackerNews"
  }
]