[
  {
    "title": "5 BCDR Essentials for Effective Ransomware Defense",
    "link": "https://thehackernews.com/2025/05/top-5-bcdr-capabilities-for-ransomware-defense.html",
    "summary": "Ransomware has evolved into a deceptive, highly coordinated and dangerously sophisticated threat capable of crippling organizations of any size. Cybercriminals now exploit even legitimate IT tools to infiltrate networks and launch ransomware attacks. In a chilling example, Microsoft recently disclos",
    "published": "2025-05-15T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Russia-Linked APT28 Exploited MDaemon Zero-Day to Hack Government Webmail Servers",
    "link": "https://thehackernews.com/2025/05/russia-linked-apt28-exploited-mdaemon.html",
    "summary": "A Russia-linked threat actor has been attributed to a cyber espionage operation targeting webmail servers such as Roundcube, Horde, MDaemon, and Zimbra via cross-site scripting (XSS) vulnerabilities, including a then-zero-day in MDaemon, according to new findings from ESET.\nThe activity, which comme",
    "published": "2025-05-15T10:05:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious npm Package Leverages Unicode Steganography, Google Calendar as C2 Dropper",
    "link": "https://thehackernews.com/2025/05/malicious-npm-package-leverages-unicode.html",
    "summary": "Cybersecurity researchers have discovered a malicious package named \"os-info-checker-es6\" that disguises itself as an operating system information utility to stealthily drop a next-stage payload onto compromised systems.\n\"This campaign employs clever Unicode-based steganography to hide its initial m",
    "published": "2025-05-15T10:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Google fixes high severity Chrome flaw with public exploit",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-high-severity-chrome-flaw-with-public-exploit/",
    "summary": "Google has released emergency security updates to patch a high-severity Chrome vulnerability that has a public exploit and can let attackers hijack accounts. [...]",
    "published": "2025-05-15T08:25:44",
    "source": "BleepingComputer"
  },
  {
    "title": "New Chrome Vulnerability Enables Cross-Origin Data Leak via Loader Referrer Policy",
    "link": "https://thehackernews.com/2025/05/new-chrome-vulnerability-enables-cross.html",
    "summary": "Google on Wednesday released updates to address four security issues in its Chrome web browser, including one for which it said there exists an exploit in the wild.\nThe high-severity vulnerability, tracked as CVE-2025-4664 (CVSS score: 4.3), has been characterized as a case of insufficient policy en",
    "published": "2025-05-15T06:15:00",
    "source": "HackerNews"
  }
]