[
  {
    "title": "Hackers now testing ClickFix attacks against Linux targets",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-now-testing-clickfix-attacks-against-linux-targets/",
    "summary": "A new campaign employing ClickFix attacks has been spotted targeting both Windows and Linux systems using instructions that make infections on either operating system possible. [...]",
    "published": "2025-05-12T18:10:29",
    "source": "BleepingComputer"
  },
  {
    "title": "Output Messenger flaw exploited as zero-day in espionage attacks",
    "link": "https://www.bleepingcomputer.com/news/security/output-messenger-flaw-exploited-as-zero-day-in-espionage-attacks/",
    "summary": "A Türkiye-backed cyberespionage group exploited a zero-day vulnerability to attack Output Messenger users linked to the Kurdish military in Iraq. [...]",
    "published": "2025-05-12T17:34:44",
    "source": "BleepingComputer"
  },
  {
    "title": "Moldova arrests suspect linked to DoppelPaymer ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/moldova-arrests-suspect-linked-to-doppelpaymer-ransomware-attacks/",
    "summary": "Moldovan authorities have detained a 45-year-old suspect linked to DoppelPaymer ransomware attacks targeting Dutch organizations in 2021. [...]",
    "published": "2025-05-12T15:18:57",
    "source": "BleepingComputer"
  },
  {
    "title": "Google to pay $1.375 billion to settle Texas data privacy violations",
    "link": "https://www.bleepingcomputer.com/news/legal/google-to-pay-1375-billion-to-settle-texas-data-privacy-violations/",
    "summary": "Google has agreed to a $1.375 billion settlement with the state of Texas over a 2022 lawsuit that alleged it had been collecting and using biometric data of millions of Texans without properly acquiring their consent. [...]",
    "published": "2025-05-12T15:02:54",
    "source": "BleepingComputer"
  },
  {
    "title": "Majority of Browser Extensions Pose Critical Security Risk, A New Report Reveals",
    "link": "https://www.bleepingcomputer.com/news/security/majority-of-browser-extensions-pose-critical-security-risk-a-new-report-reveals/",
    "summary": "99% of enterprise users have browser extensions but over half carry high-risk permissions. LayerX's 2025 report reveals how everyday extensions expose sensitive data, and what security teams must do now. [...]",
    "published": "2025-05-12T14:36:25",
    "source": "BleepingComputer"
  },
  {
    "title": "ASUS Patches DriverHub RCE Flaws Exploitable via HTTP and Crafted .ini Files",
    "link": "https://thehackernews.com/2025/05/asus-patches-driverhub-rce-flaws.html",
    "summary": "ASUS has released updates to address two security flaws impacting ASUS DriverHub that, if successfully exploited, could enable an attacker to leverage the software in order to achieve remote code execution.\nDriverHub is a tool that's designed to automatically detect the motherboard model of a comput",
    "published": "2025-05-12T14:03:00",
    "source": "HackerNews"
  },
  {
    "title": "⚡ Weekly Recap: Zero-Day Exploits, Developer Malware, IoT Botnets, and AI-Powered Scams",
    "link": "https://thehackernews.com/2025/05/weekly-recap-zero-day-exploits.html",
    "summary": "What do a source code editor, a smart billboard, and a web server have in common? They’ve all become launchpads for attacks—because cybercriminals are rethinking what counts as “infrastructure.” Instead of chasing high-value targets directly, threat actors are now quietly taking over the overlooked:",
    "published": "2025-05-12T12:10:00",
    "source": "HackerNews"
  },
  {
    "title": "The Persistence Problem: Why Exposed Credentials Remain Unfixed—and How to Change That",
    "link": "https://thehackernews.com/2025/05/the-persistence-problem-why-exposed.html",
    "summary": "Detecting leaked credentials is only half the battle. The real challenge—and often the neglected half of the equation—is what happens after detection. New research from GitGuardian's State of Secrets Sprawl 2025 report reveals a disturbing trend: the vast majority of exposed company secrets discover",
    "published": "2025-05-12T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Fake AI Tools Used to Spread Noodlophile Malware, Targeting 62,000+ via Facebook Lures",
    "link": "https://thehackernews.com/2025/05/fake-ai-tools-used-to-spread.html",
    "summary": "Threat actors have been observed leveraging fake artificial intelligence (AI)-powered tools as a lure to entice users into downloading an information stealer malware dubbed Noodlophile.\n\"Instead of relying on traditional phishing or cracked software sites, they build convincing AI-themed platforms –",
    "published": "2025-05-12T07:26:00",
    "source": "HackerNews"
  }
]