[
  {
    "title": "Google Rolls Out On-Device AI Protections to Detect Scams in Chrome and Android",
    "link": "https://thehackernews.com/2025/05/google-rolls-out-on-device-ai.html",
    "summary": "Google on Thursday announced it's rolling out new artificial intelligence (AI)-powered countermeasures to combat scams across Chrome, Search, and Android.\nThe tech giant said it will begin using Gemini Nano, its on-device large language model (LLM), to improve Safe Browsing in Chrome 137 on desktops",
    "published": "2025-05-09T07:13:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hackers Exploit SAP RCE Flaw CVE-2025-31324, Deploy Golang-Based SuperShell",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-sap-rce-flaw.html",
    "summary": "A China-linked unnamed threat actor dubbed Chaya_004 has been observed exploiting a recently disclosed security flaw in SAP NetWeaver.\nForescout Vedere Labs, in a report published Thursday, said it uncovered a malicious infrastructure likely associated with the hacking group weaponizing CVE-2025-313",
    "published": "2025-05-09T04:29:00",
    "source": "HackerNews"
  },
  {
    "title": "FBI: End-of-life routers hacked for cybercrime proxy networks",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-end-of-life-routers-hacked-for-cybercrime-proxy-networks/",
    "summary": "The FBI warns that threat actors are deploying malware on end-of-life (EoL) routers to convert them into proxies sold on the 5Socks and Anyproxy networks. [...]",
    "published": "2025-05-08T22:15:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Cisco fixes max severity IOS XE flaw letting attackers hijack devices",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-fixes-max-severity-ios-xe-flaw-letting-attackers-hijack-devices/",
    "summary": "Cisco has fixed a maximum severity flaw in IOS XE Software for Wireless LAN Controllers by a hard-coded JSON Web Token (JWT) that allows an unauthenticated remote attacker to take over devices. [...]",
    "published": "2025-05-08T20:53:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Education giant Pearson hit by cyberattack exposing customer data",
    "link": "https://www.bleepingcomputer.com/news/security/education-giant-pearson-hit-by-cyberattack-exposing-customer-data/",
    "summary": "Education giant Pearson suffered a cyberattack, allowing threat actors to steal corporate data and customer information, BleepingComputer has learned. [...]",
    "published": "2025-05-08T20:14:09",
    "source": "BleepingComputer"
  }
]