[
  {
    "title": "China-linked Salt Typhoon Exploits Critical Cisco Vulnerability to Target Canadian Telecom",
    "link": "https://thehackernews.com/2025/06/china-linked-salt-typhoon-exploits.html",
    "summary": "The Canadian Centre for Cyber Security and the U.S. Federal Bureau of Investigation (FBI) have issued an advisory warning of cyber attacks mounted by the China-linked Salt Typhoon actors to breach major global telecommunications providers as part of a cyber espionage campaign.\nThe attackers exploite",
    "published": "2025-06-24T03:00:00",
    "source": "HackerNews"
  },
  {
    "title": "APT28 hackers use Signal chats to launch new malware attacks on Ukraine",
    "link": "https://www.bleepingcomputer.com/news/security/apt28-hackers-use-signal-chats-to-launch-new-malware-attacks-on-ukraine/",
    "summary": "The Russian state-sponsored threat group APT28 is using Signal chats to target government targets in Ukraine with two previously undocumented malware families named BeardShell and SlimAgent. [...]",
    "published": "2025-06-23T22:14:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Malware on Google Play, Apple App Store stole your photos—and crypto",
    "link": "https://www.bleepingcomputer.com/news/security/malware-on-google-play-app-store-stole-your-photos-and-crypto/",
    "summary": "A new mobile crypto-stealing malware called SparkKitty was found in apps on Google Play and the Apple App Store, targeting Android and iOS devices. [...]",
    "published": "2025-06-23T16:44:56",
    "source": "BleepingComputer"
  },
  {
    "title": "US Homeland Security warns of escalating Iranian cyberattack risks",
    "link": "https://www.bleepingcomputer.com/news/security/us-homeland-security-warns-of-escalating-iranian-cyberattack-risks/",
    "summary": "The U.S. Department of Homeland Security (DHS) warned over the weekend of escalating cyberattack risks by Iran-backed hacking groups and pro-Iranian hacktivists. [...]",
    "published": "2025-06-23T16:22:37",
    "source": "BleepingComputer"
  }
]