[
  {
    "title": "Scattered Spider hackers shift focus to aviation, transportation firms",
    "link": "https://www.bleepingcomputer.com/news/security/scattered-spider-hackers-shift-focus-to-aviation-transportation-firms/",
    "summary": "Hackers associated with Scattered Spider tactics have expanded their targeting to the aviation and transportation industries after previously attacking insurance and retail sectors [...]",
    "published": "2025-06-27T18:20:58",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 1,000 SOHO Devices Hacked in China-linked LapDogs Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2025/06/over-1000-soho-devices-hacked-in-china.html",
    "summary": "Threat hunters have discovered a network of more than 1,000 compromised small office and home office (SOHO) devices that have been used to facilitate a prolonged cyber espionage infrastructure campaign for China-nexus hacking groups.\nThe Operational Relay Box (ORB) network has been codenamed LapDogs",
    "published": "2025-06-27T15:58:00",
    "source": "HackerNews"
  },
  {
    "title": "Russia’s throttling of Cloudflare makes sites inaccessible",
    "link": "https://www.bleepingcomputer.com/news/technology/russias-throttling-of-cloudflare-makes-sites-inaccessible/",
    "summary": "Starting June 9, 2025, Russian internet service providers (ISPs) have begun throttling access to websites and services protected by Cloudflare, an American internet giant. [...]",
    "published": "2025-06-27T15:47:15",
    "source": "BleepingComputer"
  },
  {
    "title": "Citrix Bleed 2 flaw now believed to be exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-bleed-2-flaw-now-believed-to-be-exploited-in-attacks/",
    "summary": "A critical NetScaler ADC and Gateway vulnerability dubbed \"Citrix Bleed 2\" (CVE-2025-5777) is now likely exploited in attacks, according to cybersecurity firm ReliaQuest, seeing an increase in suspicious sessions on Citrix devices. [...]",
    "published": "2025-06-27T14:18:09",
    "source": "BleepingComputer"
  },
  {
    "title": "PUBLOAD and Pubshell Malware Used in Mustang Panda's Tibet-Specific Attack",
    "link": "https://thehackernews.com/2025/06/pubload-and-pubshell-malware-used-in.html",
    "summary": "A China-linked threat actor known as Mustang Panda has been attributed to a new cyber espionage campaign directed against the Tibetan community.\nThe spear-phishing attacks leveraged topics related to Tibet, such as the 9th World Parliamentarians' Convention on Tibet (WPCT), China's education policy ",
    "published": "2025-06-27T13:25:00",
    "source": "HackerNews"
  }
]