[
  {
    "title": "Education giant Pearson hit by cyberattack exposing customer data",
    "link": "https://www.bleepingcomputer.com/news/security/education-giant-pearson-hit-by-cyberattack-exposing-customer-data/",
    "summary": "Education giant Pearson suffered a cyberattack, allowing threat actors to steal corporate data and customer information, BleepingComputer has learned. [...]",
    "published": "2025-05-08T20:14:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Supply chain attack hits npm package with 45,000 weekly downloads",
    "link": "https://www.bleepingcomputer.com/news/security/supply-chain-attack-hits-npm-package-with-45-000-weekly-downloads/",
    "summary": "An npm package named 'rand-user-agent' has been compromised in a supply chain attack to inject obfuscated code that activates a remote access trojan (RAT) on the user's system. [...]",
    "published": "2025-05-08T19:03:24",
    "source": "BleepingComputer"
  },
  {
    "title": "Malicious PyPi package hides RAT malware, targets Discord devs since 2022",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-pypi-package-hides-rat-malware-targets-discord-devs-since-2022/",
    "summary": "A malicious Python package targeting Discord developers with remote access trojan (RAT) malware was spotted on the Python Package Index (PyPI) after more than three years. [...]",
    "published": "2025-05-08T18:51:14",
    "source": "BleepingComputer"
  },
  {
    "title": "Kickidler employee monitoring software abused in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/kickidler-employee-monitoring-software-abused-in-ransomware-attacks/",
    "summary": "Ransomware operations are using legitimate Kickidler employee monitoring software for reconnaissance, tracking their victims' activity, and harvesting credentials after breaching their networks. [...]",
    "published": "2025-05-08T16:05:18",
    "source": "BleepingComputer"
  },
  {
    "title": "38,000+ FreeDrain Subdomains Found Exploiting SEO to Steal Crypto Wallet Seed Phrases",
    "link": "https://thehackernews.com/2025/05/38000-freedrain-subdomains-found.html",
    "summary": "Cybersecurity researchers have exposed what they say is an \"industrial-scale, global cryptocurrency phishing operation\" engineered to steal digital assets from cryptocurrency wallets for several years.\nThe campaign has been codenamed FreeDrain by threat intelligence firms SentinelOne and Validin.\n\"F",
    "published": "2025-05-08T15:23:00",
    "source": "HackerNews"
  },
  {
    "title": "VC giant Insight Partners confirms investor data stolen in breach",
    "link": "https://www.bleepingcomputer.com/news/security/vc-giant-insight-partners-confirms-investor-data-stolen-in-breach/",
    "summary": "Venture capital firm Insight Partners has confirmed that sensitive data for employees and limited partners was stolen in a January 2025 cyberattack. [...]",
    "published": "2025-05-08T15:01:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Security Tools Alone Don't Protect You — Control Effectiveness Does",
    "link": "https://thehackernews.com/2025/05/security-tools-alone-dont-protect-you.html",
    "summary": "61% of security leaders reported suffering a breach due to failed or misconfigured controls over the past 12 months. This is despite having an average of 43 cybersecurity tools in place.\nThis massive rate of security failure is clearly not a security investment problem. It is a configuration problem",
    "published": "2025-05-08T14:00:00",
    "source": "HackerNews"
  },
  {
    "title": "SonicWall Patches 3 Flaws in SMA 100 Devices Allowing Attackers to Run Code as Root",
    "link": "https://thehackernews.com/2025/05/sonicwall-patches-3-flaws-in-sma-100.html",
    "summary": "SonicWall has released patches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\nThe vulnerabilities are listed below -\n\nCVE-2025-32819 (CVSS score: 8.8) - A vulnerability in SMA100 allows a remote auth",
    "published": "2025-05-08T13:56:00",
    "source": "HackerNews"
  },
  {
    "title": "Qilin Ransomware Ranked Highest in April 2025 with Over 45 Data Leak Disclosures",
    "link": "https://thehackernews.com/2025/05/qilin-leads-april-2025-ransomware-spike.html",
    "summary": "Threat actors with ties to the Qilin ransomware family have leveraged malware known as SmokeLoader along with a previously undocumented .NET compiled loader codenamed NETXLOADER as part of a campaign observed in November 2024.\n\"NETXLOADER is a new .NET-based loader that plays a critical role in cybe",
    "published": "2025-05-08T13:47:00",
    "source": "HackerNews"
  },
  {
    "title": "Google links new LostKeys data theft malware to Russian cyberspies",
    "link": "https://www.bleepingcomputer.com/news/security/google-links-new-lostkeys-data-theft-malware-to-russian-cyberspies/",
    "summary": "Since the start of the year, the Russian state-backed ColdRiver hacking group has been using new LostKeys malware to steal files in espionage attacks targeting Western governments, journalists, think tanks, and non-governmental organizations. [...]",
    "published": "2025-05-08T13:39:15",
    "source": "BleepingComputer"
  },
  {
    "title": "SonicWall urges admins to patch VPN flaw exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-urges-admins-to-patch-vpn-flaw-exploited-in-attacks/",
    "summary": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks [...]",
    "published": "2025-05-08T11:19:58",
    "source": "BleepingComputer"
  },
  {
    "title": "MirrorFace Targets Japan and Taiwan with ROAMINGMOUSE and Upgraded ANEL Malware",
    "link": "https://thehackernews.com/2025/05/mirrorface-targets-japan-and-taiwan.html",
    "summary": "The nation-state threat actor known as MirrorFace has been observed deploying malware dubbed ROAMINGMOUSE as part of a cyber espionage campaign directed against government agencies and public institutions in Japan and Taiwan.\nThe activity, detected by Trend Micro in March 2025, involved the use of s",
    "published": "2025-05-08T10:32:00",
    "source": "HackerNews"
  }
]