[
  {
    "title": "Indian Court Orders Action to Block Proton Mail Over AI Deepfake Abuse Allegations",
    "link": "https://thehackernews.com/2025/04/indian-court-orders-action-to-block.html",
    "summary": "A high court in the Indian state of Karnataka has ordered the blocking of end-to-end encrypted email provider Proton Mail across the country.\nThe High Court of Karnataka, on April 29, said the ruling was in response to a legal complaint filed by M Moser Design Associated India Pvt Ltd in January 202",
    "published": "2025-04-30T04:45:00",
    "source": "HackerNews"
  },
  {
    "title": "Grinex exchange suspected rebrand of sanctioned Garantex crypto firm",
    "link": "https://www.bleepingcomputer.com/news/cryptocurrency/grinex-exchange-suspected-rebrand-of-sanctioned-garantex-crypto-firm/",
    "summary": "A new cryptocurrency exchange named Grinex is believed to be a rebrand of Garantex, a Russian cryptocurrency exchange whose domains were seized by the U.S. authorities and an admin arrested. [...]",
    "published": "2025-04-29T20:21:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft: Windows Server hotpatching to require subscription",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-server-hotpatching-to-require-subscription/",
    "summary": "Microsoft has announced it will require paid subscriptions for Windows Server 2025 hotpatching, a service that enables admins to install security updates without restarting. [...]",
    "published": "2025-04-29T19:47:15",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers ramp up scans for leaked Git tokens and secrets",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-ramp-up-scans-for-leaked-git-tokens-and-secrets/",
    "summary": "Threat actors are intensifying internet-wide scanning for Git configuration files that can reveal sensitive secrets and authentication tokens used to compromise cloud services and source code repositories. [...]",
    "published": "2025-04-29T19:02:43",
    "source": "BleepingComputer"
  },
  {
    "title": "France ties Russian APT28 hackers to 12 cyberattacks on French orgs",
    "link": "https://www.bleepingcomputer.com/news/security/france-ties-russian-apt28-hackers-to-12-cyberattacks-on-french-orgs/",
    "summary": "Today, the French foreign ministry blamed the APT28 hacking group linked to Russia's military intelligence service (GRU) for targeting or breaching a dozen French entities over the last four years. [...]",
    "published": "2025-04-29T18:57:15",
    "source": "BleepingComputer"
  }
]