[
  {
    "title": "Zero-click AI data leak flaw uncovered in Microsoft 365 Copilot",
    "link": "https://www.bleepingcomputer.com/news/security/zero-click-ai-data-leak-flaw-uncovered-in-microsoft-365-copilot/",
    "summary": "A new attack dubbed 'EchoLeak' is the first known zero-click AI vulnerability that enables attackers to exfiltrate sensitive data from Microsoft 365 Copilot from a user's context without interaction. [...]",
    "published": "2025-06-11T17:48:50",
    "source": "BleepingComputer"
  },
  {
    "title": "Former Black Basta Members Use Microsoft Teams and Python Scripts in 2025 Attacks",
    "link": "https://thehackernews.com/2025/06/former-black-basta-members-use.html",
    "summary": "Former members tied to the Black Basta ransomware operation have been observed sticking to their tried-and-tested approach of email bombing and Microsoft Teams phishing to establish persistent access to target networks.\n\"Recently, attackers have introduced Python script execution alongside these tec",
    "published": "2025-06-11T17:44:00",
    "source": "HackerNews"
  },
  {
    "title": "Hackers exploited Windows WebDav zero-day to drop malware",
    "link": "https://www.bleepingcomputer.com/news/security/stealth-falcon-hackers-exploited-windows-webdav-zero-day-to-drop-malware/",
    "summary": "An APT hacking group known as 'Stealth Falcon' exploited a Windows WebDav RCE vulnerability in zero-day attacks since March 2025 against defense and government organizations in Turkey, Qatar, Egypt, and Yemen. [...]",
    "published": "2025-06-11T15:47:27",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft creates separate Windows 11 24H2 update for incompatible PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-creates-separate-windows-11-24h2-update-for-incompatible-pcs/",
    "summary": "Microsoft confirmed on Tuesday that it's pushing a revised security update targeting some Windows 11 24H2 systems incompatible with the initial update released during this month's Patch Tuesday. [...]",
    "published": "2025-06-11T15:35:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Brute-force attacks target Apache Tomcat management panels",
    "link": "https://www.bleepingcomputer.com/news/security/brute-force-attacks-target-apache-tomcat-management-panels/",
    "summary": "A coordinated campaign of brute-force attacks using hundreds of unique IP addresses targets Apache Tomcat Manager interfaces exposed online. [...]",
    "published": "2025-06-11T14:27:36",
    "source": "BleepingComputer"
  },
  {
    "title": "Operation Secure disrupts global infostealer malware operations",
    "link": "https://www.bleepingcomputer.com/news/security/operation-secure-disrupts-global-infostealer-malware-operations/",
    "summary": "An international law enforcement action codenamed \"Operation Secure\" targeted infostealer malware infrastructure in a massive crackdown across 26 countries, resulting in 32 arrests, data seizures, and server takedowns. [...]",
    "published": "2025-06-11T13:51:49",
    "source": "BleepingComputer"
  },
  {
    "title": "295 Malicious IPs Launch Coordinated Brute-Force Attacks on Apache Tomcat Manager",
    "link": "https://thehackernews.com/2025/06/295-malicious-ips-launch-coordinated.html",
    "summary": "Threat intelligence firm GreyNoise has warned of a \"coordinated brute-force activity\" targeting Apache Tomcat Manager interfaces.\nThe company said it observed a surge in brute-force and login attempts on June 5, 2025, an indication that they could be deliberate efforts to \"identify and access expose",
    "published": "2025-06-11T13:49:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft fixes unreachable Windows Server domain controllers",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-unreachable-windows-server-domain-controllers/",
    "summary": "Microsoft has resolved a known issue that caused some Windows Server 2025 domain controllers to become unreachable after a restart and triggered app or service failures. [...]",
    "published": "2025-06-11T13:21:03",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft fixes Windows Server auth issues caused by April updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-auth-issues-caused-by-april-updates/",
    "summary": "Microsoft has fixed a known issue causing authentication problems on Windows Server domain controllers after installing the April 2025 security updates. [...]",
    "published": "2025-06-11T12:34:06",
    "source": "BleepingComputer"
  },
  {
    "title": "INTERPOL Dismantles 20,000+ Malicious IPs Linked to 69 Malware Variants in Operation Secure",
    "link": "https://thehackernews.com/2025/06/interpol-dismantles-20000-malicious-ips.html",
    "summary": "INTERPOL on Wednesday announced the dismantling of more than 20,000 malicious IP addresses or domains that have been linked to 69 information-stealing malware variants.\nThe joint action, codenamed Operation Secure, took place between January and April 2025, and involved law enforcement agencies from",
    "published": "2025-06-11T11:32:00",
    "source": "HackerNews"
  },
  {
    "title": "Why DNS Security Is Your First Defense Against Cyber Attacks?",
    "link": "https://thehackernews.com/2025/06/why-dns-security-is-your-first-defense.html",
    "summary": "In today’s cybersecurity landscape, much of the focus is placed on firewalls, antivirus software, and endpoint detection. While these tools are essential, one critical layer often goes overlooked: the Domain Name System (DNS). As the starting point of nearly every online interaction, DNS is not only",
    "published": "2025-06-11T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "SinoTrack GPS Devices Vulnerable to Remote Vehicle Control via Default Passwords",
    "link": "https://thehackernews.com/2025/06/sinotrack-gps-devices-vulnerable-to.html",
    "summary": "Two security vulnerabilities have been disclosed in SinoTrack GPS devices that could be exploited to control certain remote functions on connected vehicles and even track their locations.\n\"Successful exploitation of these vulnerabilities could allow an attacker to access device profiles without auth",
    "published": "2025-06-11T10:28:00",
    "source": "HackerNews"
  },
  {
    "title": "How to Build a Lean Security Model: 5 Lessons from River Island",
    "link": "https://thehackernews.com/2025/06/how-to-build-lean-security-model-5.html",
    "summary": "In today&rsquo;s security landscape, budgets are tight, attack surfaces are sprawling, and new threats emerge daily. Maintaining a strong security posture under these circumstances without a large team or budget can be a real challenge. Yet lean security models are not only possible - they can be hi",
    "published": "2025-06-11T10:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Patches 67 Vulnerabilities Including WEBDAV Zero-Day Exploited in the Wild",
    "link": "https://thehackernews.com/2025/06/microsoft-patches-67-vulnerabilities.html",
    "summary": "Microsoft has released patches to fix 67 security flaws, including one zero-day bug in Web Distributed Authoring and Versioning (WebDAV) that it said has come under active exploitation in the wild.\nOf the 67 vulnerabilities, 11 are rated Critical and 56 are rated Important in severity. This includes",
    "published": "2025-06-11T07:46:00",
    "source": "HackerNews"
  }
]