[
  {
    "title": "Gigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot",
    "link": "https://www.bleepingcomputer.com/news/security/gigabyte-motherboards-vulnerable-to-uefi-malware-bypassing-secure-boot/",
    "summary": "Dozens of Gigabyte motherboard models run on UEFI firmware vulnerable to security issues that allow planting bootkit malware that is invisible to the operating system and can survive reinstalls. [...]",
    "published": "2025-07-14T16:30:32",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: Scattered Spider Arrests, Car Exploits, macOS Malware, Fortinet RCE and More",
    "link": "https://thehackernews.com/2025/07/weekly-recap-scattered-spider-arrests.html",
    "summary": "In cybersecurity, precision matters—and there’s little room for error. A small mistake, missed setting, or quiet misconfiguration can quickly lead to much bigger problems. The signs we’re seeing this week highlight deeper issues behind what might look like routine incidents: outdated tools, slow res",
    "published": "2025-07-14T12:52:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious VSCode extension in Cursor IDE led to $500K crypto theft",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-vscode-extension-in-cursor-ide-led-to-500k-crypto-theft/",
    "summary": "A fake extension for the Cursor AI IDE code editor infected devices with remote access tools and infostealers, which, in one case, led to the theft of $500,000 in cryptocurrency from a Russian crypto developer. [...]",
    "published": "2025-07-14T12:26:34",
    "source": "BleepingComputer"
  },
  {
    "title": "CBI Shuts Down £390K U.K. Tech Support Scam, Arrests Key Operatives in Noida Call Center",
    "link": "https://thehackernews.com/2025/07/cbi-shuts-down-390k-uk-tech-support.html",
    "summary": "India's Central Bureau of Investigation (CBI) has announced that it has taken steps to dismantle what it said was a transnational cybercrime syndicate that carried out \"sophisticated\" tech support scams targeting citizens of Australia and the United Kingdom.\nThe fraudulent scheme is estimated to hav",
    "published": "2025-07-14T08:00:00",
    "source": "HackerNews"
  },
  {
    "title": "eSIM Vulnerability in Kigen's eUICC Cards Exposes Billions of IoT Devices to Malicious Attacks",
    "link": "https://thehackernews.com/2025/07/esim-vulnerability-in-kigens-euicc.html",
    "summary": "Cybersecurity researchers have discovered a new hacking technique that exploits weaknesses in the eSIM technology used in modern smartphones, exposing users to severe risks.\nThe issues impact the Kigen eUICC card. According to the Irish company's website, more than two billion SIMs in IoT devices ha",
    "published": "2025-07-14T05:27:00",
    "source": "HackerNews"
  }
]