[
  {
    "title": "BitoPro exchange links Lazarus hackers to $11 million crypto heist",
    "link": "https://www.bleepingcomputer.com/news/security/bitopro-exchange-links-lazarus-hackers-to-11-million-crypto-heist/",
    "summary": "The Taiwanese cryptocurrency exchange BitoPro claims the North Korean hacking group Lazarus is behind a cyberattack that led to the theft of $11,000,000 worth of cryptocurrency on May 8, 2025. [...]",
    "published": "2025-06-20T17:54:41",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft investigates OneDrive bug that breaks file search",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-onedrive-bug-that-breaks-file-search/",
    "summary": "​Microsoft is investigating a known OneDrive issue that is causing searches to appear blank for some users or return no results even when searching for files they know they've already uploaded. [...]",
    "published": "2025-06-20T16:39:54",
    "source": "BleepingComputer"
  },
  {
    "title": "Qilin Ransomware Adds \"Call Lawyer\" Feature to Pressure Victims for Larger Ransoms",
    "link": "https://thehackernews.com/2025/06/qilin-ransomware-adds-call-lawyer.html",
    "summary": "The threat actors behind the Qilin ransomware-as-a-service (RaaS) scheme are now offering legal counsel for affiliates to put more pressure on victims to pay up, as the cybercrime group intensifies its activity and tries to fill the void left by its rivals.\nThe new feature takes the form of a \"Call ",
    "published": "2025-06-20T16:35:00",
    "source": "HackerNews"
  },
  {
    "title": "Cloudflare blocks record 7.3 Tbps DDoS attack against hosting provider",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-blocks-record-73-tbps-ddos-attack-against-hosting-provider/",
    "summary": "Cloudflare says it mitigated a record-breaking distributed denial of service (DDoS) attack in May 2025 that peaked at 7.3 Tbps, targeting a hosting provider. [...]",
    "published": "2025-06-20T15:54:10",
    "source": "BleepingComputer"
  },
  {
    "title": "Aflac discloses breach amidst Scattered Spider insurance attacks",
    "link": "https://www.bleepingcomputer.com/news/security/aflac-discloses-breach-amidst-scattered-spider-insurance-attacks/",
    "summary": "On Friday, American insurance giant Aflac disclosed that its systems were breached in a broader campaign targeting insurance companies across the United States by attackers who may have stolen personal and health information. [...]",
    "published": "2025-06-20T14:52:05",
    "source": "BleepingComputer"
  },
  {
    "title": "Can users reset their own passwords without sacrificing security?",
    "link": "https://www.bleepingcomputer.com/news/security/can-users-reset-their-own-passwords-without-sacrificing-security/",
    "summary": "Self-service password resets (SSPR) reduce helpdesk strain—but without strong security, they can open the door to attackers. Learn why phishing-resistant MFA, context-aware verification, and risk-based detection are critical to secure SSPR implementation. [...]",
    "published": "2025-06-20T14:01:11",
    "source": "BleepingComputer"
  }
]