[
  {
    "title": "Malware on Google Play, Apple App Store stole your photos—and crypto",
    "link": "https://www.bleepingcomputer.com/news/security/malware-on-google-play-app-store-stole-your-photos-and-crypto/",
    "summary": "A new mobile crypto-stealing malware called SparkKitty was found in apps on Google Play and the Apple App Store, targeting Android and iOS devices. [...]",
    "published": "2025-06-23T16:44:56",
    "source": "BleepingComputer"
  },
  {
    "title": "US Homeland Security warns of escalating Iranian cyberattack risks",
    "link": "https://www.bleepingcomputer.com/news/security/us-homeland-security-warns-of-escalating-iranian-cyberattack-risks/",
    "summary": "The U.S. Department of Homeland Security (DHS) warned over the weekend of escalating cyberattack risks by Iran-backed hacking groups and pro-Iranian hacktivists. [...]",
    "published": "2025-06-23T16:22:37",
    "source": "BleepingComputer"
  },
  {
    "title": "Echo Chamber Jailbreak Tricks LLMs Like OpenAI and Google into Generating Harmful Content",
    "link": "https://thehackernews.com/2025/06/echo-chamber-jailbreak-tricks-llms-like.html",
    "summary": "Cybersecurity researchers are calling attention to a new jailbreaking method called Echo Chamber that could be leveraged to trick popular large language models (LLMs) into generating undesirable responses, irrespective of the safeguards put in place.\n\"Unlike traditional jailbreaks that rely on adver",
    "published": "2025-06-23T15:58:00",
    "source": "HackerNews"
  },
  {
    "title": "Canada says Salt Typhoon hacked telecom firm via Cisco flaw",
    "link": "https://www.bleepingcomputer.com/news/security/canada-says-salt-typhoon-hacked-telecom-firm-via-cisco-flaw/",
    "summary": "The Canadian Centre for Cyber Security and the FBI confirm that the Chinese state-sponsored 'Salt Typhoon' hacking group is also targeting Canadian telecommunication firms, breaching a telecom provider in February. [...]",
    "published": "2025-06-23T15:23:44",
    "source": "BleepingComputer"
  },
  {
    "title": "DHS Warns Pro-Iranian Hackers Likely to Target U.S. Networks After Iranian Nuclear Strikes",
    "link": "https://thehackernews.com/2025/06/dhs-warns-pro-iranian-hackers-likely-to.html",
    "summary": "The United States government has warned of cyber attacks mounted by pro-Iranian groups after it launched airstrikes on Iranian nuclear sites as part of the Iran–Israel war that commenced on June 13, 2025.\nStating that the ongoing conflict has created a \"heightened threat environment\" in the country,",
    "published": "2025-06-23T15:14:00",
    "source": "HackerNews"
  },
  {
    "title": "Revil ransomware members released after time served on carding charges",
    "link": "https://www.bleepingcomputer.com/news/security/revil-hackers-released-after-time-served-on-carding-charges/",
    "summary": "Four REvil ransomware members arrested in January 2022 were released by Russia on time served after they pleaded guilty to carding and malware distribution charges. [...]",
    "published": "2025-06-23T15:12:14",
    "source": "BleepingComputer"
  },
  {
    "title": "McLaren Health Care says data breach impacts 743,000 patients",
    "link": "https://www.bleepingcomputer.com/news/security/mclaren-health-care-says-data-breach-impacts-743-000-patients/",
    "summary": "McLaren Health Care is warning 743,000 patients that the health system suffered a data breach caused by a July 2024 attack by the INC ransomware gang. [...]",
    "published": "2025-06-23T14:28:31",
    "source": "BleepingComputer"
  },
  {
    "title": "XDigo Malware Exploits Windows LNK Flaw in Eastern European Government Attacks",
    "link": "https://thehackernews.com/2025/06/xdigo-malware-exploits-windows-lnk-flaw.html",
    "summary": "Cybersecurity researchers have uncovered a Go-based malware called XDigo that has been used in attacks targeting Eastern European governmental entities in March 2025.\nThe attack chains are said to have leveraged a collection of Windows shortcut (LNK) files as part of a multi-stage procedure to deplo",
    "published": "2025-06-23T13:12:00",
    "source": "HackerNews"
  },
  {
    "title": "Steel giant Nucor confirms hackers stole data in recent breach",
    "link": "https://www.bleepingcomputer.com/news/security/steel-giant-nucor-confirms-hackers-stole-data-in-recent-breach/",
    "summary": "Nucor, North America's largest steel producer and recycler, has confirmed that attackers behind a recent cybersecurity incident have also stolen data from the company's network. [...]",
    "published": "2025-06-23T12:28:42",
    "source": "BleepingComputer"
  },
  {
    "title": "How AI-Enabled Workflow Automation Can Help SOCs Reduce Burnout",
    "link": "https://thehackernews.com/2025/06/how-ai-enabled-workflow-automation-can.html",
    "summary": "It sure is a hard time to be a SOC analyst. \nEvery day, they are expected to solve high-consequence problems with half the data and twice the pressure. Analysts are overwhelmed—not just by threats, but by the systems and processes in place that are meant to help them respond. Tooling is fragmented. ",
    "published": "2025-06-23T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Adds Multi-Layered Defenses to Secure GenAI from Prompt Injection Attacks",
    "link": "https://thehackernews.com/2025/06/google-adds-multi-layered-defenses-to.html",
    "summary": "Google has revealed the various safety measures that are being incorporated into its generative artificial intelligence (AI) systems to mitigate emerging attack vectors like indirect prompt injections and improve the overall security posture for agentic AI systems.\n\"Unlike direct prompt injections, ",
    "published": "2025-06-23T10:46:00",
    "source": "HackerNews"
  }
]