[
  {
    "title": "The Crowded Battle: Key Insights from the 2025 State of Pentesting Report",
    "link": "https://thehackernews.com/2025/05/the-crowded-battle-key-insights-from.html",
    "summary": "In the newly released 2025 State of Pentesting Report, Pentera surveyed 500 CISOs from global enterprises (200 from within the USA) to understand the strategies, tactics, and tools they use to cope with the thousands of security alerts, the persisting breaches and the growing cyber risks they have t",
    "published": "2025-05-20T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Chinese Hackers Deploy MarsSnake Backdoor in Multi-Year Attack on Saudi Organization",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-deploy-marssnake.html",
    "summary": "Threat hunters have exposed the tactics of a China-aligned threat actor called UnsolicitedBooker that targeted an unnamed international organization in Saudi Arabia with a previously undocumented backdoor dubbed MarsSnake.\nESET, which first discovered the hacking group's intrusions targeting the ent",
    "published": "2025-05-20T09:32:00",
    "source": "HackerNews"
  },
  {
    "title": "Go-Based Malware Deploys XMRig Miner on Linux Hosts via Redis Configuration Abuse",
    "link": "https://thehackernews.com/2025/05/go-based-malware-deploys-xmrig-miner-on.html",
    "summary": "Cybersecurity researchers are calling attention to a new Linux cryptojacking campaign that's targeting publicly accessible Redis servers.\nThe malicious activity has been codenamed RedisRaider by Datadog Security Labs.\n\"RedisRaider aggressively scans randomized portions of the IPv4 space and uses leg",
    "published": "2025-05-20T08:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Malicious PyPI Packages Exploit Instagram and TikTok APIs to Validate User Accounts",
    "link": "https://thehackernews.com/2025/05/malicious-pypi-packages-exploit.html",
    "summary": "Cybersecurity researchers have uncovered malicious packages uploaded to the Python Package Index (PyPI) repository that act as checker tools to validate stolen email addresses against TikTok and Instagram APIs.\nAll three packages are no longer available on PyPI. The names of the Python packages are ",
    "published": "2025-05-20T05:49:00",
    "source": "HackerNews"
  }
]