[
  {
    "title": "ServiceNow Flaw CVE-2025-3648 Could Lead to Data Exposure via Misconfigured ACLs",
    "link": "https://thehackernews.com/2025/07/servicenow-flaw-cve-2025-3648-could.html",
    "summary": "A high-severity security flaw has been disclosed in ServiceNow's platform that, if successfully exploited, could result in data exposure and exfiltration.\nThe vulnerability, tracked as CVE-2025-3648 (CVSS score: 8.2), has been described as a case of data inference in Now Platform through conditional",
    "published": "2025-07-10T07:24:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft Authenticator on iOS moves backups fully to iCloud",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-authenticator-on-ios-moves-backups-fully-to-icloud/",
    "summary": "Microsoft is rolling out a new backup system in September for its Authenticator app on iOS, removing the requirement to use a Microsoft personal account to back up TOTP secrets and account names. [...]",
    "published": "2025-07-09T22:37:27",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-windows-server-update-services-wsus-sync-is-broken/",
    "summary": "Microsoft has confirmed a widespread issue in Windows Server Update Services (WSUS) that prevents organizations from syncing with Microsoft Update and deploying the latest Windows updates. [...]",
    "published": "2025-07-09T20:58:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Qantas confirms data breach impacts 5.7 million customers",
    "link": "https://www.bleepingcomputer.com/news/security/qantas-confirms-data-breach-impacts-57-million-customers/",
    "summary": "Australian airline Qantas has confirmed that 5.7 million people have been impacted by a recent data breach, in which threat actors stole customers' data. [...]",
    "published": "2025-07-09T20:14:28",
    "source": "BleepingComputer"
  }
]