[
  {
    "title": "Microsoft Teams voice calls abused to push Matanbuchus malware",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-teams-voice-calls-abused-to-push-matanbuchus-malware/",
    "summary": "The Matanbuchus malware loader has been seen being distributed through social engineering over Microsoft Teams calls impersonating IT helpdesk. [...]",
    "published": "2025-07-17T21:28:31",
    "source": "BleepingComputer"
  },
  {
    "title": "Google sues to disrupt BadBox 2.0 botnet infecting 10 million devices",
    "link": "https://www.bleepingcomputer.com/news/security/google-sues-to-disrupt-badbox-20-botnet-infecting-10-million-devices/",
    "summary": "Google has filed a lawsuit against the anonymous operators of the Android BadBox 2.0 malware botnet, accusing them of running a global ad fraud scheme against the company's advertising platforms. [...]",
    "published": "2025-07-17T19:59:26",
    "source": "BleepingComputer"
  },
  {
    "title": "LameHug malware uses AI LLM to craft Windows data-theft commands in real-time",
    "link": "https://www.bleepingcomputer.com/news/security/lamehug-malware-uses-ai-llm-to-craft-windows-data-theft-commands-in-real-time/",
    "summary": "A novel malware family named LameHug is using a large language model (LLM) to generate commands to be executed on compromised Windows systems. [...]",
    "published": "2025-07-17T18:57:20",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Use GitHub Repositories to Host Amadey Malware and Data Stealers, Bypassing Filters",
    "link": "https://thehackernews.com/2025/07/hackers-use-github-repositories-to-host.html",
    "summary": "Threat actors are leveraging public GitHub repositories to host malicious payloads and distribute them via Amadey as part of a campaign observed in April 2025.\n\"The MaaS [malware-as-a-service] operators used fake GitHub accounts to host payloads, tools, and Amadey plug-ins, likely as an attempt to b",
    "published": "2025-07-17T17:40:00",
    "source": "HackerNews"
  },
  {
    "title": "Hacker steals $27 million in BigONE exchange crypto breach",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-steals-27-million-in-bigone-exchange-crypto-breach/",
    "summary": "Cryptocurrency exchange BigONE announced that it suffered a security breach, in which hackers stole various digital assets valued at $27 million. [...]",
    "published": "2025-07-17T16:54:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese hackers breached National Guard to steal network configurations",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-breached-national-guard-to-steal-network-configurations/",
    "summary": "The Chinese state-sponsored hacking group known as Salt Typhoon breached and remained undetected in a U.S. Army National Guard network for nine months in 2024, stealing network configuration files and administrator credentials that could be used to compromise other government networks. [...]",
    "published": "2025-07-17T16:02:57",
    "source": "BleepingComputer"
  },
  {
    "title": "Max severity Cisco ISE bug allows pre-auth command execution, patch now",
    "link": "https://www.bleepingcomputer.com/news/security/max-severity-cisco-ise-bug-allows-pre-auth-command-execution-patch-now/",
    "summary": "A critical vulnerability (CVE-2025-20337) in Cisco's Identity Services Engine (ISE) could be exploited to let an unauthenticated attacker store malicious files, execute arbitrary code, or gain root privileges on vulnerable devices. [...]",
    "published": "2025-07-17T15:53:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers Exploit Apache HTTP Server Flaw to Deploy Linuxsys Cryptocurrency Miner",
    "link": "https://thehackernews.com/2025/07/hackers-exploit-apache-http-server-flaw.html",
    "summary": "Cybersecurity researchers have discovered a new campaign that exploits a known security flaw impacting Apache HTTP Server to deliver a cryptocurrency miner called Linuxsys.\nThe vulnerability in question is CVE-2021-41773 (CVSS score: 7.5), a high-severity path traversal vulnerability in Apache HTTP ",
    "published": "2025-07-17T14:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Europol Disrupts NoName057(16) Hacktivist Group Linked to DDoS Attacks Against Ukraine",
    "link": "https://thehackernews.com/2025/07/europol-disrupts-noname05716-hacktivist.html",
    "summary": "An international operation coordinated by Europol has disrupted the infrastructure of a pro-Russian hacktivist group known as NoName057(16) that has been linked to a string of distributed denial-of-service (DDoS) attacks against Ukraine and its allies.\nThe actions have led to the dismantling of a ma",
    "published": "2025-07-17T11:30:00",
    "source": "HackerNews"
  },
  {
    "title": "CTEM vs ASM vs Vulnerability Management: What Security Leaders Need to Know in 2025",
    "link": "https://thehackernews.com/2025/07/ctem-vs-asm-vs-vulnerability-management.html",
    "summary": "The modern-day threat landscape requires enterprise security teams to think and act beyond traditional cybersecurity measures that are purely passive and reactive, and in most cases, ineffective against emerging threats and sophisticated threat actors. Prioritizing cybersecurity means implementing m",
    "published": "2025-07-17T11:00:00",
    "source": "HackerNews"
  }
]