[
  {
    "title": "Stolen Ticketmaster data from Snowflake attacks briefly for sale again",
    "link": "https://www.bleepingcomputer.com/news/security/stolen-ticketmaster-data-from-snowflake-attacks-briefly-for-sale-again/",
    "summary": "The Arkana Security extortion gang briefly listed over the weekend what appeared to be newly stolen Ticketmaster data but is instead the data stolen during the 2024 Snowflake data theft attacks. [...]",
    "published": "2025-06-09T22:31:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 84,000 Roundcube instances vulnerable to actively exploited flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-84-000-roundcube-instances-vulnerable-to-actively-exploited-flaw/",
    "summary": "Over 84,000 instances of the Roundcube webmail software are vulnerable to CVE-2025-49113, a critical remote code execution (RCE) vulnerability with a publicly available exploit. [...]",
    "published": "2025-06-09T20:14:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Google patched bug leaking phone numbers tied to accounts",
    "link": "https://www.bleepingcomputer.com/news/security/google-patched-bug-leaking-phone-numbers-tied-to-accounts/",
    "summary": "A vulnerability allowed researchers to brute-force any Google account's recovery phone number simply by knowing a their profile name and an easily retrieved partial phone number, creating a massive risk for phishing and SIM-swapping attacks. [...]",
    "published": "2025-06-09T19:36:39",
    "source": "BleepingComputer"
  },
  {
    "title": "SentinelOne shares new details on China-linked breach attempt",
    "link": "https://www.bleepingcomputer.com/news/security/sentinelone-shares-new-details-on-china-linked-breach-attempt/",
    "summary": "SentinelOne has shared more details on an attempted supply chain attack by Chinese hackers through an IT services and logistics firm that manages hardware logistics for the cybersecurity firm. [...]",
    "published": "2025-06-09T18:26:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Linux Foundation unveils decentralized WordPress plugin manager",
    "link": "https://www.bleepingcomputer.com/news/technology/linux-foundation-unveils-decentralized-wordpress-plugin-manager/",
    "summary": "A collective of former WordPress developers and contributors backed by the Linux Foundation has launched the FAIR Package Manager, a new and independent distribution system for trusted WordPress plugins and themes. [...]",
    "published": "2025-06-09T18:07:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Sensata Technologies says personal data stolen by ransomware gang",
    "link": "https://www.bleepingcomputer.com/news/security/sensata-technologies-says-personal-data-stolen-by-ransomware-gang/",
    "summary": "Sensata Technologies is warning former and current employees it suffered a data breach after concluding an investigation into an April ransomware attack. [...]",
    "published": "2025-06-09T16:09:35",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 70 Organizations Across Multiple Sectors Targeted by China-Linked Cyber Espionage Group",
    "link": "https://thehackernews.com/2025/06/over-70-organizations-across-multiple.html",
    "summary": "The reconnaissance activity targeting American cybersecurity company SentinelOne was part of a broader set of partially-related intrusions into several targets between July 2024 and March 2025.\n\"The victimology includes a South Asian government entity, a European media organization, and more than 70",
    "published": "2025-06-09T15:23:00",
    "source": "HackerNews"
  },
  {
    "title": "Two Distinct Botnets Exploit Wazuh Server Vulnerability to Launch Mirai-Based Attacks",
    "link": "https://thehackernews.com/2025/06/botnet-wazuh-server-vulnerability.html",
    "summary": "A now-patched critical security flaw in the Wazur Server is being exploited by threat actors to drop two different Mirai botnet variants and use them to conduct distributed denial-of-service (DDoS) attacks.\nAkamai, which first discovered the exploitation efforts in late March 2025, said the maliciou",
    "published": "2025-06-09T14:46:00",
    "source": "HackerNews"
  },
  {
    "title": "Designing Blue Team playbooks with Wazuh for proactive incident response",
    "link": "https://www.bleepingcomputer.com/news/security/designing-blue-team-playbooks-with-wazuh-for-proactive-incident-response/",
    "summary": "Blue Team playbooks are essential—but tools like Wazuh take them to the next level. From credential dumping to web shells and brute-force attacks, see how Wazuh strengthens real-time detection and automated response. [...]",
    "published": "2025-06-09T14:27:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Grocery wholesale giant United Natural Foods hit by cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/grocery-wholesale-giant-united-natural-foods-hit-by-cyberattack/",
    "summary": "United Natural Foods (UNFI), North America's largest publicly traded wholesale distributor, was forced to shut down some systems following a recent cyberattack. [...]",
    "published": "2025-06-09T13:31:40",
    "source": "BleepingComputer"
  },
  {
    "title": "⚡ Weekly Recap: Chrome 0-Day, Data Wipers, Misused Tools and Zero-Click iPhone Attacks",
    "link": "https://thehackernews.com/2025/06/weekly-recap-chrome-0-day-data-wipers.html",
    "summary": "Behind every security alert is a bigger story. Sometimes it’s a system being tested. Sometimes it’s trust being lost in quiet ways—through delays, odd behavior, or subtle gaps in control.\nThis week, we’re looking beyond the surface to spot what really matters. Whether it’s poor design, hidden access",
    "published": "2025-06-09T11:20:00",
    "source": "HackerNews"
  },
  {
    "title": "Think Your IdP or CASB Covers Shadow IT? These 5 Risks Prove Otherwise",
    "link": "https://thehackernews.com/2025/06/think-your-idp-or-casb-covers-shadow-it.html",
    "summary": "You don&rsquo;t need a rogue employee to suffer a breach.\nAll it takes is a free trial that someone forgot to cancel. An AI-powered note-taker quietly syncing with your Google Drive. A personal Gmail account tied to a business-critical tool. That&rsquo;s shadow IT. And today, it&rsquo;s not just abo",
    "published": "2025-06-09T11:00:00",
    "source": "HackerNews"
  }
]