[
  {
    "title": "Hikvision Canada ordered to cease operations over security risks",
    "link": "https://www.bleepingcomputer.com/news/security/hikvision-canada-ordered-to-cease-operations-over-security-risks/",
    "summary": "The Canadian government has ordered Hikvision's subsidiary in the country to cease all operations following a review that determined them to pose a national security risk. [...]",
    "published": "2025-06-30T14:11:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft warns of Windows update delays due to wrong timestamp",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-Windows-security-update-delays-due-to-incorrect-metadata-timestamp/",
    "summary": "Microsoft has confirmed a new known issue causing delivery delays for June 2025 Windows security updates due to an incorrect metadata timestamp. [...]",
    "published": "2025-06-30T13:48:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Europol helps disrupt $540 million crypto investment fraud ring",
    "link": "https://www.bleepingcomputer.com/news/security/europol-helps-disrupt-540-million-crypto-investment-fraud-ring/",
    "summary": "Spanish authorities have arrested five individuals in Madrid and the Canary Islands, suspected of laundering $540 million (€460 million) from illegal cryptocurrency investment schemes and defrauding more than 5,000 victims. [...]",
    "published": "2025-06-30T13:20:58",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI: Cybercriminals steal health data posing as fraud investigators",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-warns-cybercriminals-steal-health-data-posing-as-fraud-investigators/",
    "summary": "The Federal Bureau of Investigation (FBI) has warned Americans of cybercriminals impersonating health fraud investigators to steal their sensitive information. [...]",
    "published": "2025-06-30T12:42:01",
    "source": "BleepingComputer"
  },
  {
    "title": "Over 1,200 Citrix servers unpatched against critical auth bypass flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-1-200-citrix-servers-unpatched-against-critical-auth-bypass-flaw/",
    "summary": "Over 1,200 Citrix NetScaler ADC and NetScaler Gateway appliances exposed online are unpatched against a critical vulnerability believed to be actively exploited, allowing threat actors to bypass authentication by hijacking user sessions. [...]",
    "published": "2025-06-30T11:47:38",
    "source": "BleepingComputer"
  },
  {
    "title": "Leveraging Credentials As Unique Identifiers: A Pragmatic Approach To NHI Inventories",
    "link": "https://thehackernews.com/2025/06/leveraging-credentials-as-unique.html",
    "summary": "Identity-based attacks are on the rise. Attacks in which malicious actors assume the identity of an entity to easily gain access to resources and sensitive data have been increasing in number and frequency over the last few years. Some recent reports estimate that 83% of attacks involve compromised ",
    "published": "2025-06-30T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "⚡ Weekly Recap: Airline Hacks, Citrix 0-Day, Outlook Malware, Banking Trojans and more",
    "link": "https://thehackernews.com/2025/06/weekly-recap-airline-hacks-citrix-0-day.html",
    "summary": "Ever wonder what happens when attackers don’t break the rules—they just follow them better than we do? When systems work exactly as they’re built to, but that “by design” behavior quietly opens the door to risk?\nThis week brings stories that make you stop and rethink what’s truly under control. It’s",
    "published": "2025-06-30T10:16:00",
    "source": "HackerNews"
  }
]