[
  {
    "title": "US offers $10M for tips on state hackers tied to RedLine malware",
    "link": "https://www.bleepingcomputer.com/news/security/us-offers-10m-for-tips-on-state-hackers-tied-to-redline-malware/",
    "summary": "The U.S. Department of State has announced a reward of up to $10 million for any information on government-sponsored hackers with ties to the RedLine infostealer malware operation and its suspected creator, Russian national Maxim Alexandrovich Rudometov. [...]",
    "published": "2025-06-05T06:25:21",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Cisco ISE Auth Bypass Flaw Impacts Cloud Deployments on AWS, Azure, and OCI",
    "link": "https://thehackernews.com/2025/06/critical-cisco-ise-auth-bypass-flaw.html",
    "summary": "Cisco has released security patches to address a critical security flaw impacting the Identity Services Engine (ISE) that, if successfully exploited, could allow unauthenticated actors to carry out malicious actions on susceptible systems.\nThe security defect, tracked as CVE-2025-20286, carries a CV",
    "published": "2025-06-05T05:37:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft unveils free EU cybersecurity program for governments",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-free-eu-cybersecurity-program-for-governments/",
    "summary": "Microsoft announced in Berlin today a new European Security Program that promises to bolster cybersecurity for European governments. [...]",
    "published": "2025-06-04T20:36:27",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI: Play ransomware breached 900 victims, including critical orgs",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-play-ransomware-breached-900-victims-including-critical-orgs/",
    "summary": "In an update to a joint advisory with CISA and the Australian Cyber Security Centre, the FBI said that the Play ransomware gang had breached roughly 900 organizations as of May 2025, three times the number of victims reported in October 2023. [...]",
    "published": "2025-06-04T20:06:14",
    "source": "BleepingComputer"
  },
  {
    "title": "Hacker arrested for breaching 5,000 hosting accounts to mine crypto",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-arrested-for-breaching-5-000-hosting-accounts-to-mine-crypto/",
    "summary": "The Ukrainian police arrested a 35-year-old hacker who breached 5,000 accounts at an international hosting company and used them to mine cryptocurrency, resulting in $4.5 million in damages. [...]",
    "published": "2025-06-04T19:38:13",
    "source": "BleepingComputer"
  }
]