[
  {
    "title": "Police arrests 20 suspects for distributing child sexual abuse content",
    "link": "https://www.bleepingcomputer.com/news/security/police-arrests-20-suspects-for-distributing-child-sexual-abuse-content/",
    "summary": "Law enforcement authorities from over a dozen countries have arrested 20 suspects in an international operation targeting the production and distribution of child sexual abuse material. [...]",
    "published": "2025-06-06T08:55:21",
    "source": "BleepingComputer"
  },
  {
    "title": "New PathWiper Data Wiper Malware Disrupts Ukrainian Critical Infrastructure in 2025 Attack",
    "link": "https://thehackernews.com/2025/06/new-pathwiper-data-wiper-malware.html",
    "summary": "A critical infrastructure entity within Ukraine was targeted by a previously unseen data wiper malware named PathWiper, according to new findings from Cisco Talos.\n\"The attack was instrumented via a legitimate endpoint administration framework, indicating that the attackers likely had access to the ",
    "published": "2025-06-06T08:35:00",
    "source": "HackerNews"
  },
  {
    "title": "Google’s upcoming Gemini Kingfall is allegedly a coding beast",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/googles-upcoming-gemini-kingfall-is-allegedly-a-coding-beast/",
    "summary": "Google's AI advancement is not slowing down, and we might be getting yet another powerful model codenamed \"Gemini Kingfall.\" [...]",
    "published": "2025-06-05T23:41:25",
    "source": "BleepingComputer"
  },
  {
    "title": "ChatGPT prepares o3-pro model for $200 Pro subscribers",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-prepares-o3-pro-model-for-200-pro-subscribers/",
    "summary": "OpenAI is planning to ship an update to ChatGPT that will turn on the new o3 Pro model, which has more compute to think harder. [...]",
    "published": "2025-06-05T22:45:53",
    "source": "BleepingComputer"
  },
  {
    "title": "Proxy Services Feast on Ukraine’s IP Address Exodus",
    "link": "https://krebsonsecurity.com/2025/06/proxy-services-feast-on-ukraines-ip-address-exodus/",
    "summary": "Ukraine has seen nearly one-fifth of its Internet space come under Russian control or sold to Internet address brokers since February 2022, a new study finds. The analysis indicates large chunks of Ukrainian Internet address space are now in the hands of proxy and anonymity services nested at some o",
    "published": "2025-06-05T22:44:33",
    "source": "Krebs"
  }
]