[
  {
    "title": "U.S. Sanctions Funnull for $200M Romance Baiting Scams Tied to Crypto Fraud",
    "link": "https://thehackernews.com/2025/05/us-sanctions-funnull-for-200m-romance.html",
    "summary": "The U.S. Department of Treasury's Office of Foreign Assets Control (OFAC) has levied sanctions against a Philippines-based company named Funnull Technology Inc. and its administrator Liu Lizhi for providing infrastructure to conduct romance baiting scams that led to massive cryptocurrency losses.\nTh",
    "published": "2025-05-30T07:51:00",
    "source": "HackerNews"
  },
  {
    "title": "ConnectWise Hit by Cyberattack; Nation-State Actor Suspected in Targeted Breach",
    "link": "https://thehackernews.com/2025/05/connectwise-hit-by-cyberattack-nation.html",
    "summary": "ConnectWise, the developer of remote access and support software ScreenConnect, has disclosed that it was the victim of a cyber attack that it said was likely perpetrated by a nation-state threat actor.\n\"ConnectWise recently learned of suspicious activity within our environment that we believe was t",
    "published": "2025-05-30T06:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Meta Disrupts Influence Ops Targeting Romania, Azerbaijan, and Taiwan with Fake Personas",
    "link": "https://thehackernews.com/2025/05/meta-disrupts-influence-ops-targeting.html",
    "summary": "Meta on Thursday revealed that it disrupted three covert influence operations originating from Iran, China, and Romania during the first quarter of 2025.\n\"We detected and removed these campaigns before they were able to build authentic audiences on our apps,\" the social media giant said in its quart",
    "published": "2025-05-30T04:09:00",
    "source": "HackerNews"
  },
  {
    "title": "U.S. Sanctions Cloud Provider ‘Funnull’ as Top Source of ‘Pig Butchering’ Scams",
    "link": "https://krebsonsecurity.com/2025/05/u-s-sanctions-cloud-provider-funnull-as-top-source-of-pig-butchering-scams/",
    "summary": "The U.S. government today imposed economic sanctions on Funnull Technology Inc., a Philippines-based company that provides computer infrastructure for hundreds of thousands of websites involved in virtual currency investment scams, commonly known as “pig butchering.\" In January 2025, KrebsOnSecurity",
    "published": "2025-05-30T01:55:16",
    "source": "Krebs"
  },
  {
    "title": "Mozilla releases Firefox 139.0.1 update to fix artifacts on Nvidia GPUs",
    "link": "https://www.bleepingcomputer.com/news/software/mozilla-releases-firefox-13901-update-to-fix-artifacts-on-nvidia-gpus/",
    "summary": "Mozilla has rolled out an emergency Firefox 139.0.1 update after the Tuesday release caused graphical artifacts on PCs with NVIDIA GPUs. [...]",
    "published": "2025-05-29T23:58:04",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft Authenticator now warns to export passwords before July cutoff",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-authenticator-now-warns-to-export-passwords-before-july-cutoff/",
    "summary": "The Microsoft Authenticator app is now issuing notifications warning that the password autofill feature is being deprecated in July, suggesting users move to Microsoft Edge instead. [...]",
    "published": "2025-05-29T23:49:49",
    "source": "BleepingComputer"
  }
]