[
  {
    "title": "Marks & Spencer pauses online orders after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/marks-and-spencer-pauses-online-orders-after-cyberattack/",
    "summary": "British retailer giant Marks & Spencer (M&amp;S) has suspended online orders while working to recover from a recently disclosed cyberattack. [...]",
    "published": "2025-04-25T15:05:09",
    "source": "BleepingComputer"
  },
  {
    "title": "Mobile provider MTN says cyberattack compromised customer data",
    "link": "https://www.bleepingcomputer.com/news/security/mobile-provider-mtn-says-cyberattack-compromised-customer-data/",
    "summary": "African mobile giant MTN Group announced that a cybersecurity incident has compromised the personal information of some of its subscribers in certain countries. [...]",
    "published": "2025-04-25T14:57:05",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows \"inetpub\" security fix can be abused to block future updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-inetpub-security-fix-can-be-abused-to-block-future-updates/",
    "summary": "A recent Windows security update that creates an 'inetpub' folder has introduced a new weakness allowing attackers to prevent the installation of future updates. [...]",
    "published": "2025-04-25T14:23:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Baltimore City Public Schools data breach affects over 31,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/baltimore-city-public-schools-data-breach-affects-over-31-000-people/",
    "summary": "​Baltimore City Public Schools notified tens of thousands of employees and students of a data breach following an incident in February when unknown attackers hacked into its network. [...]",
    "published": "2025-04-25T14:06:23",
    "source": "BleepingComputer"
  },
  {
    "title": "North Korean Hackers Spread Malware via Fake Crypto Firms and Job Interview Lures",
    "link": "https://thehackernews.com/2025/04/north-korean-hackers-spread-malware-via.html",
    "summary": "North Korea-linked threat actors behind the Contagious Interview have set up front companies as a way to distribute malware during the fake hiring process.\n\"In this new campaign, the threat actor group is using three front companies in the cryptocurrency consulting industry—BlockNovas LLC (blocknova",
    "published": "2025-04-25T14:05:00",
    "source": "HackerNews"
  },
  {
    "title": "SAP fixes suspected Netweaver zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sap-fixes-suspected-netweaver-zero-day-exploited-in-attacks/",
    "summary": "SAP has released out-of-band emergency NetWeaver updates to fix a suspected remote code execution (RCE) zero-day flaw actively exploited to hijack servers. [...]",
    "published": "2025-04-25T13:01:48",
    "source": "BleepingComputer"
  },
  {
    "title": "New Critical SAP NetWeaver Flaw Exploited to Drop Web Shell, Brute Ratel Framework",
    "link": "https://thehackernews.com/2025/04/sap-confirms-critical-netweaver-flaw.html",
    "summary": "Threat actors are likely exploiting a new vulnerability in SAP NetWeaver to upload JSP web shells with the goal of facilitating unauthorized file uploads and code execution.&nbsp;\n\"The exploitation is likely tied to either a previously disclosed vulnerability like CVE-2017-9844 or an unreported remo",
    "published": "2025-04-25T10:41:00",
    "source": "HackerNews"
  },
  {
    "title": "Why NHIs Are Security's Most Dangerous Blind Spot",
    "link": "https://thehackernews.com/2025/04/why-nhis-are-securitys-most-dangerous.html",
    "summary": "When we talk about identity in cybersecurity, most people think of usernames, passwords, and the occasional MFA prompt. But lurking beneath the surface is a growing threat that does not involve human credentials at all, as we witness the exponential growth of Non-Human Identities (NHIs).&nbsp;\nAt th",
    "published": "2025-04-25T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "FBI seeks help to unmask Salt Typhoon hackers behind telecom breaches",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-seeks-help-to-unmask-salt-typhoon-hackers-behind-telecom-breaches/",
    "summary": "The FBI has asked the public for information on Chinese Salt Typhoon hackers behind widespread breaches of telecommunications providers in the United States and worldwide. [...]",
    "published": "2025-04-25T09:34:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Identify Rack::Static Vulnerability Enabling Data Breaches in Ruby Servers",
    "link": "https://thehackernews.com/2025/04/researchers-identify-rackstatic.html",
    "summary": "Cybersecurity researchers have disclosed three security flaws in the Rack Ruby web server interface that, if successfully exploited, could enable attackers to gain unauthorized access to files, inject malicious data, and tamper with logs under certain conditions.\nThe vulnerabilities, flagged by cybe",
    "published": "2025-04-25T08:57:00",
    "source": "HackerNews"
  },
  {
    "title": "DslogdRAT Malware Deployed via Ivanti ICS Zero-Day CVE-2025-0282 in Japan Attacks",
    "link": "https://thehackernews.com/2025/04/dslogdrat-malware-deployed-via-ivanti.html",
    "summary": "Cybersecurity researchers are warning about a new malware called DslogdRAT that's installed following the exploitation of a now-patched security flaw in Ivanti Connect Secure (ICS).\nThe malware, along with a web shell, were \"installed by exploiting a zero-day vulnerability at that time, CVE-2025-028",
    "published": "2025-04-25T08:43:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft announces fix for CPU spikes when typing in Outlook",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-announces-fix-for-cpu-spikes-when-typing-in-outlook/",
    "summary": "Microsoft says it will soon fix a known issue causing CPU spikes when typing messages in recent versions of its classic Outlook email client. [...]",
    "published": "2025-04-25T08:10:47",
    "source": "BleepingComputer"
  }
]