[
  {
    "title": "Cisco Warns of Critical ISE Flaw Allowing Unauthenticated Attackers to Execute Root Code",
    "link": "https://thehackernews.com/2025/07/cisco-warns-of-critical-ise-flaw.html",
    "summary": "Cisco has disclosed a new maximum-severity security vulnerability impacting Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could permit an attacker to execute arbitrary code on the underlying operating system with elevated privileges.\nTracked as CVE-2025-20337",
    "published": "2025-07-17T05:37:00",
    "source": "HackerNews"
  },
  {
    "title": "Co-op confirms data of 6.5 million members stolen in cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/co-op-confirms-data-of-65-million-members-stolen-in-cyberattack/",
    "summary": "UK retailer Co-op has confirmed that personal data of 6.5 million members was stolen in the massive cyberattack in April that shut down systems and caused food shortages in its grocery stores. [...]",
    "published": "2025-07-16T22:29:27",
    "source": "BleepingComputer"
  },
  {
    "title": "U.S. Army soldier pleads guilty to extorting 10 tech, telecom firms",
    "link": "https://www.bleepingcomputer.com/news/security/us-army-soldier-pleads-guilty-to-extorting-10-tech-telecom-firms/",
    "summary": "A 21-year old former U.S. Army soldier pleaded guilty to charges of hacking and extorting at least ten telecommunications and technology companies in the country. [...]",
    "published": "2025-07-16T21:00:28",
    "source": "BleepingComputer"
  },
  {
    "title": "Louis Vuitton says regional data breaches tied to same cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/louis-vuitton-says-regional-data-breaches-tied-to-same-cyberattack/",
    "summary": "Luxury fashion giant Louis Vuitton confirmed that breaches impacting customers in the UK, South Korea, and Turkey stem from the same security incident, which is believed to be linked to the ShinyHunters extortion group. [...]",
    "published": "2025-07-16T19:26:18",
    "source": "BleepingComputer"
  }
]