[
  {
    "title": "China-Linked Hackers Exploit SAP and SQL Server Flaws in Attacks Across Asia and Brazil",
    "link": "https://thehackernews.com/2025/05/china-linked-hackers-exploit-sap-and.html",
    "summary": "The China-linked threat actor behind the recent in-the-wild exploitation of a critical security flaw in SAP NetWeaver has been attributed to a broader set of attacks targeting organizations in Brazil, India, and Southeast Asia since 2023.\n\"The threat actor mainly targets the SQL injection vulnerabil",
    "published": "2025-05-30T11:12:00",
    "source": "HackerNews"
  },
  {
    "title": "From the \"Department of No\" to a \"Culture of Yes\": A Healthcare CISO's Journey to Enabling Modern Care",
    "link": "https://thehackernews.com/2025/05/from-department-of-no-to-culture-of-yes.html",
    "summary": "Breaking Out of the Security Mosh Pit\nWhen Jason Elrod, CISO of MultiCare Health System, describes legacy healthcare IT environments, he doesn't mince words: \"Healthcare loves to walk backwards into the future. And this is how we got here, because there are a lot of things that we could have prepare",
    "published": "2025-05-30T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "U.S. Sanctions Funnull for $200M Romance Baiting Scams Tied to Crypto Fraud",
    "link": "https://thehackernews.com/2025/05/us-sanctions-funnull-for-200m-romance.html",
    "summary": "The U.S. Department of Treasury's Office of Foreign Assets Control (OFAC) has levied sanctions against a Philippines-based company named Funnull Technology Inc. and its administrator Liu Lizhi for providing infrastructure to conduct romance baiting scams that led to massive cryptocurrency losses.\nTh",
    "published": "2025-05-30T07:51:00",
    "source": "HackerNews"
  },
  {
    "title": "ConnectWise Hit by Cyberattack; Nation-State Actor Suspected in Targeted Breach",
    "link": "https://thehackernews.com/2025/05/connectwise-hit-by-cyberattack-nation.html",
    "summary": "ConnectWise, the developer of remote access and support software ScreenConnect, has disclosed that it was the victim of a cyber attack that it said was likely perpetrated by a nation-state threat actor.\n\"ConnectWise recently learned of suspicious activity within our environment that we believe was t",
    "published": "2025-05-30T06:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Meta Disrupts Influence Ops Targeting Romania, Azerbaijan, and Taiwan with Fake Personas",
    "link": "https://thehackernews.com/2025/05/meta-disrupts-influence-ops-targeting.html",
    "summary": "Meta on Thursday revealed that it disrupted three covert influence operations originating from Iran, China, and Romania during the first quarter of 2025.\n\"We detected and removed these campaigns before they were able to build authentic audiences on our apps,\" the social media giant said in its quart",
    "published": "2025-05-30T04:09:00",
    "source": "HackerNews"
  }
]