[
  {
    "title": "Windows 11 KB5060829 update released with 38 new changes, fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5060829-update-released-with-38-new-changes-fixes/",
    "summary": "​​Microsoft has released the KB5060829 preview cumulative update for Windows 11 24H2, which includes 38 changes, including improvements to the taskbar and a new PC-to-PC migration experience. [...]",
    "published": "2025-06-27T07:28:59",
    "source": "BleepingComputer"
  },
  {
    "title": "OneClik Malware Targets Energy Sector Using Microsoft ClickOnce and Golang Backdoors",
    "link": "https://thehackernews.com/2025/06/oneclik-malware-targets-energy-sector.html",
    "summary": "Cybersecurity researchers have detailed a new campaign dubbed OneClik that leverages Microsoft's ClickOnce software deployment technology and bespoke Golang backdoors to compromise organizations within the energy, oil, and gas sectors.\n\"The campaign exhibits characteristics aligned with Chinese-affi",
    "published": "2025-06-27T06:31:00",
    "source": "HackerNews"
  },
  {
    "title": "Whole Foods supplier UNFI restores core systems after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/whole-foods-supplier-unfi-restores-core-systems-after-cyberattack/",
    "summary": "American grocery wholesale giant United Natural Foods (UNFI) reports that it has restored its core systems and brought online the electronic ordering and invoicing systems affected by a cyberattack. [...]",
    "published": "2025-06-27T06:21:49",
    "source": "BleepingComputer"
  },
  {
    "title": "Hawaiian Airlines discloses cyberattack, flights not affected",
    "link": "https://www.bleepingcomputer.com/news/security/hawaiian-airlines-discloses-cyberattack-flights-not-affected/",
    "summary": "Hawaiian Airlines, the tenth-largest commercial airline in the United States, is investigating a cyberattack that has disrupted access to some of its systems. [...]",
    "published": "2025-06-27T05:37:04",
    "source": "BleepingComputer"
  },
  {
    "title": "FTC approves $126 million in Fortnite refunds over ‘dark patterns’",
    "link": "https://www.bleepingcomputer.com/news/legal/ftc-approves-126-million-in-fortnite-refunds-over-dark-patterns/",
    "summary": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwanted purchases. [...]",
    "published": "2025-06-26T20:27:08",
    "source": "BleepingComputer"
  }
]