[
  {
    "title": "Microsoft adds quick machine recovery to Windows 11 settings",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-adds-quick-machine-recovery-to-windows-11-settings/",
    "summary": "Microsoft is testing a dedicated page in Windows Settings for quick machine recovery, which will provide users with additional configuration options. [...]",
    "published": "2025-06-03T15:50:07",
    "source": "BleepingComputer"
  },
  {
    "title": "Malicious RubyGems pose as Fastlane to steal Telegram API data",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-rubygems-pose-as-fastlane-to-steal-telegram-api-data/",
    "summary": "Two malicious RubyGems packages posing as popular Fastlane CI/CD plugins redirect Telegram API requests to attacker-controlled servers to intercept and steal data. [...]",
    "published": "2025-06-03T15:48:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Fake DocuSign, Gitcode Sites Spread NetSupport RAT via Multi-Stage PowerShell Attack",
    "link": "https://thehackernews.com/2025/06/fake-docusign-gitcode-sites-spread.html",
    "summary": "Threat hunters are alerting to a new campaign that employs deceptive websites to trick unsuspecting users into executing malicious PowerShell scripts on their machines and infect them with the NetSupport RAT malware.\nThe DomainTools Investigations (DTI) team said it identified \"malicious multi-stage",
    "published": "2025-06-03T15:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Mozilla launches new system to detect Firefox crypto drainer add-ons",
    "link": "https://www.bleepingcomputer.com/news/security/mozilla-launches-new-system-to-detect-firefox-crypto-drainer-add-ons/",
    "summary": "Mozilla has developed a new security feature for its add-on portal that helps block Firefox malicious extensions that drain cryptocurrency wallets. [...]",
    "published": "2025-06-03T14:29:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Scattered Spider: Three things the news doesn’t tell you",
    "link": "https://www.bleepingcomputer.com/news/security/scattered-spider-three-things-the-news-doesnt-tell-you/",
    "summary": "Scattered Spider isn't one group — it's an identity-first threat model evolving fast. From vishing to AiTM phishing, they're exploiting MFA gaps to hijack the cloud. Watch the Push Security webinar to learn how their identity-based tactics work — and how to stop them. [...]",
    "published": "2025-06-03T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA warns of ConnectWise ScreenConnect bug exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-connectwise-screenconnect-bug-exploited-in-attacks/",
    "summary": "CISA is alerting federal agencies in the U.S. of hackers exploiting a recently patched ScreenConnect vulnerability that could lead to executing remote code on the server. [...]",
    "published": "2025-06-03T13:57:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Victoria’s Secret delays earnings release after security incident",
    "link": "https://www.bleepingcomputer.com/news/security/victorias-secret-delays-earnings-release-after-security-incident/",
    "summary": "Fashion retail giant Victoria's Secret has delayed its first quarter 2025 earnings release because of ongoing corporate system restoration efforts following a May 24 security incident. [...]",
    "published": "2025-06-03T13:25:12",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical 10-Year-Old Roundcube Webmail Bug Allows Authenticated Users Run Malicious Code",
    "link": "https://thehackernews.com/2025/06/critical-10-year-old-roundcube-webmail.html",
    "summary": "Cybersecurity researchers have disclosed details of a critical security flaw in the Roundcube webmail software that has gone unnoticed for a decade and could be exploited to take over susceptible systems and execute arbitrary code.\nThe vulnerability, tracked as CVE-2025-49113, carries a CVSS score o",
    "published": "2025-06-03T13:01:00",
    "source": "HackerNews"
  },
  {
    "title": "Scattered Spider: Understanding Help Desk Scams and How to Defend Your Organization",
    "link": "https://thehackernews.com/2025/06/scattered-spider-understanding-help.html",
    "summary": "In the wake of high-profile attacks on UK retailers Marks &amp; Spencer and Co-op, Scattered Spider has been all over the media, with coverage spilling over into the mainstream news due to the severity of the disruption caused — currently looking like hundreds of millions in lost profits for M&amp;S",
    "published": "2025-06-03T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Google patches new Chrome zero-day bug exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/google-patches-new-chrome-zero-day-bug-exploited-in-attacks/",
    "summary": "Google has released an emergency security update to fix the third Chrome zero-day vulnerability exploited in attacks since the start of the year. [...]",
    "published": "2025-06-03T10:22:52",
    "source": "BleepingComputer"
  },
  {
    "title": "Android Trojan Crocodilus Now Active in 8 Countries, Targeting Banks and Crypto Wallets",
    "link": "https://thehackernews.com/2025/06/android-trojan-crocodilus-now-active-in.html",
    "summary": "A growing number of malicious campaigns have leveraged a recently discovered Android banking trojan called Crocodilus to target users in Europe and South America.\nThe malware, according to a new report published by ThreatFabric, has also adopted improved obfuscation techniques to hinder analysis and",
    "published": "2025-06-03T09:34:00",
    "source": "HackerNews"
  },
  {
    "title": "Android malware Crocodilus adds fake contacts to spoof trusted callers",
    "link": "https://www.bleepingcomputer.com/news/security/android-malware-crocodilus-adds-fake-contacts-to-spoof-trusted-callers/",
    "summary": "The latest version of the 'Crocodilus' Android malware has introduced a new mechanism that adds a fake contact on the infected device's contact list to deceive victims. [...]",
    "published": "2025-06-03T09:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome to Distrust Two Certificate Authorities Over Compliance and Conduct Issues",
    "link": "https://thehackernews.com/2025/06/google-chrome-to-distrust-two.html",
    "summary": "Google has revealed that it will no longer trust digital certificates issued by Chunghwa Telecom and Netlock citing \"patterns of concerning behavior observed over the past year.\"\nThe changes are expected to be introduced in Chrome 139, which is scheduled for public release in early August 2025. The ",
    "published": "2025-06-03T07:48:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft and CrowdStrike Launch Shared Threat Actor Glossary to Cut Attribution Confusion",
    "link": "https://thehackernews.com/2025/06/microsoft-and-crowdstrike-launch-shared.html",
    "summary": "Microsoft and CrowdStrike have announced that they are teaming up to align their individual threat actor taxonomies by publishing a new joint threat actor mapping.\n\"By mapping where our knowledge of these actors align, we will provide security professionals with the ability to connect insights faste",
    "published": "2025-06-03T07:20:00",
    "source": "HackerNews"
  }
]