[
  {
    "title": "Russia to enforce location tracking app on all foreigners in Moscow",
    "link": "https://www.bleepingcomputer.com/news/government/russia-to-enforce-location-tracking-app-on-all-foreigners-in-moscow/",
    "summary": "The Russian government has introduced a new law that makes installing a tracking app mandatory for all foreign nationals in the Moscow region. [...]",
    "published": "2025-05-21T18:24:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Russian Hackers Exploit Email and VPN Vulnerabilities to Spy on Ukraine Aid Logistics",
    "link": "https://thehackernews.com/2025/05/russian-hackers-exploit-email-and-vpn.html",
    "summary": "Russian cyber threat actors have been attributed to a state-sponsored campaign targeting Western logistics entities and technology companies since 2022.\nThe activity has been assessed to be orchestrated by APT28 (aka BlueDelta, Fancy Bear, or Forest Blizzard), which is linked to the Russian General ",
    "published": "2025-05-21T18:06:00",
    "source": "HackerNews"
  },
  {
    "title": "3AM ransomware uses spoofed IT calls, email bombing to breach networks",
    "link": "https://www.bleepingcomputer.com/news/security/3am-ransomware-uses-spoofed-it-calls-email-bombing-to-breach-networks/",
    "summary": "A 3AM ransomware affiliate is conducting highly targeted attacks using email bombing and spoofed IT support calls to socially engineer employees into giving credentials for remote access to corporate systems. [...]",
    "published": "2025-05-21T17:27:21",
    "source": "BleepingComputer"
  },
  {
    "title": "Lumma infostealer malware operation disrupted, 2,300 domains seized",
    "link": "https://www.bleepingcomputer.com/news/security/lumma-infostealer-malware-operation-disrupted-2-300-domains-seized/",
    "summary": "Earlier this month, a coordinated disruption action targeting the Lumma malware-as-a-service (MaaS) information stealer operation seized thousands of domains, part of its infrastructure backbone worldwide. [...]",
    "published": "2025-05-21T16:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Data-stealing Chrome extensions impersonate Fortinet, YouTube, VPNs",
    "link": "https://www.bleepingcomputer.com/news/security/data-stealing-chrome-extensions-impersonate-fortinet-youtube-vpns/",
    "summary": "A Google Chrome Web Store campaign uses over 100 malicious browser extensions that mimic legitimate tools, such as VPNs, AI assistants, and crypto utilities, to steal browser cookies and execute remote scripts secretly. [...]",
    "published": "2025-05-21T15:13:34",
    "source": "BleepingComputer"
  },
  {
    "title": "ThreatLocker Patch Management: A Security-First Approach to Closing Vulnerability Windows",
    "link": "https://www.bleepingcomputer.com/news/security/threatlocker-patch-management-a-security-first-approach-to-closing-vulnerability-windows/",
    "summary": "Patching is basic cyber hygiene — but executing it at scale, securely, and fast? That's the real challenge. ThreatLocker's Patch Management flips the script with control, visibility, and Zero Trust workflows built for today's threat landscape. [...]",
    "published": "2025-05-21T14:02:12",
    "source": "BleepingComputer"
  },
  {
    "title": "European Union sanctions Stark Industries for enabling cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/european-union-sanctions-stark-industries-for-enabling-cyberattacks/",
    "summary": "The European Union has imposed strict sanctions against web-hosting provider Stark Industries and the two individuals running it, CEO Iurie Neculiti and owner Ivan Neculiti, for enabling \"destabilising activities\" against the Union. [...]",
    "published": "2025-05-21T13:37:18",
    "source": "BleepingComputer"
  },
  {
    "title": "PureRAT Malware Spikes 4x in 2025, Deploying PureLogs to Target Russian Firms",
    "link": "https://thehackernews.com/2025/05/purerat-malware-spikes-4x-in-2025.html",
    "summary": "Russian organizations have become the target of a phishing campaign that distributes malware called PureRAT, according to new findings from Kaspersky.\n\"The campaign aimed at Russian business began back in March 2023, but in the first third of 2025 the number of attacks quadrupled compared to the sam",
    "published": "2025-05-21T13:10:00",
    "source": "HackerNews"
  },
  {
    "title": "Fake Kling AI Facebook Ads Deliver RAT Malware to Over 22 Million Potential Victims",
    "link": "https://thehackernews.com/2025/05/fake-kling-ai-facebook-ads-deliver-rat.html",
    "summary": "Counterfeit Facebook pages and sponsored ads on the social media platform are being employed to direct users to fake websites masquerading as Kling AI with the goal of tricking victims into downloading malware.\nKling AI is an artificial intelligence (AI)-powered platform to synthesize images and vid",
    "published": "2025-05-21T12:15:00",
    "source": "HackerNews"
  },
  {
    "title": "Kettering Health hit by system-wide outage after ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/kettering-health-hit-by-system-wide-outage-after-ransomware-attack/",
    "summary": "Kettering Health, a healthcare network that operates 14 medical centers in Ohio, was forced to cancel inpatient and outpatient procedures following a cyberattack that caused a system-wide technology outage. [...]",
    "published": "2025-05-21T11:45:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Securing CI/CD workflows with Wazuh",
    "link": "https://thehackernews.com/2025/05/securing-cicd-workflows-with-wazuh.html",
    "summary": "Continuous Integration and Continuous Delivery/Deployment (CI/CD) refers to practices that automate how code is developed and released to different environments. CI/CD pipelines are fundamental in modern software development, ensuring code is consistently tested, built, and deployed quickly and effi",
    "published": "2025-05-21T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "How to Detect Phishing Attacks Faster: Tycoon2FA Example",
    "link": "https://thehackernews.com/2025/05/how-to-detect-phishing-attacks-faster.html",
    "summary": "It takes just one email to compromise an entire system. A single well-crafted message can bypass filters, trick employees, and give attackers the access they need. Left undetected, these threats can lead to credential theft, unauthorized access, and even full-scale breaches. As phishing techniques b",
    "published": "2025-05-21T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Marks & Spencer faces $402 million profit hit after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/marks-and-spencer-faces-402-million-profit-hit-after-cyberattack/",
    "summary": "British retailer giant Marks & Spencer (M&amp;S) is bracing for a potential profit hit of up to £300 million £300 million ($402 million) following a recent cyberattack that led to widespread operational and sales disruptions. [...]",
    "published": "2025-05-21T10:10:22",
    "source": "BleepingComputer"
  },
  {
    "title": "Coinbase says recent data breach impacts 69,461 customers",
    "link": "https://www.bleepingcomputer.com/news/security/coinbase-says-recent-data-breach-impacts-69-461-customers/",
    "summary": "Coinbase, a cryptocurrency exchange with over 100 million customers, revealed that a recent data breach in which cybercriminals stole customer and corporate data affected 69,461 individuals [...]",
    "published": "2025-05-21T09:33:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Researchers Expose PWA JavaScript Attack That Redirects Users to Adult Scam Apps",
    "link": "https://thehackernews.com/2025/05/researchers-expose-pwa-javascript.html",
    "summary": "Cybersecurity researchers have discovered a new campaign that employs malicious JavaScript injections to redirect site visitors on mobile devices to a Chinese adult-content Progressive Web App (PWA) scam.\n\"While the payload itself is nothing new (yet another adult gambling scam), the delivery method",
    "published": "2025-05-21T09:01:00",
    "source": "HackerNews"
  }
]