[
  {
    "title": "Critical Cisco Vulnerability in Unified CM Grants Root Access via Static Credentials",
    "link": "https://thehackernews.com/2025/07/critical-cisco-vulnerability-in-unified.html",
    "summary": "Cisco has released security updates to address a maximum-severity security flaw in Unified Communications Manager (Unified CM) and Unified Communications Manager Session Management Edition (Unified CM SME) that could permit an attacker to login to a susceptible device as the root user, allowing them",
    "published": "2025-07-03T04:24:00",
    "source": "HackerNews"
  },
  {
    "title": "NimDoor crypto-theft macOS malware revives itself when killed",
    "link": "https://www.bleepingcomputer.com/news/security/nimdoor-crypto-theft-macos-malware-revives-itself-when-killed/",
    "summary": "North Korean state-backed hackers have been using a new family of macOS malware called NimDoor in a campaign that targets web3 and cryptocurrency organizations. [...]",
    "published": "2025-07-02T19:36:27",
    "source": "BleepingComputer"
  },
  {
    "title": "DOJ investigates ex-ransomware negotiator over extortion kickbacks",
    "link": "https://www.bleepingcomputer.com/news/security/doj-investigates-ex-ransomware-negotiator-over-extortion-kickbacks/",
    "summary": "An ex-ransomware negotiator is under criminal investigation by the Department of Justice for allegedly working with ransomware gangs to profit from extortion payment deals. [...]",
    "published": "2025-07-02T19:14:41",
    "source": "BleepingComputer"
  },
  {
    "title": "Spain arrests hackers who targeted politicians and journalists",
    "link": "https://www.bleepingcomputer.com/news/security/spain-arrests-hackers-who-targeted-politicians-and-journalists/",
    "summary": "The Spanish police have arrested two individuals in the province of Las Palmas for their alleged involvement in cybercriminal activity, including data theft from the country's government. [...]",
    "published": "2025-07-02T17:30:05",
    "source": "BleepingComputer"
  }
]