[
  {
    "title": "Microsoft confirms May Windows 10 updates trigger BitLocker recovery",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-may-windows-10-updates-trigger-bitlocker-recovery/",
    "summary": "​Microsoft has confirmed that some Windows 10 and Windows 10 Enterprise LTSC 2021 systems will boot into BitLocker recovery after installing the May 2025 security updates. [...]",
    "published": "2025-05-16T18:36:04",
    "source": "BleepingComputer"
  },
  {
    "title": "Israel arrests new suspect behind Nomad Bridge $190M crypto hack",
    "link": "https://www.bleepingcomputer.com/news/legal/israel-arrests-new-suspect-behind-nomad-bridge-190m-crypto-hack/",
    "summary": "An American-Israeli national named Osei Morrell has been arrested in Israel for his alleged involvement in exploiting the Nomad bridge smart-contract in August 2022 that allowed hackers to siphon $190 million. [...]",
    "published": "2025-05-16T16:25:50",
    "source": "BleepingComputer"
  },
  {
    "title": "ChatGPT rolls out Codex, an AI tool for software programming",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-rolls-out-codex-an-ai-tool-for-software-programming/",
    "summary": "OpenAI is rolling out 'Codex' for ChatGPT, which is an AI agent that automates and delegates programming tasks for software engineers. [...]",
    "published": "2025-05-16T15:49:22",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers exploit VMware ESXi, Microsoft SharePoint zero-days at Pwn2Own",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-vmware-esxi-microsoft-sharepoint-zero-days-at-pwn2own/",
    "summary": "During the second day of Pwn2Own Berlin 2025, competitors earned $435,000 after exploiting zero-day bugs in multiple products, including Microsoft SharePoint, VMware ESXi, Oracle VirtualBox, Red Hat Enterprise Linux, and Mozilla Firefox. [...]",
    "published": "2025-05-16T15:23:22",
    "source": "BleepingComputer"
  },
  {
    "title": "Printer maker Procolored offered malware-laced drivers for months",
    "link": "https://www.bleepingcomputer.com/news/security/printer-maker-procolored-offered-malware-laced-drivers-for-months/",
    "summary": "For at least half a year, the official software supplied with Procolored printers included malware in the form of a remote access trojan and a cryptocurrency stealer. [...]",
    "published": "2025-05-16T14:56:51",
    "source": "BleepingComputer"
  },
  {
    "title": "Ransomware gangs increasingly use Skitnet post-exploitation malware",
    "link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-increasingly-use-skitnet-post-exploitation-malware/",
    "summary": "Ransomware gang members increasingly use a new malware called Skitnet (\"Bossnet\") to perform stealthy post-exploitation activities on breached networks. [...]",
    "published": "2025-05-16T14:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "New HTTPBot Botnet Launches 200+ Precision DDoS Attacks on Gaming and Tech Sectors",
    "link": "https://thehackernews.com/2025/05/new-httpbot-botnet-launches-200.html",
    "summary": "Cybersecurity researchers are calling attention to a new botnet malware called HTTPBot that has been used to primarily single out the gaming industry, as well as technology companies and educational institutions in China.\n\"Over the past few months, it has expanded aggressively, continuously leveragi",
    "published": "2025-05-16T11:37:00",
    "source": "HackerNews"
  },
  {
    "title": "Top 10 Best Practices for Effective Data Protection",
    "link": "https://thehackernews.com/2025/05/top-10-best-practices-for-effective.html",
    "summary": "Data is the lifeblood of productivity, and protecting sensitive data is more critical than ever. With cyber threats evolving rapidly and data privacy regulations tightening, organizations must stay vigilant and proactive to safeguard their most valuable assets. But how do you build an effective data",
    "published": "2025-05-16T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Researchers Expose New Intel CPU Flaws Enabling Memory Leaks and Spectre v2 Attacks",
    "link": "https://thehackernews.com/2025/05/researchers-expose-new-intel-cpu-flaws.html",
    "summary": "Researchers at ETH Zürich have discovered yet another security flaw that they say impacts all modern Intel CPUs and causes them to leak sensitive data from memory, showing that the vulnerability known as Spectre continues to haunt computer systems after more than seven years.\nThe vulnerability, refe",
    "published": "2025-05-16T09:08:00",
    "source": "HackerNews"
  },
  {
    "title": "US charges 12 more suspects linked to $230 million crypto theft",
    "link": "https://www.bleepingcomputer.com/news/security/us-charges-12-more-suspects-linked-to-230-million-crypto-theft/",
    "summary": "Twelve more suspects were charged in a RICO conspiracy for their alleged involvement in the theft of over $230 million in cryptocurrency and laundering the funds using crypto exchanges and mixing services. [...]",
    "published": "2025-05-16T09:06:41",
    "source": "BleepingComputer"
  }
]