[
  {
    "title": "Researchers Detail Bitter APT’s Evolving Tactics as Its Geographic Scope Expands",
    "link": "https://thehackernews.com/2025/06/bitter-hacker-group-expands-cyber.html",
    "summary": "The threat actor known as Bitter has been assessed to be a state-backed hacking group that's tasked with gathering intelligence that aligns with the interests of the Indian government.\nThat's according to new findings jointly published by Proofpoint and Threatray in an exhaustive two-part analysis.\n",
    "published": "2025-06-05T13:53:00",
    "source": "HackerNews"
  },
  {
    "title": "Germany fines Vodafone $51 million for privacy, security breaches",
    "link": "https://www.bleepingcomputer.com/news/security/germany-fines-vodafone-51-million-for-privacy-security-breaches/",
    "summary": "The German data protection authority (BfDI) has fined Vodafone GmbH, the telecommunications company's German subsidiary, €45 million ($51.4 million) for privacy and security violations. [...]",
    "published": "2025-06-05T11:29:18",
    "source": "BleepingComputer"
  },
  {
    "title": "Redefining Cyber Value: Why Business Impact Should Lead the Security Conversation",
    "link": "https://thehackernews.com/2025/06/redefining-cyber-value-why-business.html",
    "summary": "Security teams face growing demands with more tools, more data, and higher expectations than ever. Boards approve large security budgets, yet still ask the same question: what is the business getting in return? CISOs respond with reports on controls and vulnerability counts – but executives want to ",
    "published": "2025-06-05T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Iran-Linked BladedFeline Hits Iraqi and Kurdish Targets with Whisper and Spearal Malware",
    "link": "https://thehackernews.com/2025/06/iran-linked-bladedfeline-hits-iraqi-and.html",
    "summary": "An Iran-aligned hacking group has been attributed to a new set of cyber attacks targeting Kurdish and Iraqi government officials in early 2024.\nThe activity is tied to a threat group ESET tracks as BladedFeline, which is assessed with medium confidence to be a sub-cluster within OilRig, a known Iran",
    "published": "2025-06-05T10:59:00",
    "source": "HackerNews"
  },
  {
    "title": "DoJ Seizes 145 Domains Tied to BidenCash Carding Marketplace in Global Takedown",
    "link": "https://thehackernews.com/2025/06/doj-seizes-145-domains-tied-to.html",
    "summary": "The U.S. Department of Justice (DoJ) on Wednesday announced the seizure of cryptocurrency funds and about 145 clearnet and dark web domains associated with an illicit carding marketplace called BidenCash.\n\"The operators of the BidenCash marketplace use the platform to simplify the process of buying ",
    "published": "2025-06-05T10:16:00",
    "source": "HackerNews"
  },
  {
    "title": "ViLE gang members sentenced for DEA portal breach, extortion",
    "link": "https://www.bleepingcomputer.com/news/security/vile-gang-members-sentenced-for-breaching-law-enforcement-portal/",
    "summary": "Two members of a group of cybercriminals named ViLE were sentenced this week for hacking into a federal law enforcement web portal in an extortion scheme. [...]",
    "published": "2025-06-05T09:26:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Interlock ransomware claims Kettering Health breach, leaks stolen data",
    "link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-claims-kettering-health-breach-leaks-stolen-data/",
    "summary": "The Interlock ransomware gang has claimed a recent cyberattack on the Kettering Health healthcare network and leaked data allegedly stolen from breached systems. [...]",
    "published": "2025-06-05T07:31:11",
    "source": "BleepingComputer"
  },
  {
    "title": "US offers $10M for tips on state hackers tied to RedLine malware",
    "link": "https://www.bleepingcomputer.com/news/security/us-offers-10m-for-tips-on-state-hackers-tied-to-redline-malware/",
    "summary": "The U.S. Department of State has announced a reward of up to $10 million for any information on government-sponsored hackers with ties to the RedLine infostealer malware operation and its suspected creator, Russian national Maxim Alexandrovich Rudometov. [...]",
    "published": "2025-06-05T06:25:21",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Cisco ISE Auth Bypass Flaw Impacts Cloud Deployments on AWS, Azure, and OCI",
    "link": "https://thehackernews.com/2025/06/critical-cisco-ise-auth-bypass-flaw.html",
    "summary": "Cisco has released security patches to address a critical security flaw impacting the Identity Services Engine (ISE) that, if successfully exploited, could allow unauthenticated actors to carry out malicious actions on susceptible systems.\nThe security defect, tracked as CVE-2025-20286, carries a CV",
    "published": "2025-06-05T05:37:00",
    "source": "HackerNews"
  }
]