[
  {
    "title": "FTC approves $126 million in Fortnite refunds over ‘dark patterns’",
    "link": "https://www.bleepingcomputer.com/news/legal/ftc-approves-126-million-in-fortnite-refunds-over-dark-patterns/",
    "summary": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwanted purchases. [...]",
    "published": "2025-06-26T20:27:08",
    "source": "BleepingComputer"
  },
  {
    "title": "Brother printer bug in 689 models exposes default admin passwords",
    "link": "https://www.bleepingcomputer.com/news/security/brother-printer-bug-in-689-models-exposes-default-admin-passwords/",
    "summary": "A total of 689 printer models from Brother, along with 53 other models from Fujifilm, Toshiba, and Konica Minolta, come with a default administrator password that remote attackers can generate. Even worse, there is no way to fix the flaw via firmware in existing printers. [...]",
    "published": "2025-06-26T18:10:25",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Open VSX Registry Flaw Exposes Millions of Developers to Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/06/critical-open-vsx-registry-flaw-exposes.html",
    "summary": "Cybersecurity researchers have disclosed a critical vulnerability in the Open VSX Registry (\"open-vsx[.]org\") that, if successfully exploited, could have enabled attackers to take control of the entire Visual Studio Code extensions marketplace, posing a severe supply chain risk.\n\"This vulnerability ",
    "published": "2025-06-26T16:46:00",
    "source": "HackerNews"
  },
  {
    "title": "Ex-student charged over hacking university for cheap parking, data breaches",
    "link": "https://www.bleepingcomputer.com/news/security/ex-student-charged-over-hacking-university-for-cheap-parking-data-breaches/",
    "summary": "New South Wales police in Australia have arrested a 27-year-old former Western Sydney University (WSU) student for allegedly hacking into the University's systems on multiple occasions, starting with a scheme to obtain cheaper parking. [...]",
    "published": "2025-06-26T16:24:59",
    "source": "BleepingComputer"
  },
  {
    "title": "Cisco warns of max severity RCE flaws in Identity Services Engine",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-max-severity-rce-flaws-in-identity-services-engine/",
    "summary": "Cisco has published a bulletin to warn about two critical, unauthenticated remote code execution (RCE) vulnerabilities affecting Cisco Identity Services Engine (ISE) and the Passive Identity Connector (ISE-PIC). [...]",
    "published": "2025-06-26T15:20:56",
    "source": "BleepingComputer"
  },
  {
    "title": "Man pleads guilty to hacking networks to pitch security services",
    "link": "https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-networks-to-pitch-security-services/",
    "summary": "A Kansas City man has pleaded guilty to hacking multiple organizations to advertise his cybersecurity services, the U.S. Department of Justice announced on Wednesday. [...]",
    "published": "2025-06-26T14:03:40",
    "source": "BleepingComputer"
  },
  {
    "title": "3 key takeaways from the Scattered Spider attacks on insurance firms",
    "link": "https://www.bleepingcomputer.com/news/security/3-key-takeaways-from-the-scattered-spider-attacks-on-insurance-firms/",
    "summary": "Scattered Spider recently pivoted from targeting worldwide retailers to U.S. based insurance firms, with no signs of slowing down. Learn about Scattered Spider TTPs and how to defend your organization against MFA bypass, help desk scams, and more. [...]",
    "published": "2025-06-26T14:02:12",
    "source": "BleepingComputer"
  }
]