[
  {
    "title": "Spain arrests hackers who targeted politicians and journalists",
    "link": "https://www.bleepingcomputer.com/news/security/spain-arrests-hackers-who-targeted-politicians-and-journalists/",
    "summary": "The Spanish police have arrested two individuals in the province of Las Palmas for their alleged involvement in cybercriminal activity, including data theft from the country's government. [...]",
    "published": "2025-07-02T17:30:05",
    "source": "BleepingComputer"
  },
  {
    "title": "Cisco warns that Unified CM has hardcoded root SSH credentials",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-removes-unified-cm-callManager-backdoor-root-account/",
    "summary": "Cisco has removed a backdoor account from its Unified Communications Manager (Unified CM), which would have allowed remote attackers to log in to unpatched devices with root privileges. [...]",
    "published": "2025-07-02T17:08:24",
    "source": "BleepingComputer"
  },
  {
    "title": "Citrix warns of login issues after NetScaler auth bypass patch",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-warns-of-login-issues-after-netscaler-auth-bypass-patch/",
    "summary": "Citrix warns that patching recently disclosed vulnerabilities that can be exploited to bypass authentication and launch denial-of-service attacks may also break login pages on NetScaler ADC and Gateway appliances. [...]",
    "published": "2025-07-02T16:19:05",
    "source": "BleepingComputer"
  },
  {
    "title": "Forminator plugin flaw exposes WordPress sites to takeover attacks",
    "link": "https://www.bleepingcomputer.com/news/security/forminator-plugin-flaw-exposes-wordpress-sites-to-takeover-attacks/",
    "summary": "The Forminator plugin for WordPress is vulnerable to an unauthenticated arbitrary file deletion flaw that could enable full site takeover attacks. [...]",
    "published": "2025-07-02T15:38:32",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft fixes ‘Print to PDF’ feature broken by Windows update",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-print-to-pdf-feature-broken-by-windows-update/",
    "summary": "Microsoft has fixed a known bug that breaks the 'Print to PDF' feature on Windows 11 24H2 systems after installing the April 2025 preview update. [...]",
    "published": "2025-07-02T13:52:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Dozens of fake wallet add-ons flood Firefox store to drain crypto",
    "link": "https://www.bleepingcomputer.com/news/security/dozens-of-fake-wallet-add-ons-flood-firefox-store-to-drain-crypto/",
    "summary": "More than 40 fake extensions in Firefox's official add-ons store are impersonating popular cryptocurrency wallets from trusted providers to steal wallet credentials and sensitive data. [...]",
    "published": "2025-07-02T13:16:01",
    "source": "BleepingComputer"
  },
  {
    "title": "Grok 4 spotted ahead of launch with special coding features",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/grok-4-spotted-ahead-of-launch-with-special-coding-features/",
    "summary": "Elon Musk-funded xAI is skipping Grok 3.5 and releasing Grok 4 after Independence Day in the United States. [...]",
    "published": "2025-07-02T12:22:34",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft: DNS issue blocks delivery of Exchange Online OTP codes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-links-dns-issue-to-exchange-online-otp-delivery-failures/",
    "summary": "Microsoft is working to fix a DNS misconfiguration that is causing one-time passcode (OTP) message delivery failures in Exchange Online for some users. [...]",
    "published": "2025-07-02T12:21:59",
    "source": "BleepingComputer"
  },
  {
    "title": "That Network Traffic Looks Legit, But it Could be Hiding a Serious Threat",
    "link": "https://thehackernews.com/2025/07/that-network-traffic-looks-legit-but-it.html",
    "summary": "With nearly 80% of cyber threats now mimicking legitimate user behavior, how are top SOCs determining what’s legitimate traffic and what is potentially dangerous?\nWhere do you turn when firewalls and endpoint detection and response (EDR) fall short at detecting the most important threats to your org",
    "published": "2025-07-02T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Hackers Using PDFs to Impersonate Microsoft, DocuSign, and More in Callback Phishing Campaigns",
    "link": "https://thehackernews.com/2025/07/hackers-using-pdfs-to-impersonate.html",
    "summary": "Cybersecurity researchers are calling attention to phishing campaigns that impersonate popular brands and trick targets into calling phone numbers operated by threat actors.\n\"A significant portion of email threats with PDF payloads persuade victims to call adversary-controlled phone numbers, display",
    "published": "2025-07-02T10:45:00",
    "source": "HackerNews"
  },
  {
    "title": "U.S. Sanctions Russian Bulletproof Hosting Provider for Supporting Cybercriminals Behind Ransomware",
    "link": "https://thehackernews.com/2025/07/us-sanctions-russian-bulletproof.html",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) has levied sanctions against Russia-based bulletproof hosting (BPH) service provider Aeza Group to assist threat actors in their malicious activities and targeting victims in the country and across the world.\nThe sanctions",
    "published": "2025-07-02T08:56:00",
    "source": "HackerNews"
  },
  {
    "title": "Vercel's v0 AI Tool Weaponized by Cybercriminals to Rapidly Create Fake Login Pages at Scale",
    "link": "https://thehackernews.com/2025/07/vercels-v0-ai-tool-weaponized-by.html",
    "summary": "Unknown threat actors have been observed weaponizing v0, a generative artificial intelligence (AI) tool from Vercel, to design fake sign-in pages that impersonate their legitimate counterparts.\n\"This observation signals a new evolution in the weaponization of Generative AI by threat actors who have ",
    "published": "2025-07-02T05:48:00",
    "source": "HackerNews"
  }
]