[
  {
    "title": "Poor Passwords Tattle on AI Hiring Bot Maker Paradox.ai",
    "link": "https://krebsonsecurity.com/2025/07/poor-passwords-tattle-on-ai-hiring-bot-maker-paradox-ai/",
    "summary": "Security researchers recently revealed that the personal information of millions of people who applied for jobs at McDonald's was exposed after they guessed the password (\"123456\") for the fast food chain's account at Paradox.ai, a company that makes artificial intelligence based hiring chatbots use",
    "published": "2025-07-18T01:23:20",
    "source": "Krebs"
  },
  {
    "title": "Citrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-bleed-2-exploited-weeks-before-pocs-as-citrix-denied-attacks/",
    "summary": "A critical Citrix NetScaler vulnerability, tracked as CVE-2025-5777 and dubbed \"CitrixBleed 2,\" was actively exploited nearly two weeks before proof-of-concept (PoC) exploits were made public, despite Citrix stating that there was no evidence of attacks. [...]",
    "published": "2025-07-17T23:37:34",
    "source": "BleepingComputer"
  },
  {
    "title": "VMware fixes four ESXi zero-day bugs exploited at Pwn2Own Berlin",
    "link": "https://www.bleepingcomputer.com/news/security/vmware-fixes-four-esxi-zero-day-bugs-exploited-at-pwn2own-berlin/",
    "summary": "VMware fixed four vulnerabilities in VMware ESXi, Workstation, Fusion, and Tools that were exploited as zero-days during the Pwn2Own Berlin 2025 hacking contest in May 2025. [...]",
    "published": "2025-07-17T21:36:42",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft Teams voice calls abused to push Matanbuchus malware",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-teams-voice-calls-abused-to-push-matanbuchus-malware/",
    "summary": "The Matanbuchus malware loader has been seen being distributed through social engineering over Microsoft Teams calls impersonating IT helpdesk. [...]",
    "published": "2025-07-17T21:28:31",
    "source": "BleepingComputer"
  },
  {
    "title": "Google sues to disrupt BadBox 2.0 botnet infecting 10 million devices",
    "link": "https://www.bleepingcomputer.com/news/security/google-sues-to-disrupt-badbox-20-botnet-infecting-10-million-devices/",
    "summary": "Google has filed a lawsuit against the anonymous operators of the Android BadBox 2.0 malware botnet, accusing them of running a global ad fraud scheme against the company's advertising platforms. [...]",
    "published": "2025-07-17T19:59:26",
    "source": "BleepingComputer"
  }
]