[
  {
    "title": "O2 UK patches bug leaking mobile user location from call metadata",
    "link": "https://www.bleepingcomputer.com/news/security/o2-uk-patches-bug-leaking-mobile-user-location-from-call-metadata/",
    "summary": "A flaw in O2 UK's implementation of VoLTE and WiFi Calling technologies could allow anyone to expose the general location of a person and other identifiers by calling the target. [...]",
    "published": "2025-05-19T19:20:04",
    "source": "BleepingComputer"
  },
  {
    "title": "Windows 10 emergency updates fix BitLocker recovery issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-emergency-updates-fix-bitlocker-recovery-issues/",
    "summary": "Microsoft has released out-of-band updates to fix a known issue causing Windows 10 systems to boot into BitLocker recovery after installing the May 2025 security updates. [...]",
    "published": "2025-05-19T17:59:51",
    "source": "BleepingComputer"
  },
  {
    "title": "Arla Foods confirms cyberattack disrupts production, causes delays",
    "link": "https://www.bleepingcomputer.com/news/security/arla-foods-confirms-cyberattack-disrupts-production-causes-delays/",
    "summary": "Arla Foods has confirmed to BleepingComputer that it was targeted by a cyberattack that has disrupted its production operations. [...]",
    "published": "2025-05-19T17:53:27",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft unveils Windows AI Foundry for AI-powered PC apps",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-windows-ai-foundry-for-ai-powered-pc-apps/",
    "summary": "Microsoft is replacing 'Copilot Runtime' with Windows AI Foundry to help developers build, experiment, and reach users with AI experiences in their apps. [...]",
    "published": "2025-05-19T16:18:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft confirms new \"Advanced\" Settings for Windows 11",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-new-advanced-settings-for-windows-11/",
    "summary": "At the Build 2025 developer conference, Microsoft announced a new 'Advanced Settings' feature to help users and developers personalize the OS experience. [...]",
    "published": "2025-05-19T16:06:46",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft open-sources Windows Subsystem for Linux at Build 2025",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-open-sources-windows-subsystem-for-linux-at-build-2025/",
    "summary": "Microsoft has open-sourced the Windows Subsystem for Linux (WSL), making its source code available on GitHub, except for a few components that are part of Windows. [...]",
    "published": "2025-05-19T16:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "RVTools Official Site Hacked to Deliver Bumblebee Malware via Trojanized Installer",
    "link": "https://thehackernews.com/2025/05/rvtools-official-site-hacked-to-deliver.html",
    "summary": "The official site for RVTools has been hacked to serve a compromised installer for the popular VMware environment reporting utility.\n\"Robware.net and RVTools.com are currently offline. We are working expeditiously to restore service and appreciate your patience,\" the company said in a statement post",
    "published": "2025-05-19T15:48:00",
    "source": "HackerNews"
  },
  {
    "title": "UK Legal Aid Agency confirms applicant data stolen in data breach",
    "link": "https://www.bleepingcomputer.com/news/security/uk-legal-aid-agency-confirms-applicant-data-stolen-in-data-breach/",
    "summary": "The United Kingdom's Legal Aid Agency (LAA) has confirmed that a recent cyberattack is more serious than first believed, with hackers stealing a large trove of sensitive applicant data in a data breach. [...]",
    "published": "2025-05-19T15:10:44",
    "source": "BleepingComputer"
  },
  {
    "title": "Ransomware Gangs Use Skitnet Malware for Stealthy Data Theft and Remote Access",
    "link": "https://thehackernews.com/2025/05/ransomware-gangs-use-skitnet-malware.html",
    "summary": "Several ransomware actors are using a malware called Skitnet as part of their post-exploitation efforts to steal sensitive data and establish remote control over compromised hosts.\n\"Skitnet has been sold on underground forums like RAMP since April 2024,\" Swiss cybersecurity company PRODAFT told The ",
    "published": "2025-05-19T14:38:00",
    "source": "HackerNews"
  },
  {
    "title": "Mozilla fixes Firefox zero-days exploited at hacking contest",
    "link": "https://www.bleepingcomputer.com/news/security/mozilla-fixes-firefox-zero-days-exploited-at-hacking-contest/",
    "summary": "Mozilla released emergency security updates to address two Firefox zero-day vulnerabilities demonstrated in the recent Pwn2Own Berlin 2025 hacking competition. [...]",
    "published": "2025-05-19T14:10:56",
    "source": "BleepingComputer"
  },
  {
    "title": "Hackers earn $1,078,750 for 28 zero-days at Pwn2Own Berlin",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-earn-1-078-750-for-28-zero-days-at-pwn2own-berlin/",
    "summary": "The Pwn2Own Berlin 2025 hacking competition has concluded, with security researchers earning $1,078,750 after exploiting 29 zero-day vulnerabilities and encountering some bug collisions. [...]",
    "published": "2025-05-19T14:03:43",
    "source": "BleepingComputer"
  },
  {
    "title": "Why CTEM is the Winning Bet for CISOs in 2025",
    "link": "https://thehackernews.com/2025/05/why-ctem-is-winning-bet-for-cisos-in.html",
    "summary": "Continuous Threat Exposure Management (CTEM) has moved from concept to cornerstone, solidifying its role as a strategic enabler for CISOs. No longer a theoretical framework, CTEM now anchors today’s cybersecurity programs by continuously aligning security efforts with real-world risk.\nAt the heart o",
    "published": "2025-05-19T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Firefox Patches 2 Zero-Days Exploited at Pwn2Own Berlin with $100K in Rewards",
    "link": "https://thehackernews.com/2025/05/firefox-patches-2-zero-days-exploited.html",
    "summary": "Mozilla has released security updates to address two critical security flaws in its Firefox browser that could be potentially exploited to access sensitive data or achieve code execution.\nThe vulnerabilities, both of which were exploited as a zero-day at Pwn2Own Berlin, are listed below -\n\nCVE-2025-",
    "published": "2025-05-19T10:37:00",
    "source": "HackerNews"
  },
  {
    "title": "⚡ Weekly Recap: Zero-Day Exploits, Insider Threats, APT Targeting, Botnets and More",
    "link": "https://thehackernews.com/2025/05/weekly-recap-zero-day-exploits-insider.html",
    "summary": "Cybersecurity leaders aren’t just dealing with attacks—they’re also protecting trust, keeping systems running, and maintaining their organization’s reputation. This week’s developments highlight a bigger issue: as we rely more on digital tools, hidden weaknesses can quietly grow.&nbsp;\nJust fixing p",
    "published": "2025-05-19T10:00:00",
    "source": "HackerNews"
  }
]