[
  {
    "title": "New HTTPBot Botnet Launches 200+ Precision DDoS Attacks on Gaming and Tech Sectors",
    "link": "https://thehackernews.com/2025/05/new-httpbot-botnet-launches-200.html",
    "summary": "Cybersecurity researchers are calling attention to a new botnet malware called HTTPBot that has been used to primarily single out the gaming industry, as well as technology companies and educational institutions in China.\n\"Over the past few months, it has expanded aggressively, continuously leveragi",
    "published": "2025-05-16T11:37:00",
    "source": "HackerNews"
  },
  {
    "title": "Top 10 Best Practices for Effective Data Protection",
    "link": "https://thehackernews.com/2025/05/top-10-best-practices-for-effective.html",
    "summary": "Data is the lifeblood of productivity, and protecting sensitive data is more critical than ever. With cyber threats evolving rapidly and data privacy regulations tightening, organizations must stay vigilant and proactive to safeguard their most valuable assets. But how do you build an effective data",
    "published": "2025-05-16T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Researchers Expose New Intel CPU Flaws Enabling Memory Leaks and Spectre v2 Attacks",
    "link": "https://thehackernews.com/2025/05/researchers-expose-new-intel-cpu-flaws.html",
    "summary": "Researchers at ETH Zürich have discovered yet another security flaw that they say impacts all modern Intel CPUs and causes them to leak sensitive data from memory, showing that the vulnerability known as Spectre continues to haunt computer systems after more than seven years.\nThe vulnerability, refe",
    "published": "2025-05-16T09:08:00",
    "source": "HackerNews"
  },
  {
    "title": "US charges 12 more suspects linked to $230 million crypto theft",
    "link": "https://www.bleepingcomputer.com/news/security/us-charges-12-more-suspects-linked-to-230-million-crypto-theft/",
    "summary": "Twelve more suspects were charged in a RICO conspiracy for their alleged involvement in the theft of over $230 million in cryptocurrency and laundering the funds using crypto exchanges and mixing services. [...]",
    "published": "2025-05-16T09:06:41",
    "source": "BleepingComputer"
  },
  {
    "title": "CISA tags recently patched Chrome bug as actively exploited",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-tags-recently-patched-chrome-bug-as-actively-exploited-zero-day/",
    "summary": "On Thursday, CISA warned U.S. federal agencies to secure their systems against ongoing attacks exploiting a high-severity vulnerability in the Chrome web browser. [...]",
    "published": "2025-05-16T08:13:19",
    "source": "BleepingComputer"
  },
  {
    "title": "Fileless Remcos RAT Delivered via LNK Files and MSHTA in PowerShell-Based Attacks",
    "link": "https://thehackernews.com/2025/05/fileless-remcos-rat-delivered-via-lnk.html",
    "summary": "Cybersecurity researchers have shed light on a new malware campaign that makes use of a PowerShell-based shellcode loader to deploy a remote access trojan called Remcos RAT.\n\"Threat actors delivered malicious LNK files embedded within ZIP archives, often disguised as Office documents,\" Qualys securi",
    "published": "2025-05-16T07:56:00",
    "source": "HackerNews"
  },
  {
    "title": "[Webinar] From Code to Cloud to SOC: Learn a Smarter Way to Defend Modern Applications",
    "link": "https://thehackernews.com/2025/05/from-code-to-cloud-to-soc-learn-smarter.html",
    "summary": "Modern apps move fast—faster than most security teams can keep up. As businesses rush to build in the cloud, security often lags behind. Teams scan code in isolation, react late to cloud threats, and monitor SOC alerts only after damage is done.\nAttackers don’t wait. They exploit vulnerabilities wit",
    "published": "2025-05-16T07:27:00",
    "source": "HackerNews"
  }
]