[
  {
    "title": "Microsoft open-sources VS Code Copilot Chat extension on GitHub",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-open-sources-vs-code-copilot-chat-extension-on-github/",
    "summary": "Microsoft has released the source code for the GitHub Copilot Chat extension for VS Code under the MIT license. [...]",
    "published": "2025-07-01T19:11:26",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Vulnerability in Anthropic's MCP Exposes Developer Machines to Remote Exploits",
    "link": "https://thehackernews.com/2025/07/critical-vulnerability-in-anthropics.html",
    "summary": "Cybersecurity researchers have discovered a critical security vulnerability in artificial intelligence (AI) company Anthropic's Model Context Protocol (MCP) Inspector project that could result in remote code execution (RCE) and allow an attacker to gain complete access to the hosts.\nThe vulnerabilit",
    "published": "2025-07-01T18:03:00",
    "source": "HackerNews"
  },
  {
    "title": "Kelly Benefits says 2024 data breach impacts 550,000 customers",
    "link": "https://www.bleepingcomputer.com/news/security/kelly-benefits-says-2024-data-breach-impacts-550-000-customers/",
    "summary": "Kelly & Associates Insurance Group (dba Kelly Benefits) is informing more than half a million people of a data breach that compromised their personal information. [...]",
    "published": "2025-07-01T17:28:39",
    "source": "BleepingComputer"
  },
  {
    "title": "Aeza Group sanctioned for hosting ransomware, infostealer servers",
    "link": "https://www.bleepingcomputer.com/news/security/aeza-group-sanctioned-for-hosting-ransomware-infostealer-servers/",
    "summary": "The U.S. Department of the Treasury has sanctioned Russian hosting company Aeza Group and four operators for allegedly acting as a bulletproof hosting company for ransomware gangs, infostealer operations, darknet drug markets, and Russian disinformation campaigns. [...]",
    "published": "2025-07-01T17:09:11",
    "source": "BleepingComputer"
  },
  {
    "title": "New FileFix attack runs JScript while bypassing Windows MoTW alerts",
    "link": "https://www.bleepingcomputer.com/news/security/new-filefix-attack-runs-jscript-while-bypassing-windows-motw-alerts/",
    "summary": "A new FileFix attack allows executing malicious scripts while bypassing the Mark of the Web (MoTW) protection in Windows by exploiting how browsers handle saved HTML webpages. [...]",
    "published": "2025-07-01T16:37:46",
    "source": "BleepingComputer"
  },
  {
    "title": "TA829 and UNK_GreenSec Share Tactics and Infrastructure in Ongoing Malware Campaigns",
    "link": "https://thehackernews.com/2025/07/ta829-and-unkgreensec-share-tactics-and.html",
    "summary": "Cybersecurity researchers have flagged the tactical similarities between the threat actors behind the RomCom RAT and a cluster that has been observed delivering a loader dubbed TransferLoader.\nEnterprise security firm Proofpoint is tracking the activity associated with TransferLoader to a group dubb",
    "published": "2025-07-01T16:26:00",
    "source": "HackerNews"
  },
  {
    "title": "International Criminal Court hit by new 'sophisticated' cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/international-criminal-court-hit-by-new-sophisticated-cyberattack/",
    "summary": "On Monday, the International Criminal Court (ICC) announced that it's investigating a new \"sophisticated\" cyberattack that targeted its systems last week. [...]",
    "published": "2025-07-01T14:21:28",
    "source": "BleepingComputer"
  },
  {
    "title": "US disrupts North Korean IT worker \"laptop farm\" scheme in 16 states",
    "link": "https://www.bleepingcomputer.com/news/security/us-disrupts-north-korean-it-worker-laptop-farm-scheme-in-16-states/",
    "summary": "The U.S. Department of Justice (DoJ) announced coordinated law enforcement actions against North Korean government's fund raising operations using remote IT workers. [...]",
    "published": "2025-07-01T13:56:51",
    "source": "BleepingComputer"
  },
  {
    "title": "New Flaw in IDEs Like Visual Studio Code Lets Malicious Extensions Bypass Verified Status",
    "link": "https://thehackernews.com/2025/07/new-flaw-in-ides-like-visual-studio.html",
    "summary": "A new study of integrated development environments (IDEs) like Microsoft Visual Studio Code, Visual Studio, IntelliJ IDEA, and Cursor has revealed weaknesses in how they handle the extension verification process, ultimately enabling attackers to execute malicious code on developer machines.\n\"We disc",
    "published": "2025-07-01T13:51:00",
    "source": "HackerNews"
  },
  {
    "title": "Esse Health says recent data breach affects over 263,000 patients",
    "link": "https://www.bleepingcomputer.com/news/security/esse-health-says-recent-data-breach-affects-over-263-000-patients/",
    "summary": "Esse Health, a healthcare provider based in St. Louis, Missouri, is notifying over 263,000 patients that their personal and health information was stolen in an April cyberattack. [...]",
    "published": "2025-07-01T13:04:29",
    "source": "BleepingComputer"
  },
  {
    "title": "Johnson Controls starts notifying people affected by 2023 breach",
    "link": "https://www.bleepingcomputer.com/news/security/johnson-controls-starts-notifying-people-affected-by-2023-breach/",
    "summary": "Building automation giant Johnson Controls is notifying individuals whose data was stolen in a massive ransomware attack that impacted the company's operations worldwide in September 2023. [...]",
    "published": "2025-07-01T11:47:26",
    "source": "BleepingComputer"
  },
  {
    "title": "A New Maturity Model for Browser Security: Closing the Last-Mile Risk",
    "link": "https://thehackernews.com/2025/07/a-new-maturity-model-for-browser.html",
    "summary": "Despite years of investment in Zero Trust, SSE, and endpoint protection, many enterprises are still leaving one critical layer exposed: the browser.\nIt’s where 85% of modern work now happens. It’s also where copy/paste actions, unsanctioned GenAI usage, rogue extensions, and personal devices create ",
    "published": "2025-07-01T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Google fixes fourth actively exploited Chrome zero-day of 2025",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-fourth-actively-exploited-chrome-zero-day-of-2025/",
    "summary": "Google has released emergency updates to patch another Chrome zero-day vulnerability exploited in attacks, marking the fourth such flaw fixed since the start of the year. [...]",
    "published": "2025-07-01T10:59:51",
    "source": "BleepingComputer"
  },
  {
    "title": "Chrome Zero-Day CVE-2025-6554 Under Active Attack — Google Issues Security Update",
    "link": "https://thehackernews.com/2025/07/google-patches-critical-zero-day-flaw.html",
    "summary": "Google has released security updates to address a vulnerability in its Chrome browser for which an exploit exists in the wild.\nThe zero-day vulnerability, tracked as CVE-2025-6554 (CVSS score: N/A), has been described as a type confusing flaw in the V8 JavaScript and WebAssembly engine.\n\"Type confus",
    "published": "2025-07-01T08:55:00",
    "source": "HackerNews"
  },
  {
    "title": "U.S. Arrests Facilitator in North Korean IT Worker Scheme; Seizes 29 Domains and Raids 21 Laptop Farms",
    "link": "https://thehackernews.com/2025/07/us-arrests-key-facilitator-in-north.html",
    "summary": "The U.S. Department of Justice (DoJ) on Monday announced sweeping actions targeting the North Korean information technology (IT) worker scheme, leading to the arrest of one individual and the seizure of 29 financial accounts, 21 fraudulent websites, and nearly 200 computers.\nThe coordinated action s",
    "published": "2025-07-01T07:53:00",
    "source": "HackerNews"
  }
]