[
  {
    "title": "New Chrome Zero-Day Actively Exploited; Google Issues Emergency Out-of-Band Patch",
    "link": "https://thehackernews.com/2025/06/new-chrome-zero-day-actively-exploited.html",
    "summary": "Google on Monday released out-of-band fixes to address three security issues in its Chrome browser, including one that it said has come under active exploitation in the wild.\nThe high-severity flaw is being tracked as CVE-2025-5419, and has been flagged as an out-of-bounds read and write vulnerabili",
    "published": "2025-06-03T04:22:00",
    "source": "HackerNews"
  },
  {
    "title": "Cartier discloses data breach amid fashion brand cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/cartier-discloses-data-breach-amid-fashion-brand-cyberattacks/",
    "summary": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised. [...]",
    "published": "2025-06-02T22:31:49",
    "source": "BleepingComputer"
  },
  {
    "title": "The North Face warns customers of April credential stuffing attack",
    "link": "https://www.bleepingcomputer.com/news/security/the-north-face-warns-customers-of-april-credential-stuffing-attack/",
    "summary": "Outdoor apparel retailer The North Face is warning customers that their personal information was stolen in credential stuffing attacks targeting the company's website in April. [...]",
    "published": "2025-06-02T18:37:19",
    "source": "BleepingComputer"
  },
  {
    "title": "SentinelOne: Last week’s 7-hour outage caused by software flaw",
    "link": "https://www.bleepingcomputer.com/news/technology/sentinelone-last-weeks-7-hour-outage-caused-by-software-flaw/",
    "summary": "American cybersecurity company SentinelOne revealed over the weekend that a software flaw triggered a seven-hour-long outage on Thursday. [...]",
    "published": "2025-06-02T18:24:17",
    "source": "BleepingComputer"
  },
  {
    "title": "Google Chrome to distrust Chunghwa Telecom, Netlock certificates in August",
    "link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-distrust-chunghwa-telecom-netlock-certificates-in-august/",
    "summary": "Google says it will no longer trust root CA certificates signed by Chunghwa Telecom and Netlock in the Chrome Root Store due to a pattern of compliance failures and failure to make improvements. [...]",
    "published": "2025-06-02T17:36:30",
    "source": "BleepingComputer"
  }
]