[
  {
    "title": "Linux wiper malware hidden in malicious Go modules on GitHub",
    "link": "https://www.bleepingcomputer.com/news/security/linux-wiper-malware-hidden-in-malicious-go-modules-on-github/",
    "summary": "A supply-chain attack targets Linux servers with disk-wiping malware hidden in Golang modules published on GitHub. [...]",
    "published": "2025-05-06T09:13:16",
    "source": "BleepingComputer"
  },
  {
    "title": "Microsoft pushes fix for Windows 11 update 0x80240069 errors",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-pushes-fix-for-windows-11-update-0x80240069-errors/",
    "summary": "​Microsoft has fixed a known issue preventing Windows 11 24H2 feature updates from being delivered via Windows Server Update Services (WSUS) after installing the April 2025 security updates. [...]",
    "published": "2025-05-06T08:17:40",
    "source": "BleepingComputer"
  },
  {
    "title": "Update ASAP: Google Fixes Android Flaw (CVE-2025-27363) Exploited by Attackers",
    "link": "https://thehackernews.com/2025/05/google-fixes-actively-exploited-android.html",
    "summary": "Google has released its monthly security updates for Android with fixes for 46 security flaws, including one vulnerability that it said has been exploited in the wild.\nThe vulnerability in question is CVE-2025-27363 (CVSS score: 8.1), a high-severity flaw in the System component that could lead to l",
    "published": "2025-05-06T05:46:00",
    "source": "HackerNews"
  },
  {
    "title": "Critical Langflow Flaw Added to CISA KEV List Amid Ongoing Exploitation Evidence",
    "link": "https://thehackernews.com/2025/05/critical-langflow-flaw-added-to-cisa.html",
    "summary": "A recently disclosed critical security flaw impacting the open-source Langflow platform has been added to the Known Exploited Vulnerabilities (KEV) catalog by the U.S. Cybersecurity and Infrastructure Security Agency (CISA), citing evidence of active exploitation.\nThe vulnerability, tracked as CVE-2",
    "published": "2025-05-06T04:24:00",
    "source": "HackerNews"
  },
  {
    "title": "Luna Moth extortion hackers pose as IT help desks to breach US firms",
    "link": "https://www.bleepingcomputer.com/news/security/luna-moth-extortion-hackers-pose-as-it-help-desks-to-breach-us-firms/",
    "summary": "The data-theft extortion group known as Luna Moth, aka Silent Ransom Group, has ramped up callback phishing campaigns in attacks on legal and financial institutions in the United States. [...]",
    "published": "2025-05-05T22:19:42",
    "source": "BleepingComputer"
  }
]