[
  {
    "title": "Five plead guilty to laundering $36 million stolen in investment scams",
    "link": "https://www.bleepingcomputer.com/news/security/five-plead-guilty-to-laundering-36-million-stolen-in-investment-scams/",
    "summary": "Five men from China, the United States, and Turkey pleaded guilty to their involvement in an international crime ring and laundering nearly $37 million stolen from U.S. victims in cryptocurrency investment scams carried out from Cambodia. [...]",
    "published": "2025-06-10T11:59:30",
    "source": "BleepingComputer"
  },
  {
    "title": "The Hidden Threat in Your Stack: Why Non-Human Identity Management is the Next Cybersecurity Frontier",
    "link": "https://thehackernews.com/2025/06/the-hidden-threat-in-your-stack-why-non.html",
    "summary": "Modern enterprise networks are highly complex environments that rely on hundreds of apps and infrastructure services. These systems need to interact securely and efficiently without constant human oversight, which is where non-human identities (NHIs) come in. NHIs — including application secrets, AP",
    "published": "2025-06-10T11:00:00",
    "source": "HackerNews"
  },
  {
    "title": "Researcher Found Flaw to Discover Phone Numbers Linked to Any Google Account",
    "link": "https://thehackernews.com/2025/06/researcher-found-flaw-to-discover-phone.html",
    "summary": "Google has stepped in to address a security flaw that could have made it possible to brute-force an account's recovery phone number, potentially exposing them to privacy and security risks.\nThe issue, according to Singaporean security researcher \"brutecat,\" leverages an issue in the company's accoun",
    "published": "2025-06-10T10:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Rare Werewolf APT Uses Legitimate Software in Attacks on Hundreds of Russian Enterprises",
    "link": "https://thehackernews.com/2025/06/rare-werewolf-apt-uses-legitimate.html",
    "summary": "The threat actor known as Rare Werewolf (formerly Rare Wolf) has been linked to a series of cyber attacks targeting Russia and the Commonwealth of Independent States (CIS) countries.\n\"A distinctive feature of this threat is that the attackers favor using legitimate third-party software over developi",
    "published": "2025-06-10T07:48:00",
    "source": "HackerNews"
  },
  {
    "title": "CISA Adds Erlang SSH and Roundcube Flaws to Known Exploited Vulnerabilities Catalog",
    "link": "https://thehackernews.com/2025/06/cisa-adds-erlang-ssh-and-roundcube.html",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added two critical security flaws impacting Erlang/Open Telecom Platform (OTP) SSH and Roundcube to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question ",
    "published": "2025-06-10T05:37:00",
    "source": "HackerNews"
  }
]