[
  {
    "title": "Co-op confirms data theft after DragonForce ransomware claims attack",
    "link": "https://www.bleepingcomputer.com/news/security/co-op-confirms-data-theft-after-dragonforce-ransomware-claims-attack/",
    "summary": "The Co-op cyberattack is far worse than initially reported, with the company now confirming that data was stolen for a significant number of current and past customers. [...]",
    "published": "2025-05-02T19:52:50",
    "source": "BleepingComputer"
  },
  {
    "title": "Magento supply chain attack compromises hundreds of e-stores",
    "link": "https://www.bleepingcomputer.com/news/security/magento-supply-chain-attack-compromises-hundreds-of-e-stores/",
    "summary": "A supply chain attack involving 21 backdoored Magento extensions has compromised between 500 and 1,000 e-commerce stores, including one belonging to a $40 billion multinational. [...]",
    "published": "2025-05-02T18:09:55",
    "source": "BleepingComputer"
  },
  {
    "title": "US indicts Black Kingdom ransomware admin for Microsoft Exchange attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-indicts-black-kingdom-ransomware-admin-for-microsoft-exchange-attacks/",
    "summary": "A 36-year-old Yemeni national, who is believed to be the developer and primary operator of 'Black Kingdom' ransomware, has been indicted by the United States for conducting 1,500 attacks on Microsoft Exchange servers. [...]",
    "published": "2025-05-02T14:32:11",
    "source": "BleepingComputer"
  },
  {
    "title": "UK NCSC: Cyberattacks impacting UK retailers are a wake-up call",
    "link": "https://www.bleepingcomputer.com/news/security/uk-ncsc-cyberattacks-impacting-uk-retailers-are-a-wake-up-call/",
    "summary": "The United Kingdom's National Cyber Security Centre warned that ongoing cyberattacks impacting multiple UK retail chains should be taken as a \"wake-up call.\" [...]",
    "published": "2025-05-02T13:57:31",
    "source": "BleepingComputer"
  },
  {
    "title": "TikTok Slammed With €530 Million GDPR Fine for Sending E.U. Data to China",
    "link": "https://thehackernews.com/2025/05/tiktok-slammed-with-530-million-gdpr.html",
    "summary": "Ireland's Data Protection Commission (DPC) on Friday fined popular video-sharing platform TikTok €530 million ($601 million) for infringing data protection regulations in the region by transferring European users' data to China.\n\"TikTok infringed the GDPR regarding its transfers of EEA [European Eco",
    "published": "2025-05-02T12:25:00",
    "source": "HackerNews"
  },
  {
    "title": "TikTok fined €530 million for sending European user data to China",
    "link": "https://www.bleepingcomputer.com/news/security/tiktok-fined-530-million-for-sending-european-user-data-to-china/",
    "summary": "The Irish Data Protection Commission (DPC) has fined TikTok €530 million (over $601 million) for illegally transferring the personal data of users in the European Economic Area (EEA) to China, violating the European Union's GDPR data protection regulations. [...]",
    "published": "2025-05-02T12:14:27",
    "source": "BleepingComputer"
  },
  {
    "title": "How to Automate CVE and Vulnerability Advisory Response with Tines",
    "link": "https://thehackernews.com/2025/05/how-to-automate-cve-and-vulnerability.html",
    "summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform’s Community Edition.\nA recent standout is a workflow that automates monitori",
    "published": "2025-05-02T10:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Microsoft fixes Exchange Online bug flagging Gmail emails as spam",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-exchange-online-bug-flagging-gmail-emails-as-spam/",
    "summary": "​Microsoft has resolved an issue with a machine learning model that mistakenly flagged emails from Gmail accounts as spam in Exchange Online. [...]",
    "published": "2025-05-02T10:15:10",
    "source": "BleepingComputer"
  }
]