[
  {
    "title": "FTC finalizes order requiring GoDaddy to secure hosting services",
    "link": "https://www.bleepingcomputer.com/news/security/ftc-finalizes-order-requiring-godaddy-to-secure-hosting-services/",
    "summary": "The Federal Trade Commission (FTC) has finalized an order requiring web hosting giant GoDaddy to secure its services to settle charges of data security failures that led to several data breaches since 2018. [...]",
    "published": "2025-05-22T12:28:02",
    "source": "BleepingComputer"
  },
  {
    "title": "Chinese Hackers Exploit Ivanti EPMM Bugs in Global Enterprise Network Attacks",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-ivanti-epmm.html",
    "summary": "A recently patched pair of security flaws affecting Ivanti Endpoint Manager Mobile (EPMM) software has been exploited by a China-nexus threat actor to target a wide range of sectors across Europe, North America, and the Asia-Pacific region.\nThe vulnerabilities, tracked as CVE-2025-4427 (CVSS score: ",
    "published": "2025-05-22T12:07:00",
    "source": "HackerNews"
  },
  {
    "title": "Webinar: Learn How to Build a Reasonable and Legally Defensible Cybersecurity Program",
    "link": "https://thehackernews.com/2025/05/webinar-learn-how-to-build-reasonable.html",
    "summary": "It’s not enough to be secure. In today’s legal climate, you need to prove it.\nWhether you’re protecting a small company or managing compliance across a global enterprise, one thing is clear: cybersecurity can no longer be left to guesswork, vague frameworks, or best-effort intentions.\nRegulators and",
    "published": "2025-05-22T11:25:00",
    "source": "HackerNews"
  },
  {
    "title": "Identity Security Has an Automation Problem—And It's Bigger Than You Think",
    "link": "https://thehackernews.com/2025/05/identity-security-has-automation.html",
    "summary": "For many organizations, identity security appears to be under control. On paper, everything checks out. But new research from Cerby, based on insights from over 500 IT and security leaders, reveals a different reality: too much still depends on people—not systems—to function. In fact, fewer than 4% ",
    "published": "2025-05-22T11:11:00",
    "source": "HackerNews"
  },
  {
    "title": "Unpatched Versa Concerto Flaws Let Attackers Escape Docker and Compromise Host",
    "link": "https://thehackernews.com/2025/05/unpatched-versa-concerto-flaws-let.html",
    "summary": "Cybersecurity researchers have uncovered multiple critical security vulnerabilities impacting the Versa Concerto network security and SD-WAN orchestration platform that could be exploited to take control of susceptible instances.\nIt's worth noting that the identified shortcomings remain unpatched de",
    "published": "2025-05-22T11:06:00",
    "source": "HackerNews"
  },
  {
    "title": "Signal now blocks Microsoft Recall screenshots on Windows 11",
    "link": "https://www.bleepingcomputer.com/news/security/signal-now-blocks-microsoft-recall-screenshots-on-windows-11/",
    "summary": "​Signal has updated its Windows app to protect users' privacy by blocking Microsoft's AI-powered Recall feature from taking screenshots of their conversations. [...]",
    "published": "2025-05-22T10:32:23",
    "source": "BleepingComputer"
  },
  {
    "title": "Unpatched critical bugs in Versa Concerto lead to auth bypass, RCE",
    "link": "https://www.bleepingcomputer.com/news/security/unpatched-critical-bugs-in-versa-concerto-lead-to-auth-bypass-rce/",
    "summary": "Critical vulnerabilities in Versa Concerto that are still unpatched could allow remote attackers to bypass authentication and execute arbitrary code on affected systems. [...]",
    "published": "2025-05-22T09:18:18",
    "source": "BleepingComputer"
  },
  {
    "title": "FBI and Europol Disrupt Lumma Stealer Malware Network Linked to 10 Million Infections",
    "link": "https://thehackernews.com/2025/05/fbi-and-europol-disrupt-lumma-stealer.html",
    "summary": "A sprawling operation undertaken by global law enforcement agencies and a consortium of private sector firms has disrupted the online infrastructure associated with a commodity information stealer known as Lumma (aka LummaC or LummaC2), seizing 2,300 domains that acted as the command-and-control (C2",
    "published": "2025-05-22T08:24:00",
    "source": "HackerNews"
  }
]