[
  {
    "title": "Your AI Agents Might Be Leaking Data — Watch this Webinar to Learn How to Stop It",
    "link": "https://thehackernews.com/2025/07/your-ai-agents-might-be-leaking-data.html",
    "summary": "Generative AI is changing how businesses work, learn, and innovate. But beneath the surface, something dangerous is happening. AI agents and custom GenAI workflows are creating new, hidden ways for sensitive enterprise data to leak—and most teams don’t even realize it.\nIf you’re building, deploying,",
    "published": "2025-07-04T09:31:00",
    "source": "HackerNews"
  },
  {
    "title": "Critical Sudo Vulnerabilities Let Local Users Gain Root Access on Linux, Impacting Major Distros",
    "link": "https://thehackernews.com/2025/07/critical-sudo-vulnerabilities-let-local.html",
    "summary": "Cybersecurity researchers have disclosed two security flaws in the Sudo command-line utility for Linux and Unix-like operating systems that could enable local attackers to escalate their privileges to root on susceptible machines.\nA brief description of the vulnerabilities is below -\n\nCVE-2025-32462",
    "published": "2025-07-04T09:30:00",
    "source": "HackerNews"
  },
  {
    "title": "Google Ordered to Pay $314M for Misusing Android Users' Cellular Data Without Permission",
    "link": "https://thehackernews.com/2025/07/google-ordered-to-pay-314m-for-misusing.html",
    "summary": "Google has been ordered by a court in the U.S. state of California to pay $314 million over charges that it misused Android device users' cellular data when they were idle to passively send information to the company.\nThe verdict marks an end to a legal class-action complaint that was originally fil",
    "published": "2025-07-04T07:17:00",
    "source": "HackerNews"
  },
  {
    "title": "Leaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leaks-hint-at-operator-like-tool-in-chatgpt-ahead-of-gpt-5-launch/",
    "summary": "A few new code references in the ChatGPT web app and Android point to an Operator-like tool in GPT's chain of thoughts. [...]",
    "published": "2025-07-03T23:22:31",
    "source": "BleepingComputer"
  }
]