[
  {
    "title": "Anthropic web config hints at Claude Sonnet 4 and Opus 4",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/anthropic-web-config-hints-at-claude-sonnet-4-and-opus-4/",
    "summary": "Anthropic is secretly working on two new models called Claude Sonnet 4 and Opus 4, which are believed to be the company's most advanced AI models. [...]",
    "published": "2025-05-21T23:01:06",
    "source": "BleepingComputer"
  },
  {
    "title": "OpenAI hints at a big upgrade for ChatGPT Operator Agent",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-hints-at-a-big-upgrade-for-chatgpt-operator-agent/",
    "summary": "ChatGPT's Operator, which is still in research preview, will soon become a \"very useful tool,\" according to Jerry Tworek, VP of Research at OpenAI. [...]",
    "published": "2025-05-21T22:33:28",
    "source": "BleepingComputer"
  },
  {
    "title": "Critical Samlify SSO flaw lets attackers log in as admin",
    "link": "https://www.bleepingcomputer.com/news/security/critical-samlify-sso-flaw-lets-attackers-log-in-as-admin/",
    "summary": "A critical Samlify authentication bypass vulnerability has been discovered that allows attackers to impersonate admin users by injecting unsigned malicious assertions into legitimately signed SAML responses. [...]",
    "published": "2025-05-21T22:11:28",
    "source": "BleepingComputer"
  },
  {
    "title": "Russian hackers breach orgs to track aid routes to Ukraine",
    "link": "https://www.bleepingcomputer.com/news/security/russian-hackers-breach-orgs-to-track-aid-routes-to-ukraine/",
    "summary": "A Russian state-sponsored cyberespionage campaign attributed to APT28 (Fancy Bear/Forest Blizzard) hackers has been targeting and compromising international organizations since 2022 to disrupt aid efforts to Ukraine. [...]",
    "published": "2025-05-21T21:21:32",
    "source": "BleepingComputer"
  },
  {
    "title": "Russia to enforce location tracking app on all foreigners in Moscow",
    "link": "https://www.bleepingcomputer.com/news/government/russia-to-enforce-location-tracking-app-on-all-foreigners-in-moscow/",
    "summary": "The Russian government has introduced a new law that makes installing a tracking app mandatory for all foreign nationals in the Moscow region. [...]",
    "published": "2025-05-21T18:24:06",
    "source": "BleepingComputer"
  },
  {
    "title": "Russian Hackers Exploit Email and VPN Vulnerabilities to Spy on Ukraine Aid Logistics",
    "link": "https://thehackernews.com/2025/05/russian-hackers-exploit-email-and-vpn.html",
    "summary": "Russian cyber threat actors have been attributed to a state-sponsored campaign targeting Western logistics entities and technology companies since 2022.\nThe activity has been assessed to be orchestrated by APT28 (aka BlueDelta, Fancy Bear, or Forest Blizzard), which is linked to the Russian General ",
    "published": "2025-05-21T18:06:00",
    "source": "HackerNews"
  },
  {
    "title": "3AM ransomware uses spoofed IT calls, email bombing to breach networks",
    "link": "https://www.bleepingcomputer.com/news/security/3am-ransomware-uses-spoofed-it-calls-email-bombing-to-breach-networks/",
    "summary": "A 3AM ransomware affiliate is conducting highly targeted attacks using email bombing and spoofed IT support calls to socially engineer employees into giving credentials for remote access to corporate systems. [...]",
    "published": "2025-05-21T17:27:21",
    "source": "BleepingComputer"
  },
  {
    "title": "Lumma infostealer malware operation disrupted, 2,300 domains seized",
    "link": "https://www.bleepingcomputer.com/news/security/lumma-infostealer-malware-operation-disrupted-2-300-domains-seized/",
    "summary": "Earlier this month, a coordinated disruption action targeting the Lumma malware-as-a-service (MaaS) information stealer operation seized thousands of domains, part of its infrastructure backbone worldwide. [...]",
    "published": "2025-05-21T16:00:00",
    "source": "BleepingComputer"
  },
  {
    "title": "Data-stealing Chrome extensions impersonate Fortinet, YouTube, VPNs",
    "link": "https://www.bleepingcomputer.com/news/security/data-stealing-chrome-extensions-impersonate-fortinet-youtube-vpns/",
    "summary": "A Google Chrome Web Store campaign uses over 100 malicious browser extensions that mimic legitimate tools, such as VPNs, AI assistants, and crypto utilities, to steal browser cookies and execute remote scripts secretly. [...]",
    "published": "2025-05-21T15:13:34",
    "source": "BleepingComputer"
  },
  {
    "title": "ThreatLocker Patch Management: A Security-First Approach to Closing Vulnerability Windows",
    "link": "https://www.bleepingcomputer.com/news/security/threatlocker-patch-management-a-security-first-approach-to-closing-vulnerability-windows/",
    "summary": "Patching is basic cyber hygiene — but executing it at scale, securely, and fast? That's the real challenge. ThreatLocker's Patch Management flips the script with control, visibility, and Zero Trust workflows built for today's threat landscape. [...]",
    "published": "2025-05-21T14:02:12",
    "source": "BleepingComputer"
  }
]